## Creating a Series
There are several ways to create a Pandas Series. The most common methods involve using a list, NumPy array, or dictionary. You can also specify an index when creating a Series to label each element. The `pd.Series()` constructor is used to create a Series object.

### Creating a Series from a List, NumPy Array, or Dictionary
From a Python List: You can create a Series by passing a Python list to the pd.Series() constructor.

In [2]:
type(series)

pandas.core.series.Series

In [4]:
data = [1, 2, 3, 4, 5]
index_0 = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index_0, dtype='i4')
series

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [5]:
# From Dictionary
data = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}
series = pd.Series(data, dtype='int8')
series

a    1
b    2
c    3
d    4
e    5
dtype: int8

In [6]:
import numpy as np
series_from_numpy = pd.Series(np.array([1,2,3,4,5,]), index=np.array(['a', 'b', 'c','d','e']), dtype='int8')
series_from_numpy

a    1
b    2
c    3
d    4
e    5
dtype: int8

The pd.Series() constructor is the primary way to create a Series object. It accepts various data types as input, such as lists, NumPy arrays, dictionaries, and scalar values.

The general syntax for creating a Series using the pd.Series() constructor is:

`pd.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)`

* data: The input data for the Series, which can be a list, NumPy array, dictionary, or scalar value.
* index: (optional) The index labels for the Series. If not provided, an integer index starting from 0 is assigned.
* dtype: (optional) The data type of the Series elements. If not provided, Pandas infers the data type automatically.
* name: (optional) A name for the Series, which can be useful when combining multiple Series into a DataFrame.
* copy: (optional) Whether to create a copy of the input data. By default, it is set to False.
* fastpath: (optional) A performance optimization parameter, which is set to False by default.

In [7]:
data = [1, 2, 3, 4, 5]
index = ['a', 'b', 'c', 'd', 'e']
series = pd.Series(data, index=index, name='example', dtype='float64')
series

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example, dtype: float64

### Series Attributes

#### dtype: Data Type of the Series Elements

The dtype attribute returns the data type of the elements in the Series. It provides information about the type of data stored in the Series, such as integers, floats, strings, or custom data types.

In [8]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series.dtype

dtype('int64')

#### shape: Tuple of Series Dimensions
The shape attribute returns a tuple representing the dimensions of the Series. For a one-dimensional Series, the shape attribute returns a tuple with a single element indicating the length of the Series.

In [9]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series.shape

(5,)

#### size: Number of Elements in the Series
The size attribute returns the total number of elements in the Series. It represents the length of the Series.

In [ ]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series.size

#### index: Index Object of the Series
The index attribute returns the index object associated with the Series. The index object contains the labels or keys used to identify each element in the Series.

In [18]:
data = [1, 2, 3, 4, 5]
index = pd.Index(['a', 'b', 'c', 'd', 'e'], dtype='string')
series = pd.Series(data, index=index)
series.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='string')

#### values: NumPy Array of Series Values
The values attribute returns the underlying data of the Series as a NumPy array. It allows you to access the actual values stored in the Series.

In [19]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
series.values

array([1, 2, 3, 4, 5])

### Vectorized Operations
Pandas Series support various vectorized operations, such as arithmetic operations, mathematical functions, and boolean operations. These operations are applied element-wise to the Series.

In [20]:
data = [1, 2, 3, 4, 5]
series = pd.Series(data)

In [21]:
# Arithmetic operations
series + 2

0    3
1    4
2    5
3    6
4    7
dtype: int64

In [22]:
series ** 2

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [23]:
# Mathematical functions
np.sin(series)

0    0.841471
1    0.909297
2    0.141120
3   -0.756802
4   -0.958924
dtype: float64

In [24]:
np.log(series)

0    0.000000
1    0.693147
2    1.098612
3    1.386294
4    1.609438
dtype: float64

In [25]:
# Boolean operations
series > 3

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [26]:
series == 4

0    False
1    False
2    False
3     True
4    False
dtype: bool

### Label Alignment
When performing operations between two Series objects, Pandas automatically aligns the data based on their labels. This means that the operation is performed on the corresponding elements with the same label, regardless of their position in the Series.

In [ ]:
series1 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
series2 = pd.Series([4, 5, 6], index=['b', 'c', 'd'])

series1 + series2

# In this example, series1 and series2 have different indexes. When adding these Series together, Pandas aligns the data based on the common labels ('b' and 'c') and performs the addition operation. The resulting Series will have the union of the indexes from both Series.

# For labels that are present in one Series but not the other, the result will be marked as missing (NaN).

a    NaN
b    6.0
c    8.0
d    NaN
dtype: float64

## Common Series Methods
Pandas Series provide a wide range of built-in methods for data manipulation and analysis. These methods allow you to perform common operations on Series objects efficiently. Let's explore some of the frequently used Series methods.

`head()` and `tail()`: Viewing the First or Last n Elements
The `head()` and `tail()` methods allow you to view the first or last n elements of a Series, respectively. By default, these methods return the first or last 5 elements.

In [28]:
data = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(data)

series.head()  # First 5 elements is default so it can be modified to series.head(n = 8)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [29]:
series.tail(3)  # Last 3 elements

7     8
8     9
9    10
dtype: int64

### `unique()`: Returning Unique Values in a Series

The `unique()` method returns an array of unique values in the Series, eliminating any duplicates

In [30]:
data = [1, 2, 2, 3, 3, 3, 4, 4, 4, 4]
series = pd.Series(data)

series.unique()

array([1, 2, 3, 4])

### `value_counts()`: Counting Occurrences of Unique Values

The `value_counts()` method returns a Series containing the counts of each unique value in the original Series. It provides a convenient way to calculate the frequency of each value.

In [31]:
data = [1, 2, 2, 3, 3, 3, 4, 4, 4, 4]
series = pd.Series(data)

series.value_counts()

4    4
3    3
2    2
1    1
Name: count, dtype: int64

### `sort_values()`: Sorting a Series by 

The `sort_values()` method sorts the Series by its values in ascending or descending order. By default, it sorts the values in ascending order.

In [32]:
data = [4, 2, 8, 1, 9, 5]
series = pd.Series(data)

series.sort_values()

3    1
1    2
0    4
5    5
2    8
4    9
dtype: int64

In [33]:
series.sort_values(ascending=False)

4    9
2    8
5    5
0    4
1    2
3    1
dtype: int64

### `sort_index()`: Sorting a Series by Index

The `sort_index()` method sorts the Series by its index labels in ascending or descending order. By default, it sorts the index labels in ascending order.

To sort the index labels in descending order, you can pass the parameter `ascending=False` to the `sort_index()` method.

In [34]:
data = [4, 2, 8, 1, 9, 5]
index = ['b', 'd', 'a', 'e', 'c', 'f']
series = pd.Series(data, index=index)

series.sort_index()

a    8
b    4
c    9
d    2
e    1
f    5
dtype: int64

## Converting Series Data Types
Data type conversion is a crucial skill in data manipulation with Pandas. Understanding how to change the data type of a Series can help you optimize memory usage, perform specific operations, and ensure data consistency.

### Using astype() for Explicit Conversion
The primary method for converting data types in a Series is the astype() method. It allows you to explicitly specify the desired data type.

In [35]:
import pandas as pd
import numpy as np
# Create a sample Series
s = pd.Series(['1', '2', '3', '4', '5'])
s.dtype

dtype('O')

In [38]:
s

0    1
1    2
2    3
3    4
4    5
dtype: object

In [36]:
# Convert to integer
s_int = s.astype(int)
s_int.dtype

dtype('int64')

In [37]:
s_int

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [39]:
# Convert to float
s_float = s.astype(float)
s_float.dtype

dtype('float64')

### Handling Numeric Conversions
When converting between numeric types, be aware of potential data loss or unexpected results.

In [40]:
# Create a Series with mixed numeric types
s_mixed = pd.Series([1, 2.5, 3, 4.7, 5])
s_mixed.dtype

dtype('float64')

In [41]:
# Convert to integer (note the rounding)
s_mixed_int = s_mixed.astype(int)
s_mixed_int

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [42]:
# Convert to float (no data loss)
s_mixed_float = s_mixed.astype(float)
s_mixed_float

0    1.0
1    2.5
2    3.0
3    4.7
4    5.0
dtype: float64

### Converting to Datetime
Pandas provides powerful datetime conversion capabilities using `pd.to_datetime()`.

In [43]:
# Create a Series with date strings
dates = pd.Series(['2023-01-01', '2023-02-15', '2023-03-30'])
dates

0    2023-01-01
1    2023-02-15
2    2023-03-30
dtype: object

In [44]:
# Convert to datetime
dates_dt = pd.to_datetime(dates)
dates_dt.dtype

dtype('<M8[ns]')

In [49]:
# Handling different date formats
mixed_dates = pd.Series(['December 30, 2025', '2023-01-01', '15/02/2023', 'March 30, 2023'])
pd.to_datetime(mixed_dates, format='mixed').sort_values(ascending=False)

0   2025-12-30
3   2023-03-30
2   2023-02-15
1   2023-01-01
dtype: datetime64[ns]

### Converting to Categorical Data
Categorical data can be memory-efficient and useful for certain operations. You will learn about categorical data in more detail in the later lectures.

In [50]:
# Create a Series with repeated values
colors = pd.Series(['red', 'blue', 'green', 'red', 'blue', 'red', 'green'])
colors

0      red
1     blue
2    green
3      red
4     blue
5      red
6    green
dtype: object

In [51]:
# Convert to categorical
colors_cat = colors.astype('category')
colors_cat.dtype

CategoricalDtype(categories=['blue', 'green', 'red'], ordered=False, categories_dtype=object)

In [53]:
colors_cat.cat.categories

Index(['blue', 'green', 'red'], dtype='object')

In [54]:
# Get category codes
colors_cat.cat.codes

0    2
1    0
2    1
3    2
4    0
5    2
6    1
dtype: int8

For error handling, you can use the errors parameter to handle errors during conversion. The errors parameter can take the following values:

* raise: This is the default value and raises an exception if an error occurs.
* ignore: This ignores errors and returns the original input.
* coerce: This converts errors to NaN values.

In [55]:
# Series with unconvertible value
s_with_error = pd.Series(['1', '2', '3', 'four', '5'])
s_with_error

0       1
1       2
2       3
3    four
4       5
dtype: object

In [56]:
s_with_error.astype(int, errors='ignore')

0       1
1       2
2       3
3    four
4       5
dtype: object

In [60]:
try:
  s_with_error.astype(int, errors='raise')
except ValueError as e:
  print("Error", e)

Error invalid literal for int() with base 10: 'four'

## Creating DataFrames

### From dict of Series or dicts

In [13]:
import pandas as pd
d = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}

pd.DataFrame(d)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [14]:
pd.DataFrame(d, index=["d", "b", "a"], columns=["two", "three"])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

### From List with Column (Feild) name & Indecies

In [9]:
pd.DataFrame(
  [
    ['John', 30, 'New York'],
    ['Alice', 25, 'Chicago'],
    ['Henry', 22,'San Francisco'],
    ['Katie', 35, 'Miami'],
  ],
  columns=['Name', 'Age', 'City'],
  index=range(2,6)
  
)

    Name  Age           City
2   John   30       New York
3  Alice   25        Chicago
4  Henry   22  San Francisco
5  Katie   35          Miami

In [ ]:
# From List 
d = {"one": [1.0, 2.0, 3.0, 4.0], "two": [4.0, 3.0, 2.0, 1.0]}

pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

### From structured or record array

In [18]:
import numpy as np
data = np.zeros((2,), dtype=[("A", "i4"), ("B", "f4"), ("C", "a10")])
data.shape

/tmp/ipykernel_1654/1118049164.py:2: DeprecationWarning: Data type alias 'a' was deprecated in NumPy 2.0. Use the 'S' alias instead.
  data = np.zeros((2,), dtype=[("A", "i4"), ("B", "f4"), ("C", "a10")])

(2,)

In [19]:
data[:] = [(1, 2.0, "Hello"), (2, 3.0, "World")]

pd.DataFrame(data)

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

### From Dictionary

In [26]:
df = pd.DataFrame(
  {
    'Name':['John', 'Alice', 'Henry', "Katie"],
    'Age':[30, 25, 22, 35],
    'City': ['New York', "Chicago", 'San Francisco', "Miami"]
  }
)

df

    Name  Age           City
0   John   30       New York
1  Alice   25        Chicago
2  Henry   22  San Francisco
3  Katie   35          Miami

### From a list of dicts

In [23]:
data = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 20}]

pd.DataFrame(data, index = [10, 20])

    a   b     c
10  1   2   NaN
20  5  10  20.0

### From a dict of tuples

In [24]:
pd.DataFrame(
    {
        ("a", "b"): {("A", "B"): 1, ("A", "C"): 2},
        ("a", "a"): {("A", "C"): 3, ("A", "B"): 4},
        ("a", "c"): {("A", "B"): 5, ("A", "C"): 6},
        ("b", "a"): {("A", "C"): 7, ("A", "B"): 8},
        ("b", "b"): {("A", "D"): 9, ("A", "B"): 10},
    }
)

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

From a Series

In [25]:
ser = pd.Series(range(3), index=list("abc"), name="ser")

pd.DataFrame(ser)

   ser
a    0
b    1
c    2

### Alternate 

Pandas provides several alternate constructors for creating DataFrames from specific data formats:

`DataFrame.from_dict()` creates a DataFrame from a dictionary of dictionaries or a dictionary of array-like sequences. It operates like the DataFrame constructor, but allows specifying the orientation of the data using the orient parameter.

In [27]:
# Creating a DataFrame from a dictionary of lists
data = {"A": [1, 2, 3], "B": [4, 5, 6]}
df = pd.DataFrame.from_dict(data)
df

   A  B
0  1  4
1  2  5
2  3  6

<b>You can also specify the orient parameter to use the keys of the dictionary as row labels:</b>

In [28]:
df = pd.DataFrame.from_dict(data, orient="index", columns=["one", "two", "three"])
df

   one  two  three
A    1    2      3
B    4    5      6

`DataFrame.from_records()` creates a DataFrame from a list of tuples or a structured NumPy array. It works similarly to the DataFrame constructor, but allows specifying the index of the resulting DataFrame using a specific field of the structured dtype.

In [30]:
# Creating a DataFrame from a list of tuples
data = [(1, 2.0, "Hello"), (2, 3.0, "World")]
df = pd.DataFrame.from_records(data, columns=["A", "B", "C"])
df

   A    B      C
0  1  2.0  Hello
1  2  3.0  World

<b><i>You can also create a DataFrame from a structured NumPy array and specify the index using a specific field:</i></b>

In [31]:
import numpy as np
data = np.array([(1, 2.0, "Hello"), (2, 3.0, "World")],
                dtype=[("A", "i4"), ("B", "f4"), ("C", "U10")])
df = pd.DataFrame.from_records(data, index="C")
df

       A    B
C
Hello  1  2.0
World  2  3.0

### From a list of namedtuples

##### <i>Intersting</i>

In [29]:
from collections import namedtuple

Point = namedtuple("Point", "x y")

pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])

   x  y
0  0  0
1  0  3
2  2  3

### Attributes

In [36]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6], "C": [7, 8, 9]})
df.shape
df.columns
df.index
df.dtypes
df.values

array([[1, 4, 7],
       [2, 5, 8],
       [3, 6, 9]])

### Methods

#### `DataFrame.info()`

The `info()` method provides a concise summary of the DataFrame, including the column names, non-null counts, and data types.

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 204.0 bytes

#### `DataFrame.describe()`

The `describe()` method generates descriptive statistics of the DataFrame, including count, mean, standard deviation, minimum, maximum, and quartile values for numeric columns.

In [38]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   2.0  5.0  8.0
std    1.0  1.0  1.0
min    1.0  4.0  7.0
25%    1.5  4.5  7.5
50%    2.0  5.0  8.0
75%    2.5  5.5  8.5
max    3.0  6.0  9.0

`df.head(n =X)` & `df.tail(n=Y)`

### Sort Values

The `sort_values()` method sorts the DataFrame by the values of one or more columns.

In [39]:
df.sort_values(by='B') # Sort by a single column

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [40]:
df.sort_values(by='B', ascending=False) # Sort by a single column

   A  B  C
2  3  6  9
1  2  5  8
0  1  4  7

In [41]:
df.sort_values(by=['A', 'B']) # Sort by multiple columns

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [42]:
df.sort_index() # Sort by index

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [43]:
df.sort_index(ascending=False)

   A  B  C
2  3  6  9
1  2  5  8
0  1  4  7

The `transpose()` method transposes the DataFrame, i.e., swaps the rows and columns.

In [44]:
df.transpose()

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [45]:
df.T

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

### Arithmetic Operations between DataFrames

In [46]:
np.random.randn(5, 3)

array([[-1.79646185,  0.01517809,  1.51545331],
       [-0.87958476, -1.00940065, -1.42502232],
       [-2.34435247,  1.0084657 , -0.09913519],
       [-0.75440382, -0.01185033, -1.60035432],
       [ 1.11943317, -0.17560984, -0.25430956]])

In [47]:
df1 = pd.DataFrame(np.random.randn(5,3), columns=['A', 'B', 'C'])
df1

          A         B         C
0 -0.001521 -0.983633 -0.959799
1  0.003664 -0.941327 -1.707890
2 -0.246018 -1.018856 -0.277172
3 -0.761572  0.075664  0.040862
4 -0.903603  0.685943 -0.647992

In [49]:
df2 = pd.DataFrame(np.random.randn(4, 3), columns=["B", "C", "D"])
df2

          B         C         D
0  0.119325 -0.102261  0.298471
1  2.349317  1.104468  2.106047
2 -0.424648 -1.435082  0.984616
3 -0.724975 -0.747172  0.499049

In [50]:
df1 + df2

    A         B         C   D
0 NaN -0.864308 -1.062060 NaN
1 NaN  1.407991 -0.603422 NaN
2 NaN -1.443504 -1.712254 NaN
3 NaN -0.649312 -0.706310 NaN
4 NaN       NaN       NaN NaN

In [52]:
series = pd.Series(np.random.randn(3), index=["A", "B", "C"])

series

A   -2.839921
B   -1.026217
C    0.394558
dtype: float64

In [58]:
df1 - series

          A         B         C
0  2.838399  0.042584 -1.354356
1  2.843584  0.084890 -2.102447
2  2.593903  0.007361 -0.671730
3  2.078349  1.101881 -0.353696
4  1.936318  1.712160 -1.042550

In this example, the Series series is subtracted from each row of the DataFrame df. The Series is aligned based on the column labels of the DataFrame, and the subtraction is performed element-wise

In [59]:
df1 = pd.DataFrame({"A": [True, False, True], "B": [False, True, True]})
df2 = pd.DataFrame({"A": [False, True, True], "B": [True, True, False]})

df1 & df2

       A      B
0  False  False
1  False   True
2   True  False

### Flexible Arithmetic Methods
Pandas provides flexible arithmetic methods that allow you to specify the fill value for missing data and the axis along which the operation should be performed. These methods include add(), sub(), mul(), div(), and more.

In [60]:
df1 = pd.DataFrame({"A": [1, None, 3], "B": [4, 5, 6], "C": [7, 8, 9]})
series = pd.Series([10, 20, 30], index=["A", "B", "C"])

In [62]:
df1
series

A    10
B    20
C    30
dtype: int64

In [63]:
df1.add(series)

      A   B   C
0  11.0  24  37
1   NaN  25  38
2  13.0  26  39

In [64]:
df1.add(series, axis=1)

      A   B   C
0  11.0  24  37
1   NaN  25  38
2  13.0  26  39

In [65]:
df1.add(series, axis=0)

    A   B   C
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
A NaN NaN NaN
B NaN NaN NaN
C NaN NaN NaN

### Customizing the Display Settings

Pandas provides several options to customize the display settings of DataFrames in the console. These options can be set using the `pandas.set_option()` function.

* display.min_rows: Sets the minimum number of rows to display. If the DataFrame has fewer rows, Pandas will display all rows without truncation.
* display.max_rows: Sets the maximum number of rows to display. If the DataFrame has more rows, Pandas will truncate the output and display an ellipsis (...) to indicate that there are additional rows.
* display.max_columns: Sets the maximum number of columns to display. If the DataFrame has more columns, Pandas will truncate the output and display an ellipsis (...) to indicate that there are additional columns.
* display.precision: Sets the number of decimal places to display for floating-point values.

In [66]:
df = pd.DataFrame(np.random.randn(1000, 1000))

In [67]:
df

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
0,0.424043,1.950700,0.027523,-0.365133,-0.214336,-1.187760,-0.652880,-0.848754,1.154308,0.002273,...,-2.085905,-0.366356,-0.499798,-0.728202,-0.251491,-1.047763,0.049519,-0.617791,0.716098,-0.384514
1,-0.616081,-0.507655,0.673620,0.370682,-0.640893,1.142098,0.539241,0.540334,0.446682,-0.313517,...,-1.625549,0.208274,1.076854,-1.271476,-1.044507,1.045339,1.194466,-0.512540,0.040391,-0.293060
2,0.613760,-0.316571,0.447148,-1.357798,0.792322,1.834935,0.259924,-1.135231,-1.558786,0.318088,...,0.546593,-0.187470,-0.037117,1.029420,-1.622110,0.246504,-0.110248,-0.465345,0.110070,1.523432
3,1.830948,-1.502475,-0.284617,-2.507248,-0.453682,1.060933,0.020887,-0.266773,-0.779053,2.195924,...,0.267520,1.773878,0.397889,0.141733,-1.587761,-0.096907,-0.994767,0.699311,1.794406,-0.349952
4,-0.092282,0.773095,-0.632386,2.023150,-0.355660,0.956807,1.277834,0.309353,2.054777,-2.081474,...,-1.292170,1.831103,-0.338300,0.918333,0.000512,-1.200502,0.168320,-0.332228,-0.571100,-1.283991
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,-0.161691,-0.043253,-0.048264,-1.738309,0.030698,1.129018,-0.768164,1.952566,0.952657,0.396685,...,-1.026105,0.453834,-1.627777,-0.169803,1.086952,-0.242361,0.049696,0.934601,0.124467,-1.824169
996,-0.821755,1.513928,0.693573,-1.176096,0.978117,0.042452,1.011266,-2.317686,-2.296538,0.997146,...,-0.646565,0.434535,0.511635,-0.067549,0.107090,0.672660,-0.750387,1.918111,-0.674513,-0.708380
997,-0.839565,-1.408160,-0.089818,-0.620048,0.836892,0.023932,1.128359,0.584990,1.108369,0.500637,...,-1.337431,-0.168750,0.048888,1.416949,-0.838710,0.678913,1.484582,1.572860,0.341543,1.639038
998,1.994320,-0.952157,-1.453675,0.863997,0.743401,-1.810811,1.030398,-0.616233,-0.259149,-1.004567,...,0.970649,1.340566,1.602690,1.507836,-1.011496,-1.496680,0.009487,0.849000,-0.088777,1.152289
999,0.086940,-2.398426,0.634926,1.397273,-0.772251,-0.216482,0.558699,-0.244583,0.351006,0.776040,...,-0.084602,-0.837450,-0.774026,-1.359550,-0.129521,0.800408,0.851296,-0.307905,-0.026109,-0.416842

In [68]:
pd.set_option("display.min_rows", 20)
pd.set_option("display.max_rows", 40)

In [69]:
df

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
0,0.424043,1.950700,0.027523,-0.365133,-0.214336,-1.187760,-0.652880,-0.848754,1.154308,0.002273,...,-2.085905,-0.366356,-0.499798,-0.728202,-0.251491,-1.047763,0.049519,-0.617791,0.716098,-0.384514
1,-0.616081,-0.507655,0.673620,0.370682,-0.640893,1.142098,0.539241,0.540334,0.446682,-0.313517,...,-1.625549,0.208274,1.076854,-1.271476,-1.044507,1.045339,1.194466,-0.512540,0.040391,-0.293060
2,0.613760,-0.316571,0.447148,-1.357798,0.792322,1.834935,0.259924,-1.135231,-1.558786,0.318088,...,0.546593,-0.187470,-0.037117,1.029420,-1.622110,0.246504,-0.110248,-0.465345,0.110070,1.523432
3,1.830948,-1.502475,-0.284617,-2.507248,-0.453682,1.060933,0.020887,-0.266773,-0.779053,2.195924,...,0.267520,1.773878,0.397889,0.141733,-1.587761,-0.096907,-0.994767,0.699311,1.794406,-0.349952
4,-0.092282,0.773095,-0.632386,2.023150,-0.355660,0.956807,1.277834,0.309353,2.054777,-2.081474,...,-1.292170,1.831103,-0.338300,0.918333,0.000512,-1.200502,0.168320,-0.332228,-0.571100,-1.283991
5,0.897030,1.066520,-1.018624,-0.896104,-0.433526,1.283785,-0.525029,1.894256,-0.652282,1.059107,...,-0.417566,0.984164,-0.154069,-0.912949,-0.030545,-1.150995,1.075824,-0.294736,-0.663856,1.116662
6,0.596551,-1.088280,-2.185645,0.507137,0.051475,-0.384629,-0.011741,-0.399886,-0.716867,-0.945738,...,0.876835,0.204755,-0.855067,1.100452,0.826291,-1.343877,-0.209524,1.344430,1.005714,-1.139686
7,1.522669,-0.841973,0.912396,0.679693,-1.411721,-1.345242,0.392891,0.878588,0.496765,-1.575455,...,-0.124697,0.771295,0.202746,0.565268,-0.608273,0.429186,0.285012,-0.559698,-0.138767,-0.937102
8,-0.833026,-0.060672,-0.289508,-1.162832,-0.495872,-0.273368,-1.537902,-0.239529,1.498507,-0.859151,...,-0.517467,2.026194,-0.628998,1.850242,-0.730116,0.209155,-2.486585,0.543010,0.673274,0.236044
9,2.006207,-0.445959,-1.273726,-0.082926,-1.489726,0.749555,1.418491,0.529321,1.717726,-1.154864,...,0.738862,1.942417,-1.032838,0.517089,1.047255,-0.216799,0.786347,2.178811,0.408947,0.199428
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
990,2.036705,2.602144,-0.509575,0.384137,-0.032711,-0.719807,0.937336,-0.549631,0.082129,0.026559,...,0.084668,0.601060,0.480341,-0.825366,-2.636993,-0.232245,-0.664132,-0.299100,-0.974866,1.241390
991,0.054677,1.436858,-2.272146,1.287508,-0.191152,-0.433695,0.359367,1.406326,0.509873,0.512322,...,-0.667794,-2.167746,-0.771698,1.027173,0.279271,-1.264624,0.468412,0.481571,0.229591,1.532531
992,1.483297,-0.905350,-0.184138,1.128285,-0.353282,1.473325,-0.283260,-0.424396,1.131627,-1.415843,...,-0.529122,-0.825608,-0.268300,0.237429,1.037921,-0.823337,0.493243,0.202256,-0.000843,0.397353
993,1.905288,-0.123094,-0.312737,-0.093907,-0.095062,-0.885686,0.632702,0.697226,-1.150501,1.949535,...,-1.267009,-0.441321,1.062758,0.204252,-0.244156,-1.611740,-1.184828,-1.374144,-0.619807,1.257178
994,0.019027,-0.952292,0.339425,0.038634,-1.055104,0.491881,-2.132423,0.485781,1.558880,1.260824,...,-0.453335,1.007855,0.909092,0.464495,0.292367,1.181192,0.749639,-0.130388,-0.197291,-0.132995
995,-0.161691,-0.043253,-0.048264,-1.738309,0.030698,1.129018,-0.768164,1.952566,0.952657,0.396685,...,-1.026105,0.453834,-1.627777,-0.169803,1.086952,-0.242361,0.049696,0.934601,0.124467,-1.824169
996,-0.821755,1.513928,0.693573,-1.176096,0.978117,0.042452,1.011266,-2.317686,-2.296538,0.997146,...,-0.646565,0.434535,0.511635,-0.067549,0.107090,0.672660,-0.750387,1.918111,-0.674513,-0.708380
997,-0.839565,-1.408160,-0.089818,-0.620048,0.836892,0.023932,1.128359,0.584990,1.108369,0.500637,...,-1.337431,-0.168750,0.048888,1.416949,-0.838710,0.678913,1.484582,1.572860,0.341543,1.639038
998,1.994320,-0.952157,-1.453675,0.863997,0.743401,-1.810811,1.030398,-0.616233,-0.259149,-1.004567,...,0.970649,1.340566,1.602690,1.507836,-1.011496,-1.496680,0.009487,0.849000,-0.088777,1.152289
999,0.086940,-2.398426,0.634926,1.397273,-0.772251,-0.216482,0.558699,-0.244583,0.351006,0.776040,...,-0.084602,-0.837450,-0.774026,-1.359550,-0.129521,0.800408,0.851296,-0.307905,-0.026109,-0.416842

In [70]:
pd.reset_option("display.min_rows")
pd.reset_option("display.max_rows")

In [71]:
pd.set_option("display.max_columns", 50)
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,...,975,976,977,978,979,980,981,982,983,984,985,986,987,988,989,990,991,992,993,994,995,996,997,998,999
0,0.424043,1.950700,0.027523,-0.365133,-0.214336,-1.187760,-0.652880,-0.848754,1.154308,0.002273,1.084094,-1.298825,1.265410,-0.076085,0.630914,1.578861,-1.208002,-0.889695,-1.530491,-1.074806,0.819079,0.810001,0.811337,0.112674,-0.922883,...,1.012004,0.434965,-0.148141,-0.800868,-0.192673,0.383450,-1.537418,-0.648121,-1.363057,-0.260747,-0.468369,-1.954493,-1.635864,-0.211679,-0.781334,-2.085905,-0.366356,-0.499798,-0.728202,-0.251491,-1.047763,0.049519,-0.617791,0.716098,-0.384514
1,-0.616081,-0.507655,0.673620,0.370682,-0.640893,1.142098,0.539241,0.540334,0.446682,-0.313517,0.933975,-0.982771,1.319197,-1.123304,-0.618833,-0.467867,0.685743,-0.370153,-1.303363,-0.178681,0.537494,0.467369,0.229489,1.545595,1.687615,...,0.484676,-0.433369,-0.968863,-0.522424,0.060983,-0.477509,-2.963420,-1.161357,-0.006708,1.931784,-1.055921,-0.116775,-0.011365,-2.607441,1.283029,-1.625549,0.208274,1.076854,-1.271476,-1.044507,1.045339,1.194466,-0.512540,0.040391,-0.293060
2,0.613760,-0.316571,0.447148,-1.357798,0.792322,1.834935,0.259924,-1.135231,-1.558786,0.318088,-0.718588,-1.711795,-1.518230,-1.284437,-0.456590,-0.702509,-1.190279,-0.089114,1.100577,-1.647515,-0.231480,-0.834675,0.962549,-0.055656,-1.360099,...,-0.184958,-0.991612,0.738840,-1.035228,-1.440877,0.007318,2.622086,-0.806466,-2.564479,1.589594,0.461443,1.054860,0.350918,0.564762,-0.440133,0.546593,-0.187470,-0.037117,1.029420,-1.622110,0.246504,-0.110248,-0.465345,0.110070,1.523432
3,1.830948,-1.502475,-0.284617,-2.507248,-0.453682,1.060933,0.020887,-0.266773,-0.779053,2.195924,0.008217,1.035692,-0.805893,0.170530,1.757692,-0.656207,0.892588,0.171564,1.739253,0.887246,0.881403,-1.245764,-1.682075,0.814128,0.411289,...,-0.105735,1.698651,0.302858,0.264803,1.257113,0.212068,-1.540911,0.426573,0.090839,-0.295227,1.532973,-1.254052,0.820008,0.368153,0.387998,0.267520,1.773878,0.397889,0.141733,-1.587761,-0.096907,-0.994767,0.699311,1.794406,-0.349952
4,-0.092282,0.773095,-0.632386,2.023150,-0.355660,0.956807,1.277834,0.309353,2.054777,-2.081474,-0.884334,1.007465,-0.750650,0.906303,2.718760,-0.163323,-0.312179,-0.452276,1.542858,-0.232066,0.539850,0.342789,-0.417110,0.305143,-0.336749,...,0.097591,1.835029,0.467593,-0.727510,-0.238615,-0.143301,-1.111026,0.602339,-1.503933,0.832544,-0.919069,-2.260029,0.554645,-1.153298,-0.215847,-1.292170,1.831103,-0.338300,0.918333,0.000512,-1.200502,0.168320,-0.332228,-0.571100,-1.283991
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,-0.161691,-0.043253,-0.048264,-1.738309,0.030698,1.129018,-0.768164,1.952566,0.952657,0.396685,-1.798525,1.560445,0.816071,-0.280943,-0.224605,-0.421689,1.078397,2.050860,-0.403017,1.384034,1.834639,1.133374,0.305023,-0.068445,-0.081403,...,0.885181,-0.008568,-0.380464,0.962396,0.287487,0.661310,-0.167858,-0.055429,0.659669,-0.020112,-0.653915,1.974250,-0.454693,0.231943,1.454627,-1.026105,0.453834,-1.627777,-0.169803,1.086952,-0.242361,0.049696,0.934601,0.124467,-1.824169
996,-0.821755,1.513928,0.693573,-1.176096,0.978117,0.042452,1.011266,-2.317686,-2.296538,0.997146,-0.472982,1.124996,1.186255,1.094617,0.376529,0.162765,0.806922,0.223517,0.538245,-0.157568,-1.393492,0.422064,-0.064296,-0.660252,0.644573,...,-0.220948,0.598691,0.402413,1.138124,1.171185,-0.767518,0.411984,0.894371,-0.817780,0.331680,1.197006,-0.608830,-0.205892,-0.392739,0.143566,-0.646565,0.434535,0.511635,-0.067549,0.107090,0.672660,-0.750387,1.918111,-0.674513,-0.708380
997,-0.839565,-1.408160,-0.089818,-0.620048,0.836892,0.023932,1.128359,0.584990,1.108369,0.500637,-0.657824,-1.348132,0.927438,0.845521,2.168345,-0.648169,0.837560,0.882888,1.328926,0.059405,0.818535,-2.789127,-0.262334,-0.710509,0.662855,...,1.301945,-0.939652,1.075252,1.475358,-1.220713,-0.276909,1.618604,-0.762948,-0.177767,0.246070,-0.328234,-0.842506,-0.137780,1.137929,-1.045221,-1.337431,-0.168750,0.048888,1.416949,-0.838710,0.678913,1.484582,1.572860,0.341543,1.639038
998,1.994320,-0.952157,-1.453675,0.863997,0.743401,-1.810811,1.030398,-0.616233,-0.259149,-1.004567,-0.441915,-0.479847,-0.843057,0.167086,0.947639,0.035287,-0.228955,-0.778274,-1.734235,-2.027817,0.490386,0.658768,-1.157819,0.497383,0.131906,...,1.891383,-1.604650,-0.632411,0.824563,1.669933,0.636418,0.506632,0.125013,-0.807290,0.505981,0.358254,2.212184,-0.564405,2.048045,0.219233,0.970649,1.340566,1.602690,1.507836,-1.011496,-1.496680,0.009487,0.849000,-0.088777,1.152289
999,0.086940,-2.398426,0.634926,1.397273,-0.772251,-0.216482,0.558699,-0.244583,0.351006,0.776040,-0.746889,0.362626,-0.968363,-0.419262,0.914104,0.080197,0.203761,-0.287544,-0.061280,-0.113150,0.813637,0.193879,-0.725597,0.368879,2.003801,...,0.430230,0.448834,-0.367328,-0.790521,-0.015712,-0.680159,-2.087372,-0.820484,-0.296165,0.196626,-0.072860,0.424766,-0.050804,-0.570723,0.199723,-0.084602,-0.837450,-0.774026,-1.359550,-0.129521,0.800408,0.851296,-0.307905,-0.026109,-0.416842

In [72]:
pd.reset_option("display.max_columns")
df

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
0,0.424043,1.950700,0.027523,-0.365133,-0.214336,-1.187760,-0.652880,-0.848754,1.154308,0.002273,...,-2.085905,-0.366356,-0.499798,-0.728202,-0.251491,-1.047763,0.049519,-0.617791,0.716098,-0.384514
1,-0.616081,-0.507655,0.673620,0.370682,-0.640893,1.142098,0.539241,0.540334,0.446682,-0.313517,...,-1.625549,0.208274,1.076854,-1.271476,-1.044507,1.045339,1.194466,-0.512540,0.040391,-0.293060
2,0.613760,-0.316571,0.447148,-1.357798,0.792322,1.834935,0.259924,-1.135231,-1.558786,0.318088,...,0.546593,-0.187470,-0.037117,1.029420,-1.622110,0.246504,-0.110248,-0.465345,0.110070,1.523432
3,1.830948,-1.502475,-0.284617,-2.507248,-0.453682,1.060933,0.020887,-0.266773,-0.779053,2.195924,...,0.267520,1.773878,0.397889,0.141733,-1.587761,-0.096907,-0.994767,0.699311,1.794406,-0.349952
4,-0.092282,0.773095,-0.632386,2.023150,-0.355660,0.956807,1.277834,0.309353,2.054777,-2.081474,...,-1.292170,1.831103,-0.338300,0.918333,0.000512,-1.200502,0.168320,-0.332228,-0.571100,-1.283991
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,-0.161691,-0.043253,-0.048264,-1.738309,0.030698,1.129018,-0.768164,1.952566,0.952657,0.396685,...,-1.026105,0.453834,-1.627777,-0.169803,1.086952,-0.242361,0.049696,0.934601,0.124467,-1.824169
996,-0.821755,1.513928,0.693573,-1.176096,0.978117,0.042452,1.011266,-2.317686,-2.296538,0.997146,...,-0.646565,0.434535,0.511635,-0.067549,0.107090,0.672660,-0.750387,1.918111,-0.674513,-0.708380
997,-0.839565,-1.408160,-0.089818,-0.620048,0.836892,0.023932,1.128359,0.584990,1.108369,0.500637,...,-1.337431,-0.168750,0.048888,1.416949,-0.838710,0.678913,1.484582,1.572860,0.341543,1.639038
998,1.994320,-0.952157,-1.453675,0.863997,0.743401,-1.810811,1.030398,-0.616233,-0.259149,-1.004567,...,0.970649,1.340566,1.602690,1.507836,-1.011496,-1.496680,0.009487,0.849000,-0.088777,1.152289
999,0.086940,-2.398426,0.634926,1.397273,-0.772251,-0.216482,0.558699,-0.244583,0.351006,0.776040,...,-0.084602,-0.837450,-0.774026,-1.359550,-0.129521,0.800408,0.851296,-0.307905,-0.026109,-0.416842

In [73]:
pd.set_option("display.precision", 2)
df

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
0,0.42,1.95,0.03,-0.37,-0.21,-1.19,-0.65,-0.85,1.15,2.27e-03,...,-2.09,-0.37,-0.50,-0.73,-2.51e-01,-1.05,4.95e-02,-0.62,0.72,-0.38
1,-0.62,-0.51,0.67,0.37,-0.64,1.14,0.54,0.54,0.45,-3.14e-01,...,-1.63,0.21,1.08,-1.27,-1.04e+00,1.05,1.19e+00,-0.51,0.04,-0.29
2,0.61,-0.32,0.45,-1.36,0.79,1.83,0.26,-1.14,-1.56,3.18e-01,...,0.55,-0.19,-0.04,1.03,-1.62e+00,0.25,-1.10e-01,-0.47,0.11,1.52
3,1.83,-1.50,-0.28,-2.51,-0.45,1.06,0.02,-0.27,-0.78,2.20e+00,...,0.27,1.77,0.40,0.14,-1.59e+00,-0.10,-9.95e-01,0.70,1.79,-0.35
4,-0.09,0.77,-0.63,2.02,-0.36,0.96,1.28,0.31,2.05,-2.08e+00,...,-1.29,1.83,-0.34,0.92,5.12e-04,-1.20,1.68e-01,-0.33,-0.57,-1.28
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,-0.16,-0.04,-0.05,-1.74,0.03,1.13,-0.77,1.95,0.95,3.97e-01,...,-1.03,0.45,-1.63,-0.17,1.09e+00,-0.24,4.97e-02,0.93,0.12,-1.82
996,-0.82,1.51,0.69,-1.18,0.98,0.04,1.01,-2.32,-2.30,9.97e-01,...,-0.65,0.43,0.51,-0.07,1.07e-01,0.67,-7.50e-01,1.92,-0.67,-0.71
997,-0.84,-1.41,-0.09,-0.62,0.84,0.02,1.13,0.58,1.11,5.01e-01,...,-1.34,-0.17,0.05,1.42,-8.39e-01,0.68,1.48e+00,1.57,0.34,1.64
998,1.99,-0.95,-1.45,0.86,0.74,-1.81,1.03,-0.62,-0.26,-1.00e+00,...,0.97,1.34,1.60,1.51,-1.01e+00,-1.50,9.49e-03,0.85,-0.09,1.15
999,0.09,-2.40,0.63,1.40,-0.77,-0.22,0.56,-0.24,0.35,7.76e-01,...,-0.08,-0.84,-0.77,-1.36,-1.30e-01,0.80,8.51e-01,-0.31,-0.03,-0.42

In [ ]:
pd.reset_option("display.precision")
df

### Hiding or Showing Index and Column Labels

By default, Pandas displays the index and column labels when printing a DataFrame. However, you can control whether to hide or show these labels using the index and header parameters.

`to_string(index=False)`: Converts the DataFrame to a string representation without displaying the index labels.
`to_string(header=False)`: Converts the DataFrame to a string representation without displaying the column labels.

In [74]:
df = pd.DataFrame(np.random.randn(5, 3), columns=["A", "B", "C"])
# Hiding the index labels
print(df.to_string(index=False))

    A     B     C
 0.18 -0.67 -0.72
-0.19  0.09 -0.81
 0.91  2.51 -1.09
 1.34  1.06 -0.06
-0.17 -0.88 -0.86

In [75]:
# Hiding the column labels
print(df.to_string(header=False, index=False))

 0.18 -0.67 -0.72
-0.19  0.09 -0.81
 0.91  2.51 -1.09
 1.34  1.06 -0.06
-0.17 -0.88 -0.86

Pandas provides a wide range of indexing choices to suit different data access and manipulation requirements. These indexing choices offer flexibility and power in working with your data, allowing you to select, filter, and transform your data efficiently. Let's explore the various indexing choices available in Pandas.

1. <b>Label-based Indexing</b>: Label-based indexing allows you to access data based on the labels of the index or columns. In Pandas, you can use the loc accessor to perform label-based indexing. With loc, you can select data using single labels, lists of labels, or slices of labels.

Example:

`df.loc[['row1', 'row2'], ['col1', 'col2']]`

2. <b>Integer-based Indexing</b>: Integer-based indexing allows you to access data based on the integer positions of the index or columns. In Pandas, you can use the iloc accessor to perform integer-based indexing. With iloc, you can select data using single integers, lists of integers, or slices of integers.

Example:

`df.iloc[[0, 1], [0, 1]]`

3. <b>Boolean Indexing</b>: Boolean indexing allows you to select data based on boolean conditions. You can provide a boolean mask or a boolean expression to filter rows or columns that satisfy the given condition. Boolean indexing is a powerful way to select data based on specific criteria.

Example:

`df[df['col1'] > 10]`

4. <b>Indexing with MultiIndex</b>: Pandas provides the ability to work with hierarchical or multi-level indexes, known as MultiIndex. MultiIndex allows you to have multiple levels of indexing, enabling more complex data structures. You can use tuple-based indexing or the xs method to select data from a MultiIndex.

Example:

`df.loc[('level1', 'level2'), 'col1']`

5. <b>Indexing with DatetimeIndex</b>: When working with time series data, Pandas offers specialized indexing using DatetimeIndex. You can select data based on datetime labels, date ranges, or time periods. DatetimeIndex provides convenient methods for resampling and aggregating time series data.

Example:

`df.loc['2023-01-01':'2023-12-31']`

In [79]:
import pandas as pd
series = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
series

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
series['a'] # Accessing elements using index labels

np.int64(1)

In [81]:

series[0]

/tmp/ipykernel_1654/1681138671.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  series[0]

np.int64(1)

In [ ]:

series['b':'d'] # Inclusive!

b    2
c    3
d    4
dtype: int64

In [ ]:
series[1:3]  #Slicing a Series using integer positions:

b    2
c    3
dtype: int64

In [77]:
df = pd.DataFrame(
  {
    'Name':['John', 'Alice', 'Henry', "Katie"],
    'Age':[30, 25, 22, 35],
    'City': ['New York', "Chicago", 'San Francisco', "Miami"]
  },
  index=['001', '002', '003', '004']
)

df

      Name  Age           City
001   John   30       New York
002  Alice   25        Chicago
003  Henry   22  San Francisco
004  Katie   35          Miami

In [86]:
df["Age"]

001    30
002    25
003    22
004    35
Name: Age, dtype: int64

In [87]:
df[["City", "Name"]]

              City   Name
001       New York   John
002        Chicago  Alice
003  San Francisco  Henry
004          Miami  Katie

### Selecting Rows in a DataFrame

To select specific rows in a DataFrame, you can use index labels or integer positions.

* Selecting a single row by <b>index label</b>: `df.loc[]`
* Selecting a single row by <b>integer position</b>: `df.iloc[]`
* Selecting multiple rows using index labels & Selecting multiple rows using integer positions:

In [91]:
df.loc['003']

Name            Henry
Age                22
City    San Francisco
Name: 003, dtype: object

In [92]:
df.iloc[1]

Name      Alice
Age          25
City    Chicago
Name: 002, dtype: object

In [93]:
df.loc[["003", '001']]

      Name  Age           City
003  Henry   22  San Francisco
001   John   30       New York

In [96]:
df.iloc[[0,3]]

      Name  Age      City
001   John   30  New York
004  Katie   35     Miami

### Slicing Rows and Columns
You can also use slicing to select a range of rows or columns in a DataFrame.

* Slicing rows using index labels
* Slicing rows using integer positions
* Slicing columns using column names (labels)
* Slicing columns using integer positions

In [ ]:
df.loc["002":'004'] # inclusive!

      Name  Age           City
002  Alice   25        Chicago
003  Henry   22  San Francisco
004  Katie   35          Miami

In [ ]:
df.iloc[2:3] # Exclusive for the most right number!

      Name  Age           City
003  Henry   22  San Francisco

In [99]:
df.loc[: , ["Age", "Name"]]

     Age   Name
001   30   John
002   25  Alice
003   22  Henry
004   35  Katie

In [100]:
df.iloc[1:3, 0:2]

      Name  Age
002  Alice   25
003  Henry   22

### Fast Scalar Value Getting and Setting

When working with large datasets in Pandas, performance becomes a critical factor. Accessing and modifying individual scalar values in a DataFrame can be a common operation, but using the standard indexing methods may not always be the most efficient approach. Pandas provides optimized methods, at and iat, for fast scalar value getting and setting. Let's explore how to use these methods effectively.

Pandas offers two optimized methods for accessing and modifying individual scalar values in a DataFrame:

1. at: This method is used for label-based scalar access and setting. It takes row and column labels as arguments.
2. iat: This method is used for integer-based scalar access and setting. It takes row and column integer positions as arguments.
3. 
These methods are optimized for performance and provide faster access and modification compared to the standard indexing methods, such as loc and iloc, when working with scalar values.

### Using at for Fast Scalar Value Getting and Setting
The at method is used for label-based scalar access and setting. It allows you to quickly retrieve or modify a single value in a DataFrame by specifying the row and column labels.

Here's an example of using at for scalar value getting

In [101]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]}, index=['a', 'b', 'c'])
df

   A  B
a  1  4
b  2  5
c  3  6

In [102]:
df.at['b', 'A']

np.int64(2)

In [103]:
# Cahnge a scalar number in DataFrame
df.at['b', 'A'] = 10
df

    A  B
a   1  4
b  10  5
c   3  6

### Using iat for Fast Scalar Value Getting and Setting

The iat method is used for integer-based scalar access and setting. It allows you to quickly retrieve or modify a single value in a DataFrame by specifying the row and column integer positions.

Here's an example of using iat for scalar value getting:

In [104]:
df.iat[1, 0]

np.int64(10)

In [105]:
df.iat[1, 0] = 100
df

     A  B
a    1  4
b  100  5
c    3  6

## Performance Considerations

In [110]:
import numpy as np

# Create a sample DataFrame with 1 million rows and 3 columns
data = np.random.randint(0, 100, size=(1000000, 3))
df = pd.DataFrame(data, columns=['A', 'B', 'C'])
# Access a single value using at
%timeit df.at[500000, 'B']

# # Access a single value using iat
%timeit df.iat[500000, 1]
# )
# # Access a single value using loc
%timeit df.loc[500000, 'B']

# # Access a single value using iloc
%timeit df.iloc[500000, 1]

1.97 s  83.6 ns per loop (mean  std. dev. of 7 runs, 100,000 loops each)
9.61 s  410 ns per loop (mean  std. dev. of 7 runs, 100,000 loops each)
4.74 s  328 ns per loop (mean  std. dev. of 7 runs, 100,000 loops each)
12.9 s  435 ns per loop (mean  std. dev. of 7 runs, 100,000 loops each)

### Adding & Removing Columns

In [113]:
data = {
  'Name': ['John', 'Alice', 'Bob', 'Mike', 'Shila'],
  'Age': [25,32,30,25,31],
  'City': ["New York", "London", "Paris", "Washington", "Toronto"],
  'Salary': [50000, 60000, 65000, 45000, 70000],
}

df = pd.DataFrame(data= data)

In [115]:
df['Department'] = ['HR', 'IT', 'Engineering', 'Transportation', 'IT']
df

    Name  Age        City  Salary      Department
0   John   25    New York   50000              HR
1  Alice   32      London   60000              IT
2    Bob   30       Paris   65000     Engineering
3   Mike   25  Washington   45000  Transportation
4  Shila   31     Toronto   70000              IT

In [116]:
df['Bonus'] = df['Salary'] * 0.1

In [117]:
df

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0

### Dropping a COlumns

The drop() by default works on rows not columns

In [ ]:
df.drop('Bonus', axis=1) # Drop column with Bonus field

    Name  Age        City  Salary      Department
0   John   25    New York   50000              HR
1  Alice   32      London   60000              IT
2    Bob   30       Paris   65000     Engineering
3   Mike   25  Washington   45000  Transportation
4  Shila   31     Toronto   70000              IT

In [ ]:
df.drop(2) # Drop the third (index of 2 since strats from 0) observation or row!

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0

In [121]:
df.drop([0,1,4])

   Name  Age        City  Salary      Department   Bonus
2   Bob   30       Paris   65000     Engineering  6500.0
3  Mike   25  Washington   45000  Transportation  4500.0

In [122]:
df.drop(['Name', 'Salary'], axis = 1)

   Age        City      Department   Bonus
0   25    New York              HR  5000.0
1   32      London              IT  6000.0
2   30       Paris     Engineering  6500.0
3   25  Washington  Transportation  4500.0
4   31     Toronto              IT  7000.0

### Best Practice 

Aviod using axis = 0 or axis = 1 instead use the argument of columns or index

In [123]:
df.drop(columns=['Salary', 'Age'])

    Name        City      Department   Bonus
0   John    New York              HR  5000.0
1  Alice      London              IT  6000.0
2    Bob       Paris     Engineering  6500.0
3   Mike  Washington  Transportation  4500.0
4  Shila     Toronto              IT  7000.0

In [124]:
df.drop(index=3)

    Name  Age      City  Salary   Department   Bonus
0   John   25  New York   50000           HR  5000.0
1  Alice   32    London   60000           IT  6000.0
2    Bob   30     Paris   65000  Engineering  6500.0
4  Shila   31   Toronto   70000           IT  7000.0

In [125]:
df.drop(columns=['Age', 'Bonus'], index=[2,4])

    Name        City  Salary      Department
0   John    New York   50000              HR
1  Alice      London   60000              IT
3   Mike  Washington   45000  Transportation

### Adding and Removing Rows (Observations)

In [126]:
df

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0

In [129]:
added_records = pd.DataFrame(
  {
    'Name':['Jamal', 'Sonia'],
    'Age': [34, 23],
    'City': ['New York', "London"],
    'Salary': [55000, 53000],
    'Department': ['Health', 'Logistics'],
    'Bonus':[3000, 2500]
  }
)
added_records

    Name  Age      City  Salary Department  Bonus
0  Jamal   34  New York   55000     Health   3000
1  Sonia   23    London   53000  Logistics   2500

In [ ]:
pd.concat(objs=[df,added_records])
# Keeps the original Indecis

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0
0  Jamal   34    New York   55000          Health  3000.0
1  Sonia   23      London   53000       Logistics  2500.0

In [131]:
pd.concat(objs=[df,added_records], ignore_index=True)
# Keeps the original Indecis

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0
5  Jamal   34    New York   55000          Health  3000.0
6  Sonia   23      London   53000       Logistics  2500.0

In [132]:
df[df['Age']< 35]

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0

## Renaming Columns (Field Name) & Indecis

In [133]:
s = pd.Series(data= [25, 45, 69,32,54,12],name="Age")

In [ ]:
s
# or s.name = 'Age'

0    25
1    45
2    69
3    32
4    54
5    12
Name: Age, dtype: int64

In [136]:
df.rename(columns={'Name': 'First Name'}, index={0: '001', 1: '002'})

    First Name  Age        City  Salary      Department   Bonus
001       John   25    New York   50000              HR  5000.0
002      Alice   32      London   60000              IT  6000.0
2          Bob   30       Paris   65000     Engineering  6500.0
3         Mike   25  Washington   45000  Transportation  4500.0
4        Shila   31     Toronto   70000              IT  7000.0

## Updating Values in DataFrames

Use loc[]

In [142]:
df

    Name  Age        City  Salary      Department   Bonus  (5, Salary)
0   John   25    New York   50000              HR  5000.0        67000
1  Alice   32      London   60000              IT  6000.0        67000
2    Bob   30       Paris   65000     Engineering  6500.0        67000
3   Mike   25  Washington   45000  Transportation  4500.0        67000
4  Shila   31     Toronto   70000              IT  7000.0        67000

In [138]:
df[5, "Salary"] = 67000

In [152]:
df.drop(columns = [(5, 'Salary')])

    Name  Age        City  Salary      Department   Bonus
0   John   25    New York   50000              HR  5000.0
1  Alice   32      London   60000              IT  6000.0
2    Bob   30       Paris   65000     Engineering  6500.0
3   Mike   25  Washington   45000  Transportation  4500.0
4  Shila   31     Toronto   70000              IT  7000.0

In [153]:
df.loc[5, 'Salary'] = 68000

In [156]:
df['City']=='Paris'

0    False
1    False
2     True
3    False
4    False
5    False
Name: City, dtype: bool

In [157]:
df.loc[df['City'] == 'Paris', 'Salary'] = 65000

In [158]:
df

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN

In [160]:
df.drop([5])

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0

In [161]:
df.sort_index(ascending=True)

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN

In [162]:
df.sort_values(by="Age", ascending=True)

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN

#### To copy data into some files or other screens

`to-string(index= False, header= False)`

In [166]:
df.describe()

         Age    Salary    Bonus  (5, Salary)
count   5.00      6.00     5.00          5.0
mean   28.60  59666.67  5800.00      67000.0
std     3.36  10132.46  1036.82          0.0
min    25.00  45000.00  4500.00      67000.0
25%    25.00  52500.00  5000.00      67000.0
50%    30.00  62500.00  6000.00      67000.0
75%    31.00  67250.00  6500.00      67000.0
max    32.00  70000.00  7000.00      67000.0

In [164]:
df.describe().to_string(header=False)

'count   5.00      6.00     5.00      5.0\nmean   28.60  59666.67  5800.00  67000.0\nstd     3.36  10132.46  1036.82      0.0\nmin    25.00  45000.00  4500.00  67000.0\n25%    25.00  52500.00  5000.00  67000.0\n50%    30.00  62500.00  6000.00  67000.0\n75%    31.00  67250.00  6500.00  67000.0\nmax    32.00  70000.00  7000.00  67000.0'

In [169]:
print(df.describe().to_string(header=False))

count   5.00      6.00     5.00      5.0
mean   28.60  59666.67  5800.00  67000.0
std     3.36  10132.46  1036.82      0.0
min    25.00  45000.00  4500.00  67000.0
25%    25.00  52500.00  5000.00  67000.0
50%    30.00  62500.00  6000.00  67000.0
75%    31.00  67250.00  6500.00  67000.0
max    32.00  70000.00  7000.00  67000.0

### Selecting Random Samples

The `sample()` method in Pandas allows you to randomly select a specified number of rows from a Series or DataFrame. It returns a new Series or DataFrame containing the randomly selected samples. It also provides several parameters to control the random sampling process:

* n: The number of items to return. If not specified, a single item is returned.
* frac: The fraction of items to return. If n is not specified, frac must be between 0 and 1.
* replace: Whether to allow sampling with replacement. If True, selected items can be chosen again.
* weights: Probabilities associated with each item. If not specified, items are chosen with equal probability.
* random_state: The seed for the random number generator. Specifying a fixed value allows for reproducibility.

In [170]:
df

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN

In [172]:
df.sample(n=3)

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
1  Alice  32.0      London  60000.0              IT  6000.0      67000.0
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0

In [173]:
df.sample(frac=0.4)

   Name   Age      City   Salary   Department   Bonus  (5, Salary)
0  John  25.0  New York  50000.0           HR  5000.0      67000.0
2   Bob  30.0     Paris  65000.0  Engineering  6500.0      67000.0

In [174]:
df.sample(n=10, replace=True)

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
0   John  25.0    New York  50000.0              HR  5000.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN
2    Bob  30.0       Paris  65000.0     Engineering  6500.0      67000.0
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0

In [176]:
# Specifying probabilities for each row:
weights = [0.1, 0.2, 0.3, 0.2, 0.1, 0.1]
df.sample(n=3, weights=weights)

    Name   Age        City   Salary      Department   Bonus  (5, Salary)
4  Shila  31.0     Toronto  70000.0              IT  7000.0      67000.0
3   Mike  25.0  Washington  45000.0  Transportation  4500.0      67000.0
5    NaN   NaN         NaN  68000.0             NaN     NaN          NaN

##### Setting a random seed for reproducibility:
`df.sample(n=3, random_state=42)`

In [177]:
df.sample(n=3, random_state=42)

    Name   Age      City   Salary Department   Bonus  (5, Salary)
0   John  25.0  New York  50000.0         HR  5000.0      67000.0
1  Alice  32.0    London  60000.0         IT  6000.0      67000.0
5    NaN   NaN       NaN  68000.0        NaN     NaN          NaN

By using the sample()` method, you can easily generate random samples from your Pandas Series and DataFrames. This is particularly useful when you want to create subsets of your data for various purposes, such as:

- Creating training and testing datasets for machine learning models.
- Performing exploratory data analysis on a smaller subset of data.
- Validating results or testing hypotheses on random samples.
- Generating bootstrap samples for statistical inference.
  
It's important to note that the `sample()` method selects rows randomly without considering the distribution of the data. If you require a <b>stratified</b> or <b>weighted sample</b> based on certain criteria, you may need to use additional techniques or libraries, such as <b>scikit-learn</b>'s `train_test_split()` function for stratified sampling.

### Boolean Indexing

#### Creating Boolean Masks
To perform boolean indexing, you first need to create a boolean mask. A boolean mask is typically created by applying a condition or a series of conditions to a Series or DataFrame.

In [178]:
series = pd.Series([1, 2, 3, 4, 5])
series > 3

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [179]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [6, 7, 8, 9, 10]})
df

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [180]:
mask = df['A'] > 3
mask

0    False
1    False
2    False
3     True
4     True
Name: A, dtype: bool

### Selecting Rows and Columns Based on Boolean Conditions

In [181]:
series[mask]

3    4
4    5
dtype: int64

In [182]:
df[mask]

   A   B
3  4   9
4  5  10

In [ ]:
# Apply on Each Column
df.mean() > 5

A    False
B     True
dtype: bool

In [184]:
df.loc[:, df.mean() > 5]

    B
0   6
1   7
2   8
3   9
4  10

In [187]:
df1 = pd.DataFrame({'A': [2, 12, 3, 4, 5], 'B': [6, 7, 8, 9, 10]})
df1

    A   B
0   2   6
1  12   7
2   3   8
3   4   9
4   5  10

In [188]:
df1.loc[:, df1.mean() > 5]

    A   B
0   2   6
1  12   7
2   3   8
3   4   9
4   5  10

In [189]:
df.loc[df['B'] > 8, df.mean() > 5]

    B
3   9
4  10

#### Combining Boolean Conditions Using Logical Operators
Boolean indexing allows you to combine multiple boolean conditions using logical operators such as `& (and), | (or), and ~ (not)`.

Here's an example of combining boolean conditions for a DataFrame:

In [190]:
mask = (df['A'] > 3) & (df['B'] < 9)
df[mask]

Empty DataFrame
Columns: [A, B]
Index: []

### Practical Examples and Use Cases
Boolean indexing is widely used in various data manipulation and analysis tasks. Here are a few practical examples and use cases:

1. Filtering data based on specific criteria:

   * Selecting rows where a column value falls within a certain range
   * Filtering out outliers or invalid data points
   * Extracting data that meets specific conditions

2. Conditional data modification:

  * Updating values in a DataFrame based on boolean conditions
  * Applying different operations to subsets of data based on criteria

3. Data cleaning and preprocessing:

  * Removing rows or columns with missing or invalid values
  * Handling outliers and extreme values based on statistical thresholds

4. Feature selection and engineering:

  * Selecting relevant features based on statistical measures or domain knowledge
  * Creating new features based on conditional transformations

### Indexing with isin

The `isin()` method is used to test whether each element in a Series or DataFrame is included in a provided set of values. It returns a boolean Series or DataFrame of the same shape, where True indicates that the element is present in the specified set, and False indicates that the element is not present.

The basic syntax of the isin() method is as follows:

`series.isin(values)`
`dataframe.isin(values)`

* series or dataframe: The Series or DataFrame to be tested.
* values: A set of values to check against. It can be a list, tuple, Series, DataFrame, or any other iterable.

In [191]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e']})
values = [2, 4]
df[df['A'].isin(values)]

   A  B
1  2  b
3  4  d

In [192]:
# Filtering Data Using isin()
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e']})
values_to_exclude = ['b', 'd']
df[~df['B'].isin(values_to_exclude)]

   A  B
0  1  a
2  3  c
4  5  e

### Combining isin() with Boolean Indexing

The isin() method can be combined with boolean indexing to create more complex filtering conditions. By combining isin() with logical operators such as & (and), | (or), and ~ (not), you can select rows based on multiple criteria.

In [193]:

df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': ['a', 'b', 'c', 'd', 'e'], 'C': [10, 20, 30, 40, 50]})
df[(df['A'].isin([2, 4])) & (df['C'] > 25)]

   A  B   C
3  4  d  40

### Practical Examples and Use Cases

The isin() method is widely used in various data manipulation and analysis tasks. Here are a few practical examples and use cases:

1. Filtering data based on a predefined set of values:

* Selecting rows based on a list of valid categories or labels
* Excluding rows that contain specific unwanted values

2. Merging and joining datasets:

* Identifying common values between two datasets using isin()
* Performing inner or outer joins based on a set of keys

3. Data cleaning and preprocessing:

* Removing rows with invalid or unexpected values
* Handling missing data by checking against a set of valid values

4.Categorical data analysis:

* Filtering rows based on specific categories or labels
* Comparing distributions or statistics across different categories

## Indexing with query
Pandas provides the `query()` method as a powerful and expressive way to select data from a DataFrame based on complex conditions. The query() method allows you to <b>filter rows</b> using a string expression that represents a boolean condition. It offers a concise and readable syntax for specifying complex filtering criteria.

The query() method is used to select rows from a DataFrame based on a boolean expression provided as a string. It allows you to specify complex conditions using a natural language-like syntax, making the code more readable and intuitive.

The basic syntax of the query() method is as follows:

dataframe.query(expr):

* dataframe: The DataFrame to be queried.
* expr: A string expression representing the boolean condition to be evaluated for each row. The expression can include column names, operators, and constants.
  
The query() method evaluates the provided expression for each row in the DataFrame and returns a new DataFrame containing only the rows that satisfy the condition.

In [194]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50], 'C': ['a', 'b', 'c', 'd', 'e']})
df.query('A > 2')

   A   B  C
2  3  30  c
3  4  40  d
4  5  50  e

In [195]:
df.query('A > 2 & B < 40')

   A   B  C
2  3  30  c

### Filtering Data Based on Complex Conditions
The query() method really shines when you need to filter data based on complex conditions. It allows you to express intricate filtering logic using a combination of operators, functions, and conditional statements.

Here are a few examples of using the query() method with complex conditions:

In [196]:
## Filtering based on multiple columns:
df.query('A < B & C == "d"')
# This query selects rows where the value in column 'A' is greater than the value in column 'B', and the value in column 'C' is equal to 'a'.

   A   B  C
3  4  40  d

In [197]:
# Using mathematical operations:
df.query('A ** 2 > 10')
# This query selects rows where the square of the value in column 'A' is greater than 10.

   A   B  C
3  4  40  d
4  5  50  e

In [198]:
# Applying functions and methods:
df.query('C.str.startswith("b")')
# This query selects rows where the value in column 'C' starts with the letter 'b'. It uses the str.startswith() method to check the condition.

   A   B  C
1  2  20  b

In [ ]:
#Referencing variables:
threshold = 3
df.query('A > @threshold')
#This query selects rows where the value in column 'A' is greater than the value of the variable threshold. The @ symbol is used to reference variables within the query expression.

## When to Use .query() vs .loc
There is often more than one way to do things in Pandas. You may be wondering if you should use `.query()` or `.loc`.

If you do a lot of chaining (which is recommended), `.query()` has the advantage of working on the intermediate DataFrame. One could argue that .loc does as well, but often when using boolean arrays with .loc, users insert a boolean array based on the original data, not the intermediate data. You need to use a function with .loc to get access to the original DataFrame.

On the flip side, .query() does not support column selection, but .loc does.

It's not a situation where you should only learn one of these constructs and neglect the other. Learn both .query() and .loc and figure out which one is appropriate given your requirements.

#### Practical Examples and Use Cases

The query() method is widely used in various data manipulation and analysis tasks. Here are a few practical examples and use cases:

1. Filtering data based on numeric ranges:

* Selecting rows where a column value falls within a specific range
* Filtering outliers or extreme values based on statistical thresholds
  
2. Conditional data selection:

* Selecting rows based on multiple conditions across different columns
* Filtering data based on a combination of numeric and categorical criteria

3. Data cleaning and preprocessing:

* Removing rows with invalid or missing values based on complex conditions
* Applying conditional transformations or corrections to specific subsets of data

4. Exploratory data analysis:

* Filtering data based on domain-specific criteria or business rules
* Selecting relevant subsets of data for further analysis or visualization

### Indexing with where
Pandas provides the `where()` method as a powerful tool for selecting and replacing values in a Series or DataFrame based on boolean conditions. The `where()` method allows you to specify a boolean mask or a condition to determine which values to keep or replace. It offers a concise and flexible way to perform conditional operations on your data.

The `where()` method is used to <b>select or replace values in a Series or DataFrame based on a boolean condition</b>. It takes a boolean mask or a callable as the condition and returns a new Series or DataFrame with the values that satisfy the condition unchanged, while the values that do not satisfy the condition are replaced with a specified value or NaN (Not a Number).

The basic syntax of the where() method is as follows:

`series.where(cond, other=nan, inplace=False, axis=None, level=None, errors='raise')`

`dataframe.where(cond, other=nan, inplace=False, axis=None, level=None, errors='raise')`

* cond: A boolean Series/DataFrame, array-like, or callable that specifies the condition to be evaluated. True values are kept, while False values are replaced.
* other: The value to replace the False values with. It can be a scalar, Series, DataFrame, or callable. If not specified, False values are replaced with NaN.
* inplace: If True, the operation is performed in-place, modifying the original Series or DataFrame. If False (default), a new Series or DataFrame is returned.
* axis: The axis along which the condition is applied (0 for index, 1 for columns). Only applicable for DataFrames.
* level: The MultiIndex level to apply the condition on. Only applicable for MultiIndex Series or DataFrames.
* errors: How to handle errors when the condition and the Series/DataFrame have different shapes. 'raise' (default) raises an error, 'ignore' suppresses the error.

In [201]:
s = pd.Series([1, 2, 3, 4, 5])
s.where(s > 2)

0    NaN
1    NaN
2    3.0
3    4.0
4    5.0
dtype: float64

In [204]:
#Replacing Values Based on Conditions

s = pd.Series([1, 2, 3, 4, 5])
s.where(s > 2, 0)

0    0
1    0
2    3
3    4
4    5
dtype: int64

In [203]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
df.where(df > 20)

    A     B
0 NaN   NaN
1 NaN   NaN
2 NaN  30.0
3 NaN  40.0
4 NaN  50.0

In [205]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
mask = df['A'] > 2
df.where(mask, df['B'], axis=0)

    A   B
0  10  10
1  20  20
2   3  30
3   4  40
4   5  50

### Combining where() with Other Indexing Methods

In [206]:
df = pd.DataFrame({'A': [1, 2, 3, 4, 5], 'B': [10, 20, 30, 40, 50]})
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [208]:
df.loc[df['A'] > 2, 'B']
df.loc[df['A'] > 2, 'B'].where(lambda x: x < 40)

2    30.0
3     NaN
4     NaN
Name: B, dtype: float64

### Practical Examples and Use Cases
The where() method is widely used in various data manipulation and analysis tasks. Here are a few practical examples and use cases:

1. Handling missing data:

Replacing missing values with a specific value or the mean/median of the column
Filling missing values based on conditions or patterns

2. Conditional data transformation:

Applying different transformations to subsets of data based on conditions
Scaling or normalizing values based on specific criteria

3. Data cleaning and preprocessing:

Removing or replacing invalid or outlier values based on statistical thresholds
Correcting data inconsistencies or errors based on predefined rules

4. Conditional calculations and aggregations:

Calculating metrics or statistics only for a subset of data that meets certain conditions
Applying different aggregation functions based on categories or groups

In [209]:
df = pd.DataFrame({'Price': [40, 60, 80, 100], 'Quantity': [50, 80, 120, 90]})
df.query('Price > 50 & Quantity < 100')

   Price  Quantity
1     60        80
3    100        90

In [210]:
df = pd.DataFrame({'Score': [85, 92, 78, 95], 'Grade': ['', '', '', '']})
df

   Score Grade
0     85
1     92
2     78
3     95

In [211]:
df['Grade'] = df['Grade'].where(df['Score'] < 90, 'A')
df

   Score Grade
0     85
1     92     A
2     78
3     95     A

In [212]:
df['Grade'] = df['Grade'].where((df['Score'] < 80) | (df['Score'] > 90), 'B')
df

   Score Grade
0     85     B
1     92     A
2     78
3     95     A

In [213]:
df['Grade'] = df['Grade'].where(df['Score'] > 80, 'C')
df

   Score Grade
0     85     B
1     92     A
2     78     C
3     95     A

### Applying Functions to Series
Series are one-dimensional labeled arrays in Pandas. We can apply various functions to transform or analyze these Series efficiently.

### Using Built-in Functions

In [215]:
import pandas as pd
# Create a sample Series
s = pd.Series([1, 2, 3, -4, 5])
# Using built-in functions
s.sum()

np.int64(7)

In [216]:
s.abs()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [218]:
np.log(s)

# np.exp(s)

# np.sin(s)

0    0.00
1    0.69
2    1.10
3     NaN
4    1.61
dtype: float64

### Applying Custom Functions with .apply()
The .apply() method allows you to apply custom functions to every element in a Series.

In [219]:
# Define a custom function
def square(x):
    return x ** 2

In [220]:
# Apply the custom function
s.apply(square)

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [221]:
# Using a lambda function
s.apply(lambda x: x ** 2)

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [222]:
# More complex custom function
def categorize(x):
    if x < 3:
        return 'Low'
    elif x < 5:
        return 'Medium'
    else:
        return 'High'

s.apply(categorize)

0       Low
1       Low
2    Medium
3       Low
4      High
dtype: object

### Using .map() for Series Transformation
The .map() method is useful for transforming a Series based on a mapping (dictionary) or a function.

In [224]:
# Using a function with map
s.map(lambda x: x * 10)

0    10
1    20
2    30
3   -40
4    50
dtype: int64

To avoid applying the function to missing values (and keep them as NaN) na_action='ignore' can be used:

In [225]:
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s.map('I am a {}'.format)

0       I am a cat
1       I am a dog
2       I am a nan
3    I am a rabbit
dtype: object

In [226]:
# Handling missing values in mapping
s.map('I am a {}'.format, na_action='ignore')

0       I am a cat
1       I am a dog
2              NaN
3    I am a rabbit
dtype: object

.map() is particularly useful when you want to replace values in a Series based on a predefined mapping.

In [227]:
# Example with categorical data
fruits = pd.Series(['apple', 'banana', 'cherry', 'date', 'elderberry'])
fruit_colors = {'apple': 'red', 'banana': 'yellow', 'cherry': 'red', 'date': 'brown'}

fruits.map(fruit_colors)

0       red
1    yellow
2       red
3     brown
4       NaN
dtype: object

Note: `.map()` is generally faster than `.apply()` for simple operations, especially when using a dictionary for mapping. However, `.apply() `is more flexible and can handle more complex functions.

### Applying Functions to DataFrames
DataFrames are two-dimensional labeled data structures in Pandas. We can apply functions to entire DataFrames, specific columns, rows, or individual elements.

#### Using DataFrame-wide Functions

In [228]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

# Apply DataFrame-wide functions
df.sum()

A      15
B     150
C    1500
dtype: int64

In [229]:
df.mean()

A      3.0
B     30.0
C    300.0
dtype: float64

In [230]:
df.describe()

          A      B       C
count  5.00   5.00    5.00
mean   3.00  30.00  300.00
std    1.58  15.81  158.11
min    1.00  10.00  100.00
25%    2.00  20.00  200.00
50%    3.00  30.00  300.00
75%    4.00  40.00  400.00
max    5.00  50.00  500.00

### Applying Functions to Columns with .apply()
You can use .apply() to apply a function to each column of a DataFrame.

In [231]:
# Apply a function to each column
df.apply(np.sum)

A      15
B     150
C    1500
dtype: int64

In [232]:
# Custom function for columns
def column_stats(col):
    return pd.Series({
        'min': col.min(),
        'max': col.max(),
        'mean': col.mean(),
        'median': col.median()
    })

df.apply(column_stats)

          A     B      C
min     1.0  10.0  100.0
max     5.0  50.0  500.0
mean    3.0  30.0  300.0
median  3.0  30.0  300.0

### Applying Functions to Rows with .apply(axis=1)
To apply a function to each row of a DataFrame, use .apply() with axis=1.

In [233]:
def row_sum(row):
    return row.sum()

df.apply(row_sum, axis=1)

0    111
1    222
2    333
3    444
4    555
dtype: int64

In [234]:
# More complex row operation
def categorize_row(row):
    total = row.sum()
    if total < 200:
        return 'Low'
    elif total < 400:
        return 'Medium'
    else:
        return 'High'

df.apply(categorize_row, axis=1)

0       Low
1    Medium
2    Medium
3      High
4      High
dtype: object

### Using .map() for Element-wise Operations
.map() applies a function to every element in the DataFrame.

In [235]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})
# Apply a function to every element
df.map(lambda x: f"{x:.2f}")

      A      B       C
0  1.00  10.00  100.00
1  2.00  20.00  200.00
2  3.00  30.00  300.00
3  4.00  40.00  400.00
4  5.00  50.00  500.00

In [236]:
# Another example: categorizing values
def categorize(x):
    if x <= 50:
        return 'Low'
    elif x <= 250:
        return 'Medium'
    else:
        return 'High'

df.map(categorize)

     A    B       C
0  Low  Low  Medium
1  Low  Low  Medium
2  Low  Low    High
3  Low  Low    High
4  Low  Low    High

In [237]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

<b>Note:</b> While `.map()` is convenient for element-wise operations, it can be slower than vectorized operations for large DataFrames. When possible, use vectorized operations or apply functions to specific columns for better performance.

In [238]:
# Vectorized operation (faster)
bins = [-np.inf, 50, 250, np.inf]
labels = ['Low', 'Medium', 'High']
df_categorized = pd.DataFrame({
    'A': pd.cut(df['A'], bins=bins, labels=labels),
    'B': pd.cut(df['B'], bins=bins, labels=labels),
    'C': pd.cut(df['C'], bins=bins, labels=labels)
})

df_categorized

     A    B       C
0  Low  Low  Medium
1  Low  Low  Medium
2  Low  Low    High
3  Low  Low    High
4  Low  Low    High

## Advanced Function Application
As you become more proficient with Pandas, you'll encounter situations that require more advanced function application techniques. This section covers vectorized operations, lambda functions, and applying multiple functions simultaneously.

#### Vectorized Operations for Performance
Vectorized operations in Pandas are highly optimized and perform operations on entire arrays at once, rather than element by element. This leads to significant performance improvements, especially for large datasets.

In [239]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': np.random.rand(100000),
    'B': np.random.rand(100000)
})
df

          A     B
0      0.90  0.25
1      0.70  0.59
2      0.75  0.61
3      0.46  0.52
4      0.94  0.30
...     ...   ...
99995  0.31  0.66
99996  0.80  0.89
99997  0.14  0.03
99998  0.91  0.35
99999  0.38  0.51

[100000 rows x 2 columns]

In [240]:
# Vectorized operation (fast)
%timeit df['C'] = df['A'] + df['B']

276 s  44.5 s per loop (mean  std. dev. of 7 runs, 1,000 loops each)

In [241]:
df

          A     B     C
0      0.90  0.25  1.15
1      0.70  0.59  1.29
2      0.75  0.61  1.36
3      0.46  0.52  0.98
4      0.94  0.30  1.24
...     ...   ...   ...
99995  0.31  0.66  0.97
99996  0.80  0.89  1.69
99997  0.14  0.03  0.16
99998  0.91  0.35  1.26
99999  0.38  0.51  0.88

[100000 rows x 3 columns]

In [242]:
# Non-vectorized operation using apply (slow)
%timeit df['D'] = df.apply(lambda row: row['A'] + row['B'], axis=1)

452 ms  16.8 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [243]:
# Compare results
df.head()

      A     B     C     D
0  0.90  0.25  1.15  1.15
1  0.70  0.59  1.29  1.29
2  0.75  0.61  1.36  1.36
3  0.46  0.52  0.98  0.98
4  0.94  0.30  1.24  1.24

In [245]:
# Whenever possible, use vectorized operations for better performance:

# More vectorized operations
df['E'] = np.sqrt(df['A'])
df['F'] = np.where(df['B'] > 0.5, 'High', 'Low')

df.head()

      A     B     C     D     E     F
0  0.90  0.25  1.15  1.15  0.95   Low
1  0.70  0.59  1.29  1.29  0.83  High
2  0.75  0.61  1.36  1.36  0.87  High
3  0.46  0.52  0.98  0.98  0.68  High
4  0.94  0.30  1.24  1.24  0.97   Low

### Using lambda Functions
Lambda functions are anonymous, inline functions that are useful for simple operations. They're often used with .apply(), .map(), and other Pandas methods.

In [246]:
# Using lambda with Series
s = pd.Series([1, 2, 3, 4, 5])
s.apply(lambda x: x**2 if x % 2 == 0 else x**3)

0      1
1      4
2     27
3     16
4    125
dtype: int64

In [247]:
# Using lambda with DataFrame columns
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50]
})
df

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [248]:
df['C'] = df['A'].apply(lambda x: 'Even' if x % 2 == 0 else 'Odd')
df['D'] = df.apply(lambda row: row['A'] * row['B'], axis=1)
df

   A   B     C    D
0  1  10   Odd   10
1  2  20  Even   40
2  3  30   Odd   90
3  4  40  Even  160
4  5  50   Odd  250

### Applying Function to Multiple Columns
When working with DataFrames, you often need to apply the same function to multiple columns simultaneously. Pandas provides several ways to accomplish this efficiently.

You can use the .apply() method on a subset of columns:

In [249]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500],
    'D': ['a', 'b', 'c', 'd', 'e']
})
df

   A   B    C  D
0  1  10  100  a
1  2  20  200  b
2  3  30  300  c
3  4  40  400  d
4  5  50  500  e

In [250]:
df[['A', 'B', 'C']]

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [251]:
# Apply a function to multiple numeric columns
df[['A', 'B', 'C']].apply(lambda x: x * 2)

    A    B     C
0   2   20   200
1   4   40   400
2   6   60   600
3   8   80   800
4  10  100  1000

In [252]:
# Apply a function to multiple numeric columns
df[['A', 'B', 'C']].map(lambda x: x * 2)

    A    B     C
0   2   20   200
1   4   40   400
2   6   60   600
3   8   80   800
4  10  100  1000

In [ ]:
# Apply a function to all elements in specific columns
df[['A', 'B', 'C']].map(lambda x: f"{x:.2f}")

### Applying Multiple Functions with .agg()
The .agg() method allows you to apply multiple functions to one or more columns simultaneously.

In [253]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [254]:
# Apply multiple functions to all columns
df.agg(['sum', 'mean', 'max', 'min'])

         A      B       C
sum   15.0  150.0  1500.0
mean   3.0   30.0   300.0
max    5.0   50.0   500.0
min    1.0   10.0   100.0

In [255]:
# Apply multiple functions to all columns
df.agg(['sum', 'mean', 'max', 'min'], axis='rows')

         A      B       C
sum   15.0  150.0  1500.0
mean   3.0   30.0   300.0
max    5.0   50.0   500.0
min    1.0   10.0   100.0

In [ ]:
# Apply multiple functions to all rows
df.agg(['sum', 'mean', 'max', 'min'], axis=1)

     sum   mean    max  min
0  111.0   37.0  100.0  1.0
1  222.0   74.0  200.0  2.0
2  333.0  111.0  300.0  3.0
3  444.0  148.0  400.0  4.0
4  555.0  185.0  500.0  5.0

In [257]:
# Apply multiple functions to all columns
df.agg(['sum', 'mean', 'max', 'min'], axis='columns')

     sum   mean    max  min
0  111.0   37.0  100.0  1.0
1  222.0   74.0  200.0  2.0
2  333.0  111.0  300.0  3.0
3  444.0  148.0  400.0  4.0
4  555.0  185.0  500.0  5.0

In [258]:
# Apply different functions to different columns
df.agg({
    'A': ['sum', 'mean'],
    'B': ['min', 'max'],
    'C': 'std'
})

         A     B       C
sum   15.0   NaN     NaN
mean   3.0   NaN     NaN
min    NaN  10.0     NaN
max    NaN  50.0     NaN
std    NaN   NaN  158.11

In [259]:
# Using custom functions with .agg()
def range_calc(x):
    return x.max() - x.min()

df.agg(['mean', range_calc])

              A     B      C
mean        3.0  30.0  300.0
range_calc  4.0  40.0  400.0

## Understanding Missing Data
Missing data is a common challenge in data analysis across various fields. Before diving into specific techniques for handling missing values, it's crucial to understand the nature of missing data and its implications for your analysis.

### Types of Missing Data
Missing data typically falls into three categories:

1. Missing Completely at Random (MCAR):

* The missingness is unrelated to any variables in the dataset.
* Example: A survey respondent accidentally skips a question.
* Implications: Least problematic; analysis remains unbiased.

2. Missing at Random (MAR):

* The missingness is related to other observed variables but not to the missing data itself.
* Example: Men are less likely to answer questions about emotions in a survey.
* Implications: Can be handled with appropriate imputation techniques.

3. Not at Random (MNAR):

* The missingness is related to the missing values themselves.
* Example: People with high incomes are less likely to report their income in surveys.
* Implications: Most problematic; may lead to biased results if not handled care

###  of Missing Data
Understanding the impact of missing data is crucial:

1. Reduced Statistical Power: Missing data can decrease the sample size, leading to less precise estimates.
2. Bias: Especially in MNAR cases, missing data can lead to biased results and incorrect conclusions.
3. Complication of Analysis: Many statistical methods are designed for complete datasets, and missing data can complicate their application.

### Assessing Missing Data
Before deciding how to handle missing data, it's important to assess its extent and pattern:

1. Quantity: Calculate the percentage of missing values for each variable.
2. Pattern: Visualize the pattern of missingness to identify any systematic issues.
3. Relationships: Examine if missingness in one variable is related to values in other variables.

### General Approaches to Handling Missing Data

1. Deletion Methods:

- Listwise deletion (complete case analysis)
- Pairwise deletion

2. Single Imputation Methods:

- Mean/median/mode imputation
- Regression imputation
- Last observation carried forward (for time series)

3. Multiple Imputation:

- Creating multiple plausible imputed
- Analyzing each dataset and pooling results

4. Model-Based Methods:

- Maximum Likelihood estimation
- Expectation-Maximization algorithm

5. Machine Learning Methods:

- K-Nearest Neighbors imputation
- Decision tree-based methods

### Considerations in Choosing a Method

When deciding how to handle missing data, consider:

* The mechanism of missingness (MCAR, MAR, MNAR)
* The amount of missing data
* The type of variables (categorical, continuous)
* The intended analysis and its assumptions
* The computational resources available

### Practices

1. Always investigate the nature and pattern of missing data before deciding on a method.
2. Document your approach thoroughly for transparency and reproducibility.
3. Consider multiple methods and compare their impact on your results.
4. Consult domain experts to understand potential reasons for missingness.
5. Conduct sensitivity analyses to assess the impact of your chosen method.
6. Be transparent about the presence and handling of missing data when reporting results.

### Values Considered "Missing"
Pandas recognizes several types of values as "missing." Understanding these different types is crucial for effective data handling and analysis.

#### NaN (Not a Number)
NaN (Not a Number) is the primary way Pandas represents missing or undefined values for floating-point and non-floating-point numeric data.

* NaN is part of the IEEE floating-point specification.
* It's represented by the numpy.nan object.
* NaN values are propagated in arithmetic operations.

In [1]:
import numpy as np
import pandas as pd
# Creating a Series with NaN values
s = pd.Series([1, 2, np.nan, 4, 5])
s

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [2]:
# Checking for NaN values
s.isna()

0    False
1    False
2     True
3    False
4    False
dtype: bool

#### None
None is Python's built-in null object. Pandas also recognizes None as a missing value.

* When used in numeric data, None is typically converted to NaN.
* In object-dtype arrays, None is preserved as-is.

In [3]:
# Creating a Series with None values
s_none = pd.Series([1, 2, None, 4, 5])
s_none

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [4]:
# None is converted to NaN in numeric Series
s_none.astype(float)

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [6]:
# Creating a DataFrame with custom missing value indicators
df = pd.DataFrame({
    'A': [1, 2, -999, 4, 5, 12],
    'B': ['a', 'N/A', 'c', 'd', 'Unknown', '']
})
df

     A        B
0    1        a
1    2      N/A
2 -999        c
3    4        d
4    5  Unknown
5   12

In [8]:
# Specifying custom missing values
df_cleaned = df.replace([-999, 'N/A', 'Unknown', ''], np.nan)
df_cleaned

      A    B
0   1.0    a
1   2.0  NaN
2   NaN    c
3   4.0    d
4   5.0  NaN
5  12.0  NaN

In [ ]:
# Using custom na_values during CSV import
# df = pd.read_csv('your_file.csv', na_values=[-999, 'N/A', 'Unknown'])

In datetime data, missing values are typically represented by <b>NaT</b> (Not a Time) in Pandas. This is similar to NaN but specific to datetime data.

In [9]:
pd.DatetimeIndex(["2017-07-05", "2017-07-06", None, "2017-07-08"])

DatetimeIndex(['2017-07-05', '2017-07-06', 'NaT', '2017-07-08'], dtype='datetime64[ns]', freq=None)

It's important to note that while Pandas recognizes these different types of missing values, it generally treats them similarly in most operations. However, there can be subtle differences in behavior, especially when working with different data types.

In [10]:
# Demonstrating equivalence in boolean operations
pd.isna(np.nan) == pd.isna(None)

True

In [11]:
# But they're not identical
np.nan is None

False

In [ ]:
# NaN doesn't equal itself
np.nan == np.nan

### Detecting Missing Values
Identifying missing values in your dataset is a crucial first step in data preprocessing. Pandas provides several methods to detect and quantify missing values in Series and DataFrames.

### Using .isnull() and .notnull()
Pandas offers two primary methods for detecting missing values: .isnull() and .notnull(). These methods return boolean masks indicating which values are missing (or not missing).

In [12]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4, 5],
    'B': [5, np.nan, np.nan, 3, 2],
    'C': [1, 2, 3, np.nan, 5],
    'D': ['a', 'b', 'c', None, 'e']
})
df

     A    B    C     D
0  1.0  5.0  1.0     a
1  2.0  NaN  2.0     b
2  NaN  NaN  3.0     c
3  4.0  3.0  NaN  None
4  5.0  2.0  5.0     e

In [13]:
# Using .isnull()
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False   True  False  False
2   True   True  False  False
3  False  False   True   True
4  False  False  False  False

In [14]:
# Using .notnull()
df.notnull()

       A      B      C      D
0   True   True   True   True
1   True  False   True   True
2  False  False   True   True
3   True   True  False  False
4   True   True   True   True

In [15]:
# For a single column (Series)
df['B'].isnull()

0    False
1     True
2     True
3    False
4    False
Name: B, dtype: bool

In [16]:
# For a single column (Series)
df['B'].isnull()

0    False
1     True
2     True
3    False
4    False
Name: B, dtype: bool

#### Counting Missing Values
To quantify missing values, you can use the .isnull() method in combination with .sum().

In [17]:
# Count missing values in each column
df.isnull().sum()

A    1
B    2
C    1
D    1
dtype: int64

In [18]:
# Count missing values in each row
df.isnull().sum(axis=1)

0    0
1    1
2    2
3    2
4    0
dtype: int64

In [19]:
# Total number of missing values in the DataFrame
df.isnull().sum().sum()

np.int64(5)

In [20]:
# Percentage of missing values in each column
(df.isnull().sum() / len(df)) * 100

A    20.0
B    40.0
C    20.0
D    20.0
dtype: float64

In [23]:
df.isnull().any(axis=1)

0    False
1     True
2     True
3     True
4    False
dtype: bool

In [21]:
# Rows with at least one missing value
df[df.isnull().any(axis=1)]

     A    B    C     D
1  2.0  NaN  2.0     b
2  NaN  NaN  3.0     c
3  4.0  3.0  NaN  None

In [24]:
# Columns with at least one missing value
df.loc[:, df.isnull().any()]

     A    B    C     D
0  1.0  5.0  1.0     a
1  2.0  NaN  2.0     b
2  NaN  NaN  3.0     c
3  4.0  3.0  NaN  None
4  5.0  2.0  5.0     e

For a more comprehensive summary of missing values, you can use the .info() method:

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       3 non-null      float64
 2   C       4 non-null      float64
 3   D       4 non-null      object
dtypes: float64(3), object(1)
memory usage: 292.0+ bytes

In [26]:
df. describe()

              A         B         C
count  4.000000  3.000000  4.000000
mean   3.000000  3.333333  2.750000
std    1.825742  1.527525  1.707825
min    1.000000  2.000000  1.000000
25%    1.750000  2.500000  1.750000
50%    3.000000  3.000000  2.500000
75%    4.250000  4.000000  3.500000
max    5.000000  5.000000  5.000000

### NA Semantics and Behavior
Understanding how Pandas handles missing values (NA - Not Available) in various operations is crucial for correct data manipulation and analysis. Let's explore the behavior of NA values in different contexts.

#### Propagation in Arithmetic and Comparison Operations
In arithmetic operations, NA values generally propagate. This means that any operation involving an NA value will result in NA.

In [27]:
s = pd.Series([1, 2, np.nan, 4, 5])

In [28]:
# Arithmetic operations
s + 1

0    2.0
1    3.0
2    NaN
3    5.0
4    6.0
dtype: float64

In [29]:
s * 2

0     2.0
1     4.0
2     NaN
3     8.0
4    10.0
dtype: float64

In [30]:
# Comparison operations
s > 2

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [31]:
s == np.nan  # Note: this doesn't work as expected

0    False
1    False
2    False
3    False
4    False
dtype: bool

Note that comparing anything to np.nan using == always returns False. To check for NA values, use pd.isna() or the .isnull() method.

In [32]:
pd.isna(s)

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [33]:
# Create two series with some NA values
a = pd.Series([True, False, np.nan])
b = pd.Series([False, True, np.nan])

In [34]:
# Logical AND
a & b

0    False
1    False
2    False
dtype: bool

In [35]:
# Logical OR
a | b

0     True
1     True
2    False
dtype: bool

In [ ]:
# Logical NOT
# ~a # raises an error

The rules for three-valued logic are:

 - True or Unknown = True
 - False or Unknown = Unknown
 - True and Unknown = Unknown
 - False and Unknown = False


### NA in a Boolean Context
When using NA values in a boolean context (like in filtering operations), they are treated as False.

In [36]:
df = pd.DataFrame({'A': [1, 2, np.nan], 'B': [4, np.nan, 6]})
df

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  6.0

In [38]:
# Filtering with a condition

df > 2
df[df > 2]

    A    B
0 NaN  4.0
1 NaN  NaN
2 NaN  6.0

In [40]:
# Using .bool() method
s = pd.Series([True, False, np.nan])
# s.bool()  # This will raise a ValueError

Note that calling .bool() on a Series or DataFrame containing NA values will raise a ValueError. If you need to convert to boolean in such cases, you might need to fill NA values first.

### Inserting Missing Data
There may be situations where you need to insert missing values into your dataset, either to represent unknown information or to prepare data for specific analyses. Let's explore how to insert missing data and understand the consequences of doing so.

### Explicitly Inserting NaN or None
Pandas allows you to insert missing values using either np.nan or None. Here are several ways to insert missing data:

In [41]:
# Create a sample DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df

   A  B
0  1  4
1  2  5
2  3  6

In [42]:
# Insert NaN into a specific location
df.loc[1, 'A'] = np.nan
df

     A  B
0  1.0  4
1  NaN  5
2  3.0  6

In [43]:
# Insert None into a specific location
df.loc[2, 'B'] = None
df

     A    B
0  1.0  4.0
1  NaN  5.0
2  3.0  NaN

In [44]:
# Add a new column with some missing values
df['C'] = [7, np.nan, 9]
df

     A    B    C
0  1.0  4.0  7.0
1  NaN  5.0  NaN
2  3.0  NaN  9.0

In [45]:
# Create a column with all missing values
df['D'] = np.nan
df

     A    B    C   D
0  1.0  4.0  7.0 NaN
1  NaN  5.0  NaN NaN
2  3.0  NaN  9.0 NaN

In [46]:
# Create a DataFrame with missing values
df2 = pd.DataFrame({
    'A': [1, np.nan, 3],
    'B': [4, 5, None],
    'C': [np.nan, np.nan, np.nan]
})

df2

     A    B   C
0  1.0  4.0 NaN
1  NaN  5.0 NaN
2  3.0  NaN NaN

###  Consequences of Inserting Missing Data
Inserting missing data can have several consequences that you should be aware of:

1. Data Type Changes: Inserting np.nan into an integer column will cause the column to be converted to float.

In [47]:
# Create an integer Series
s = pd.Series([1, 2, 3], dtype=int)
s.dtype

dtype('int64')

In [48]:
# Insert np.nan
s[1] = np.nan
s.dtype  # Now float64

dtype('float64')

2. Impact on Calculations: Missing values can affect calculations. Many Pandas methods exclude missing values by default.

In [52]:
df2

     A    B   C
0  1.0  4.0 NaN
1  NaN  5.0 NaN
2  3.0  NaN NaN

In [49]:
# Mean calculation
df2['A'].mean()  # Excludes NaN by default

np.float64(2.0)

3. Filtering Behavior: Missing values are treated as False in boolean indexing.

In [50]:
df2[df2['A'] > 2]  # NaN rows are excluded

     A   B   C
2  3.0 NaN NaN

3. Performance: Operations on data with missing values can be slower, as Pandas needs to check for and handle these values.
4. Groupby Operations: By default, group keys with missing values are excluded.

In [53]:
df2.groupby('A').sum()  # Group with NaN is excluded

       B    C
A
1.0  4.0  0.0
3.0  0.0  0.0

6. Concatenation and Merging: When combining datasets, missing values can be introduced or propagated.

In [54]:
pd.concat([df, df2])

     A    B    C   D
0  1.0  4.0  7.0 NaN
1  NaN  5.0  NaN NaN
2  3.0  NaN  9.0 NaN
0  1.0  4.0  NaN NaN
1  NaN  5.0  NaN NaN
2  3.0  NaN  NaN NaN

7. Plotting: Missing values are typically excluded from plots, which can lead to discontinuities in line plots or gaps in bar charts.

### Handling Missing Values
Once you've identified missing values in your dataset, you need to decide how to handle them. Pandas provides several methods for dealing with missing data, including dropping rows or columns with missing values, filling missing values with specific values, or using more advanced interpolation techniques.

#### Dropping Missing Values
For a Series, dropna() removes all entries containing missing values.

In [55]:
# Create a sample Series
s = pd.Series([1, 2, np.nan, 4, 5, np.nan])
s

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
5    NaN
dtype: float64

In [56]:
# Drop NA values
s.dropna()

0    1.0
1    2.0
3    4.0
4    5.0
dtype: float64

In [57]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [5, np.nan, np.nan, 3],
    'C': [1, 2, 3, np.nan]
})
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0
3  4.0  3.0  NaN

In [58]:
# Drop rows with any NA values
df.dropna()

     A    B    C
0  1.0  5.0  1.0

In [59]:
# Drop rows where all values are NA
df.dropna(how='all')

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0
3  4.0  3.0  NaN

In [60]:
# Drop columns with any NA values
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [61]:
# Drop columns with any NA values
df.dropna(how= 'all', axis=1)

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0
3  4.0  3.0  NaN

In [62]:
# Drop rows with at least 2 non-NA values
df.dropna(thresh=2)

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
3  4.0  3.0  NaN

#### Filling Missing Values
You can fill NA values with a constant:

In [63]:
# Fill NA with 0
df.fillna(0)

     A    B    C
0  1.0  5.0  1.0
1  2.0  0.0  2.0
2  0.0  0.0  3.0
3  4.0  3.0  0.0

In [ ]:
# Fill NA with different values for each column using dictionary
df.fillna({'A': 0, 'B': 5, 'C': 10})

     A    B     C
0  1.0  5.0   1.0
1  2.0  5.0   2.0
2  0.0  5.0   3.0
3  4.0  3.0  10.0

You can propagate the last valid observation forward or backward:

In [65]:
# Forward fill
df.ffill()

     A    B    C
0  1.0  5.0  1.0
1  2.0  5.0  2.0
2  2.0  5.0  3.0
3  4.0  3.0  3.0

In [66]:
# Backward fill
df.bfill()

     A    B    C
0  1.0  5.0  1.0
1  2.0  3.0  2.0
2  4.0  3.0  3.0
3  4.0  3.0  NaN

You can use calculated values, such as mean or median:

In [67]:
# Fill with mean of each column
df.fillna(df.mean())

          A    B    C
0  1.000000  5.0  1.0
1  2.000000  4.0  2.0
2  2.333333  4.0  3.0
3  4.000000  3.0  2.0

In [68]:
# Fill with median of each column
df.fillna(df.median())

     A    B    C
0  1.0  5.0  1.0
1  2.0  4.0  2.0
2  2.0  4.0  3.0
3  4.0  3.0  2.0

#### Interpolation Methods
Pandas offers various interpolation methods for filling missing values:

In [69]:
# Create a Series with missing values
s = pd.Series([1, np.nan, 2, np.nan, 3, 4])
s

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
5    4.0
dtype: float64

In [70]:
# Linear interpolation
s.interpolate()

0    1.0
1    1.5
2    2.0
3    2.5
4    3.0
5    4.0
dtype: float64

In [75]:

# Polynomial interpolation
s.interpolate(method = "polynomial", order = 2)

ImportError: Missing optional dependency 'scipy'. polynomial interpolation requires SciPy. Use pip or conda to install scipy.

In [72]:
# Time-based interpolation (for time series data)
time_series = pd.Series(
    [1, np.nan, 2, np.nan, 3],
    index=pd.to_datetime(['2020-01-01', '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08'])
)
time_series.interpolate(method='time')

2020-01-01    1.0
2020-01-05    1.8
2020-01-06    2.0
2020-01-07    2.5
2020-01-08    3.0
dtype: float64

When choosing a method to handle missing values, consider:

1. The nature of your data: Is it time series? Categorical? Numerical?
2. The amount of missing data: If too much data is missing, imputation might introduce bias.
3. The mechanism of missingness: Is the data missing completely at random, or is there a pattern?
4. The requirements of your subsequent analysis: Some models can handle missing data, while others cannot.

Remember, there's no one-size-fits-all approach to handling missing data. The best method depends on your specific dataset and analysis goals. It's often a good practice to try multiple approaches and compare their impact on your results.

In [79]:
df

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0
3  4.0  3.0  NaN

In [77]:
for method in methods:
    df_copy = df.copy()
    if method == 'drop':
        df_copy = df_copy.dropna()
    elif method == 'fill_mean':
        df_copy = df_copy.fillna(df_copy.mean())
    elif method == 'ffill':
        df_copy = df_copy.ffill()
    elif method == 'interpolate':
        df_copy = df_copy.interpolate()

    results[method] = df_copy.mean()

In [78]:
pd.DataFrame(results)

   drop  fill_mean  ffill  interpolate
A   1.0   2.333333   2.25         2.50
B   5.0   4.000000   4.50         4.00
C   1.0   2.000000   2.25         2.25

### Advanced Techniques for Handling Missing Values
As you become more proficient in data analysis, you may encounter situations where basic methods for handling missing values are insufficient. This section covers more advanced techniques that can provide more nuanced and effective ways to deal with missing data.

#### Using replace() for Custom Missing Value Handling
The replace() method allows for more flexible handling of missing or unwanted values, including the ability to replace specific values or patterns.

In [80]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, -999, 4, 5],
    'B': ['a', 'N/A', 'c', 'Missing', 'e']
})
df

     A        B
0    1        a
1    2      N/A
2 -999        c
3    4  Missing
4    5        e

In [81]:
# Replace multiple values
df.replace([-999, 'N/A', 'Missing'], np.nan)

     A    B
0  1.0    a
1  2.0  NaN
2  NaN    c
3  4.0  NaN
4  5.0    e

In [82]:
# Using a dictionary for column-specific replacements
df.replace({
    'A': {-999: np.nan},
    'B': {'N/A': np.nan, 'Missing': 'Unknown'}
})

     A        B
0  1.0        a
1  2.0      NaN
2  NaN        c
3  4.0  Unknown
4  5.0        e

In [83]:
# You can also use regular expressions with replace():
# Replace any string starting with 'Miss'
df['B'].replace('^Miss.*', np.nan, regex=True)

0      a
1    N/A
2      c
3    NaN
4      e
Name: B, dtype: object

### Imputation Strategies
Imputation involves replacing missing values with estimated ones. While simple imputation methods like mean or median filling are common, more sophisticated techniques can provide better estimates.

KNN imputation fills missing values using the mean of K nearest neighbors.

In [84]:
df = pd.DataFrame({
    'age': [2, 8, None, 25, 30, None],
    'height': [None, 1.2, None, 1.7, 1.8, 1.6],
    'weight': [10, 15, 18, 20, None, 30]
})
df

    age  height  weight
0   2.0     NaN    10.0
1   8.0     1.2    15.0
2   NaN     NaN    18.0
3  25.0     1.7    20.0
4  30.0     1.8     NaN
5   NaN     1.6    30.0

In [85]:
from sklearn.impute import KNNImputer

# Create an imputer
imputer = KNNImputer(n_neighbors=2)

# Impute missing values
df_imputed = pd.DataFrame(imputer.fit_transform(df), columns=df.columns)

df_imputed

ModuleNotFoundError: No module named 'sklearn'

In [86]:
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

# Create an imputer
imputer = IterativeImputer(random_state=0)

# Impute missing values
df_multi_imputed = pd.DataFrame(imputer.fit_transform(df), columns=df.columns)

df_multi_imputed

ModuleNotFoundError: No module named 'sklearn'

## Handling Duplicate Data in Pandas

Duplicates in a dataset are records or rows that are identical or nearly identical to other records in the same dataset. They can be:

* Exact duplicates: Rows where all values across all columns are identical.
* Partial duplicates: Rows where some, but not all, columns have identical values.

For example, consider this DataFrame:

In [87]:
import pandas as pd

df = pd.DataFrame({
    'Name': ['John', 'Jane', 'John', 'Mike', 'Jane'],
    'Age': [28, 32, 28, 45, 32],
    'City': ['New York', 'Boston', 'New York', 'Chicago', 'Boston']
})

df

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28  New York
3  Mike   45   Chicago
4  Jane   32    Boston

Duplicates can occur for various reasons:

1. Data entry errors: Manual data entry can lead to accidental duplication.
2. System glitches: Automated systems might sometimes record the same information multiple times.
3. Data merging: When combining data from multiple sources, duplicates can be introduced.
4. Repeated measurements: In scientific or experimental data, the same measurement might be taken multiple times.
5. Intentional redundancy: Some systems deliberately create duplicates for backup or verification purposes.
6. Data processing errors: Mistakes in ETL (Extract, Transform, Load) processes can create duplicates.

Properly handling duplicates is crucial for several reasons:

1. Data integrity: Duplicates can skew your analysis, leading to incorrect conclusions or inflated statistics.
   
2. Storage efficiency: Removing unnecessary duplicates can reduce data storage requirements.
   
3. Processing speed: Fewer duplicates often mean faster data processing and analysis.
   
4. Accurate reporting: Duplicates can lead to overestimation in reports and visualizations.
   
5. Machine learning model performance: Duplicates can bias machine learning models and affect their performance.
   
6. Decision making: In business contexts, duplicates can lead to poor decision-making based on inaccurate data.

7. Data quality: Handling duplicates is a key aspect of ensuring overall data quality.

In [88]:
# Mean age with duplicates
df['Age'].mean()

np.float64(33.0)

In [89]:
# Mean age after removing duplicates
df.drop_duplicates()['Age'].mean()

np.float64(35.0)

### Using .duplicated() method
The .duplicated() method is the primary tool for detecting duplicates in Pandas. It returns a boolean Series where True indicates that the row is a duplicate.

In [90]:
# Create a sample DataFrame
df = pd.DataFrame({
    'A': [1, 2, 2, 3, 4, 5, 5],
    'B': ['a', 'b', 'b', 'c', 'd', 'e', 'e']
})
df

   A  B
0  1  a
1  2  b
2  2  b
3  3  c
4  4  d
5  5  e
6  5  e

In [91]:
# Detect duplicates
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool

By default, .duplicated() considers a row as a duplicate if it's identical to a previous row. The first occurrence is not marked as a duplicate.

### Identifying duplicate rows
To identify which rows are duplicates, we can combine .duplicated() with boolean indexing:

In [92]:
# Show duplicate rows
df[df.duplicated()]

   A  B
2  2  b
6  5  e

The keep parameter in .duplicated() has three options:

* 'first' (default): Mark duplicates as True except for the first occurrence.
* 'last': Mark duplicates as True except for the last occurrence.
* False: Mark all duplicates as True.

In [93]:
# Show duplicate rows, including first occurrences
df[df.duplicated(keep=False)]

   A  B
1  2  b
2  2  b
5  5  e
6  5  e

### Identifying duplicate values in specific columns
You can also check for duplicates based on specific columns:

In [94]:
# Create a DataFrame with partial duplicates
df2 = pd.DataFrame({
    'Name': ['John', 'Jane', 'John', 'Mike', 'Jane'],
    'Age': [28, 32, 28, 45, 33],
    'City': ['New York', 'Boston', 'Chicago', 'Chicago', 'Boston']
})

In [95]:
# Check duplicates based on 'Name' column
df2.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [96]:
# Check duplicates based on 'Name' and 'City' columns
df2.duplicated(subset=['Name', 'City'])

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [97]:
# Show rows with duplicate names
df2[df2.duplicated(subset=['Name'], keep=False)]

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28   Chicago
4  Jane   33    Boston

In [98]:
#To get a summary of duplicate counts for a specific column:

# Count occurrences of each name
df2['Name'].value_counts()

Name
John    2
Jane    2
Mike    1
Name: count, dtype: int64

In [99]:
# Show names that appear more than once
df2['Name'].value_counts()[df2['Name'].value_counts() > 1]

Name
John    2
Jane    2
Name: count, dtype: int64

### Removing Duplicate Data
Once you've identified duplicates in your dataset, the next step is often to remove them. Pandas provides efficient methods for removing duplicates, with options to customize the process based on your specific needs.

#### Using .drop_duplicates() method
The primary method for removing duplicates in Pandas is .drop_duplicates(). This method returns a new DataFrame with duplicates removed.

By default, .drop_duplicates() considers all columns when identifying duplicates. This means that rows are considered duplicates only if all their values are identical.

In [100]:
# DataFrame with duplicates across all columns
df_all = pd.DataFrame({
    'A': [1, 2, 2, 3],
    'B': ['a', 'b', 'b', 'c'],
    'C': [10, 20, 20, 30]
})
df_all

   A  B   C
0  1  a  10
1  2  b  20
2  2  b  20
3  3  c  30

In [101]:
df_all.drop_duplicates()

   A  B   C
0  1  a  10
1  2  b  20
3  3  c  30

### Removing duplicates based on specific columns
You can specify which columns to consider when identifying duplicates using the subset parameter:

In [102]:
# DataFrame with partial duplicates
df = pd.DataFrame({
    'Name': ['John', 'Jane', 'John', 'Mike', 'Jane'],
    'Age': [28, 32, 28, 45, 33],
    'City': ['New York', 'Boston', 'Chicago', 'Chicago', 'Boston']
})
df

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28   Chicago
3  Mike   45   Chicago
4  Jane   33    Boston

In [103]:
# Remove duplicates based on 'Name' column
df.drop_duplicates(subset=['Name'])

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
3  Mike   45   Chicago

In [104]:
# Remove duplicates based on 'Name' and 'City' columns
df.drop_duplicates(subset=['Name', 'City'])

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28   Chicago
3  Mike   45   Chicago

### Keeping first vs. last occurrence
The keep parameter in .drop_duplicates() allows you to specify which occurrence of a duplicate to keep:

* 'first' (default): Keep the first occurrence of a duplicate.
* 'last': Keep the last occurrence of a duplicate.
* False: Drop all duplicates, including the first occurrence.

In [105]:
# Keep first occurrence (default behavior)
df.drop_duplicates(keep='first')

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28   Chicago
3  Mike   45   Chicago
4  Jane   33    Boston

In [106]:
# Keep last occurrence
df.drop_duplicates(keep='last')

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28   Chicago
3  Mike   45   Chicago
4  Jane   33    Boston

In [107]:
# todo: fixme
# Keep all duplicates
df.drop_duplicates(keep=False)

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28   Chicago
3  Mike   45   Chicago
4  Jane   33    Boston

In [108]:
# Keep last occurrence of duplicates based on 'Name'
df.drop_duplicates(subset=['Name'], keep='last')

   Name  Age     City
2  John   28  Chicago
3  Mike   45  Chicago
4  Jane   33   Boston

Remember that .drop_duplicates() returns a new DataFrame. If you want to modify the original DataFrame, use the inplace=True parameter:

In [109]:
# Modify the original DataFrame
df.drop_duplicates(inplace=True)

In [110]:
df

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28   Chicago
3  Mike   45   Chicago
4  Jane   33    Boston

When removing duplicates, it's important to consider:

1. Which columns are relevant for identifying duplicates in your specific use case.
2. Whether you need to keep the first, last, or no occurrences of duplicates.
3. The potential impact on your analysis of removing certain duplicates.
   
By using these methods, you can effectively clean your data of unwanted duplicates, ensuring that your subsequent analyses are based on unique, relevant data points.

## Advanced Duplicate Handling
As data complexity increases, you may encounter situations where simple duplicate removal isn't sufficient. This section covers more advanced techniques for handling duplicates in various scenarios.

### Partial duplicates
Partial duplicates occur when some, but not all, columns match between rows. Handling these often requires a more nuanced approach.

In [111]:
# Create a DataFrame with partial duplicates
df = pd.DataFrame({
    'Name': ['John Smith', 'Jane Doe', 'John Smith', 'Mike Johnson', 'Jane Doe'],
    'Age': [28, 32, 28, 45, 33],
    'City': ['New York', 'Boston', 'Chicago', 'Chicago', 'Boston']
})
df

           Name  Age      City
0    John Smith   28  New York
1      Jane Doe   32    Boston
2    John Smith   28   Chicago
3  Mike Johnson   45   Chicago
4      Jane Doe   33    Boston

In [112]:
# Identify partial duplicates based on 'Name'
partial_dupes = df[df.duplicated(subset=['Name'], keep=False)]

print("Partial duplicates:")
partial_dupes

Partial duplicates:

         Name  Age      City
0  John Smith   28  New York
1    Jane Doe   32    Boston
2  John Smith   28   Chicago
4    Jane Doe   33    Boston

In [113]:
# Aggregate partial duplicates
aggregated = df.groupby('Name').agg({
    'Age': 'first',
    'City': lambda x: ', '.join(set(x))
}).reset_index()

print("\nAggregated data:")
aggregated

Aggregated data:

           Name  Age               City
0      Jane Doe   32             Boston
1    John Smith   28  New York, Chicago
2  Mike Johnson   45            Chicago

### Fuzzy matching for near-duplicates
Near-duplicates are entries that are very similar but not exactly identical, often due to typos or slight variations. Fuzzy matching can help identify these.

In [2]:
%pip install thefuzz
# Requirement already satisfied: thefuzz in /Users/hejazizo/miniconda3/envs/py310/lib/python3.10/site-packages (0.19.0)
# Note: you may need to restart the kernel to use updated packages.
from thefuzz import fuzz, process

Requirement already satisfied: thefuzz in /home/mehdi/miniconda3/envs/my_project/lib/python3.12/site-packages (0.22.1)
Requirement already satisfied: rapidfuzz<4.0.0,>=3.0.0 in /home/mehdi/miniconda3/envs/my_project/lib/python3.12/site-packages (from thefuzz) (3.14.3)
Note: you may need to restart the kernel to use updated packages.

In [4]:
# Create a DataFrame with near-duplicates
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'Name': ['John Smith', 'Jon Smith', 'Jane Doe', 'Jane Do', 'Mike Johnson']
})
df

           Name
0    John Smith
1     Jon Smith
2      Jane Doe
3       Jane Do
4  Mike Johnson

In [5]:
# Function to find fuzzy duplicates
def find_fuzzy_duplicates(name, names_list, cutoff=80):
    matches = process.extract(name, names_list, limit=2, scorer=fuzz.token_sort_ratio)
    return [match for match in matches if match[1] >= cutoff and match[0] != name]

# Apply fuzzy matching
df['Fuzzy_Matches'] = df['Name'].apply(lambda x: find_fuzzy_duplicates(x, df['Name']))
df

           Name          Fuzzy_Matches
0    John Smith   [(Jon Smith, 95, 1)]
1     Jon Smith  [(John Smith, 95, 0)]
2      Jane Doe     [(Jane Do, 93, 3)]
3       Jane Do    [(Jane Doe, 93, 2)]
4  Mike Johnson                     []

In [6]:
# Identify groups of fuzzy duplicates
fuzzy_groups = {}
for idx, row in df.iterrows():
    if row['Fuzzy_Matches']:
        name = row['Name']
        match = row['Fuzzy_Matches'][0][0]
        if name not in fuzzy_groups and match not in fuzzy_groups:
            fuzzy_groups[name] = [name, match]
        elif name in fuzzy_groups:
            fuzzy_groups[name].append(match)
        elif match in fuzzy_groups:
            fuzzy_groups[match].append(name)

In [7]:
print("\nFuzzy duplicate groups:")
for group in fuzzy_groups.values():
    print(group)

Fuzzy duplicate groups:
['John Smith', 'Jon Smith', 'Jon Smith']
['Jane Doe', 'Jane Do', 'Jane Do']

### Handling duplicates in time series data
Time series data often requires special consideration when handling duplicates, especially when timestamps are involved.

In [11]:
# Create a time series DataFrame with duplicates
df = pd.DataFrame({
    'Timestamp': pd.date_range(start='2023-01-01', periods=5, freq='D').tolist() + 
                 [pd.Timestamp('2023-01-02'), pd.Timestamp('2023-01-04')],
    'Value': [1, 2, 3, 4, 5, 2.5, 4.5]
})
df

   Timestamp  Value
0 2023-01-01    1.0
1 2023-01-02    2.0
2 2023-01-03    3.0
3 2023-01-04    4.0
4 2023-01-05    5.0
5 2023-01-02    2.5
6 2023-01-04    4.5

In [12]:
# # Create a time series DataFrame with duplicates
# df = pd.DataFrame({
#     'Timestamp': pd.date_range(start='2023-01-01', periods=7, freq='D').tolist(),
#     'Value': [1, 2, 3, 4, 5, 2.5, 4.5]
# })
# df
# Sort by timestamp and remove duplicates, keeping the last occurrence
df_cleaned = df.sort_values('Timestamp').drop_duplicates('Timestamp', keep='last')
df_cleaned

   Timestamp  Value
0 2023-01-01    1.0
5 2023-01-02    2.5
2 2023-01-03    3.0
6 2023-01-04    4.5
4 2023-01-05    5.0

In [13]:
# Alternatively, aggregate duplicates
df_aggregated = df.groupby('Timestamp').agg({
    'Value': ['mean', 'min', 'max']
}).reset_index()

df_aggregated

   Timestamp Value
              mean  min  max
0 2023-01-01  1.00  1.0  1.0
1 2023-01-02  2.25  2.0  2.5
2 2023-01-03  3.00  3.0  3.0
3 2023-01-04  4.25  4.0  4.5
4 2023-01-05  5.00  5.0  5.0

## Accessing String Methods in Pandas
In Pandas, string methods are accessed through the .str accessor. This accessor provides a convenient way to apply string operations to entire Series or DataFrame columns containing string data. The .str accessor allows you to use most of Python's string methods, as well as some additional Pandas-specific string functions.

Here's how you can access string methods in Pandas:

In [3]:
# Create a sample Series with string data
import pandas as pd
import numpy as np
s = pd.Series(['apple', 'banana', 'cherry', 'date', np.nan])

# Access string methods using the .str accessor
s.str.upper()

0     APPLE
1    BANANA
2    CHERRY
3      DATE
4       NaN
dtype: object

### Vectorized Operations
The .str accessor applies operations to all non-null elements in a Series or DataFrame column. This vectorized approach is much faster than iterating over each element individually.

In [5]:
# Vectorized operation on the 'Name' column
df = pd.DataFrame({
    'Name': ['John Smith', 'Jane Doe', 'Bob Johnson', 'Alice Brown', np.nan],
    'Email': ['john@example.com', 'jane@example.com', 'bob@example.com', 'alice@example.com', 'unknown@example.com'],
    'Address': ['123 Main St, NY', '456 Elm St, CA', '789 Oak St, TX', '321 Pine St, FL', '654 Maple St, WA']
})
df['Name'].str.lower()

0     john smith
1       jane doe
2    bob johnson
3    alice brown
4            NaN
Name: Name, dtype: object

### Handling Missing Values
Pandas automatically handles missing values (NaN or None) when using string methods. These values are typically preserved or ignored, depending on the operation.

In [6]:
# Notice how the NaN value is preserved
df['Name'].str.len()

0    10.0
1     8.0
2    11.0
3    11.0
4     NaN
Name: Name, dtype: float64

### Accessing Individual Characters
You can access individual characters or slices of strings using indexing:

In [9]:
df['Name'].str[0]

0      J
1      J
2      B
3      A
4    NaN
Name: Name, dtype: object

In [10]:
# Get the first three characters of each name
df['Name'].str[:3]

0    Joh
1    Jan
2    Bob
3    Ali
4    NaN
Name: Name, dtype: object

### Method Chaining
You can chain multiple string operations together for more complex transformations:

In [14]:
# Chain multiple string operations
df['Email'].str.split('@').str[0]
df['Email'].str.split('@').str[0].str.capitalize()

0       John
1       Jane
2        Bob
3      Alice
4    Unknown
Name: Email, dtype: object

### Boolean Indexing
String methods that return boolean values can be used for filtering:

In [15]:
df['Name'].str.startswith('J', na=False)

0     True
1     True
2    False
3    False
4    False
Name: Name, dtype: bool

In [16]:
# Filter names that start with 'J'
# df[df['Name'].str.startswith('J')] # will raise an error since there are NaN values
df[df['Name'].str.startswith('J', na=False)] # use na=False to handle NaN values

         Name             Email          Address
0  John Smith  john@example.com  123 Main St, NY
1    Jane Doe  jane@example.com   456 Elm St, CA

In [17]:
df['Name'].apply(lambda x: x.upper() if not pd.isna(x) else x)

0     JOHN SMITH
1       JANE DOE
2    BOB JOHNSON
3    ALICE BROWN
4            NaN
Name: Name, dtype: object

### Applying to DataFrame Columns
You can apply string methods to specific columns in a DataFrame:

In [18]:
# Apply string method to multiple columns
df[['Name', 'Email']].apply(lambda x: x.str.upper())

          Name                Email
0   JOHN SMITH     JOHN@EXAMPLE.COM
1     JANE DOE     JANE@EXAMPLE.COM
2  BOB JOHNSON      BOB@EXAMPLE.COM
3  ALICE BROWN    ALICE@EXAMPLE.COM
4          NaN  UNKNOWN@EXAMPLE.COM

### Regular Expressions
The .str accessor also provides methods for working with regular expressions:

In [19]:
# Extract the domain from email addresses
df['Email'].str.extract(r'@(.+)$')

             0
0  example.com
1  example.com
2  example.com
3  example.com
4  example.com

## Basic String Operations
Pandas provides a variety of basic string operations that are frequently used in data cleaning and preprocessing. Let's explore some of the most common operations.

### Changing Case (lower, upper, title, swapcase)
Changing the case of strings is often necessary for standardization or formatting purposes.

In [20]:
# Create a sample Series
s = pd.Series(['APPLE', 'banana', 'Cherry', 'DATE'])
# Convert to lowercase
s.str.lower()

0     apple
1    banana
2    cherry
3      date
dtype: object

In [21]:
# Convert to uppercase
s.str.upper()

0     APPLE
1    BANANA
2    CHERRY
3      DATE
dtype: object

In [22]:
# Convert to title case
s.str.title()

0     Apple
1    Banana
2    Cherry
3      Date
dtype: object

In [23]:
# Swap case
s.str.swapcase()

0     apple
1    BANANA
2    cHERRY
3      date
dtype: object

In [24]:

# Applying to our DataFrame
df['Name'].str.title()

0     John Smith
1       Jane Doe
2    Bob Johnson
3    Alice Brown
4            NaN
Name: Name, dtype: object

### Trimming Whitespace (strip, lstrip, rstrip)
Removing unwanted whitespace is crucial for data cleaning and comparison operations.

In [25]:
# Create a Series with whitespace
s = pd.Series(['  apple  ', ' banana ', 'cherry  ', '  date'])
# Remove whitespace from both ends
s.str.strip()

0     apple
1    banana
2    cherry
3      date
dtype: object

In [26]:
# Remove whitespace from left side
s.str.lstrip()

0     apple
1     banana
2    cherry
3        date
dtype: object

In [27]:
# Remove whitespace from right side
s.str.rstrip()

0      apple
1     banana
2     cherry
3       date
dtype: object

In [28]:
# Applying to our DataFrame
df['Address'] = df['Address'].str.strip()
df['Address']

0     123 Main St, NY
1      456 Elm St, CA
2      789 Oak St, TX
3     321 Pine St, FL
4    654 Maple St, WA
Name: Address, dtype: object

In [35]:
# Remove specific characters
pd.Series(['##apple##', '#banana%%#', 'cherry##']).str.strip('#%')

0     apple
1    banana
2    cherry
dtype: object

### Padding Strings (pad, center, ljust, rjust)
Padding strings is useful for formatting output or aligning text.

In [36]:
# Create a Series of strings
s = pd.Series(['apple', 'banana', 'cherry'])
# Pad strings to a specified length
s.str.pad(width=10, side='left', fillchar='*')

0    *****apple
1    ****banana
2    ****cherry
dtype: object

In [37]:
# Center strings
s.str.center(10, fillchar='-')

0    --apple---
1    --banana--
2    --cherry--
dtype: object

In [38]:
# Left justify
s.str.ljust(10, fillchar='>')

0    apple>>>>>
1    banana>>>>
2    cherry>>>>
dtype: object

In [39]:
# Right justify
s.str.rjust(10, fillchar='<')

0    <<<<<apple
1    <<<<banana
2    <<<<cherry
dtype: object

In [40]:
# Applying to our DataFrame
df['Name'].str.ljust(15, fillchar='-')

0    John Smith-----
1    Jane Doe-------
2    Bob Johnson----
3    Alice Brown----
4                NaN
Name: Name, dtype: object

### String Information and Checks
String information and checks are essential operations when working with text data. Pandas provides several methods to extract information from strings and check their contents.

### Length of Strings
To get the length of strings in a Series or DataFrame column, we use the .str.len() method:

In [41]:
# Calculate the length of each name
df['Name'].str.len()

0    10.0
1     8.0
2    11.0
3    11.0
4     NaN
Name: Name, dtype: float64

In [42]:
# Calculate the length of each email address
df['Email'].str.len()

0    16
1    16
2    15
3    17
4    19
Name: Email, dtype: int64

### Checking String Contents (startswith, endswith, contains)
Pandas provides several methods to check the contents of strings:

The `.str.startswith()` method checks if a string starts with a specified substring:

In [43]:
# Check if names start with 'J'
df['Name'].str.startswith('J')

0     True
1     True
2    False
3    False
4      NaN
Name: Name, dtype: object

In [44]:
# Check if email addresses start with 'john'
df['Email'].str.startswith('john')

0     True
1    False
2    False
3    False
4    False
Name: Email, dtype: bool

In [45]:
# Check if email addresses end with '.com'
df['Email'].str.endswith('.com')

0    True
1    True
2    True
3    True
4    True
Name: Email, dtype: bool

In [46]:
# Check if addresses end with 'NY'
df['Address'].str.endswith('NY')

0     True
1    False
2    False
3    False
4    False
Name: Address, dtype: bool

In [47]:
# Check if names contain 'Smith'
df['Name'].str.contains('Smith')

0     True
1    False
2    False
3    False
4      NaN
Name: Name, dtype: object

In [48]:
# Check if addresses contain 'St'
df['Address'].str.contains('St')

0    True
1    True
2    True
3    True
4    True
Name: Address, dtype: bool

You can also use regular expressions with `contains()`:

In [49]:
# Check if email contains a digit
df['Email'].str.contains(r'\d')

0    False
1    False
2    False
3    False
4    False
Name: Email, dtype: bool

These methods are case-sensitive by default. You can make them case-insensitive by passing the case=False argument:

In [50]:
# Case-insensitive check for 'SMITH' in names
df['Name'].str.contains('SMITH', case=False)

0     True
1    False
2    False
3    False
4      NaN
Name: Name, dtype: object

In [51]:
# Filter rows where the name starts with 'J' and the address contains 'St'
df[(df['Name'].str.startswith('J')) & (df['Address'].str.contains('St'))]

         Name             Email          Address
0  John Smith  john@example.com  123 Main St, NY
1    Jane Doe  jane@example.com   456 Elm St, CA

Remember that these methods automatically handle missing values (NaN) in the Series, treating them as False in the resulting boolean Series. If you want to preserve NaN values, you can use the na=np.nan parameter:

In [52]:
# Preserve NaN values in the result
df['Name'].str.contains('Smith', na=np.nan)

0     True
1    False
2    False
3    False
4      NaN
Name: Name, dtype: object

### Extracting and Replacing Substrings
Extracting specific parts of strings and replacing substrings are common operations in data cleaning and text analysis. Pandas provides several methods to perform these tasks efficiently.

#### Substring Extraction (slice, get)
Pandas offers multiple ways to extract substrings from Series or DataFrame columns.

The `str.slice()` method allows you to extract a portion of each string in a Series.

In [59]:
# Create a sample Series
s = pd.Series(['apple', 'banana', 'cherry', 'date'])
s

0     apple
1    banana
2    cherry
3      date
dtype: object

In [53]:
# Extract the first three characters
s.str.slice(0, 3)

0    app
1    ban
2    che
dtype: object

In [54]:
# Extract from the second character to the end
s.str.slice(1)

0     pple
1    anana
2    herry
dtype: object

In [55]:
# Extract the last two characters
s.str.slice(-2)

0    le
1    na
2    ry
dtype: object

In [56]:
# Applying to our DataFrame
df['Name'].str.slice(0, 5)

0    John
1    Jane
2    Bob J
3    Alice
4      NaN
Name: Name, dtype: object

The `str.get()` method is used to extract a single character at a specified position.

In [60]:
# Get the first character
s.str.get(0)

0    a
1    b
2    c
3    d
dtype: object

In [61]:
# Get the last character
s.str.get(-1)

0    e
1    a
2    y
3    e
dtype: object

In [62]:
# Applying to our DataFrame
df['Name'].str.get(0)

0      J
1      J
2      B
3      A
4    NaN
Name: Name, dtype: object

### Finding and Replacing (find, replace)
Finding and replacing substrings are crucial operations for data cleaning and transformation.

The `str.find()` method locates the position of a substring within each string in a Series.

In [63]:
# Create a sample Series
s = pd.Series(['apple pie', 'banana split', 'cherry tart'])
s

0       apple pie
1    banana split
2     cherry tart
dtype: object

In [64]:
# Find the position of 'a' in each string
s.str.find('a')

0    0
1    1
2    8
dtype: int64

In [65]:
# Find the position of 'an' in each string
s.str.find('an')

0   -1
1    1
2   -1
dtype: int64

In [67]:
df['Email']

0       john@example.com
1       jane@example.com
2        bob@example.com
3      alice@example.com
4    unknown@example.com
Name: Email, dtype: object

In [ ]:
# Applying to our DataFrame
df['Email'].str.find('@')

0    4
1    4
2    3
3    5
4    7
Name: Email, dtype: int64

The `str.replace()` method substitutes occurrences of a substring with another string.

In [68]:
# Replace 'a' with 'X'
s.str.replace('a', 'X')

0       Xpple pie
1    bXnXnX split
2     cherry tXrt
dtype: object

In [ ]:
# Replace the first occurrence of 'a' with 'X'
s.str.replace('a', 'X', n=1)

In [69]:
# Using regex for more complex replacements
s.str.replace(r'\s', '_', regex=True)

0       apple_pie
1    banana_split
2     cherry_tart
dtype: object

In [70]:
# Using regex for more complex replacements
s.str.replace(r'\s+', '_', regex=True)

0       apple_pie
1    banana_split
2     cherry_tart
dtype: object

In [71]:
# Applying to our DataFrame
df['Email'].str.replace('example.com', 'newdomain.com')

0       john@newdomain.com
1       jane@newdomain.com
2        bob@newdomain.com
3      alice@newdomain.com
4    unknown@newdomain.com
Name: Email, dtype: object

In [72]:
df

          Name                Email           Address
0   John Smith     john@example.com   123 Main St, NY
1     Jane Doe     jane@example.com    456 Elm St, CA
2  Bob Johnson      bob@example.com    789 Oak St, TX
3  Alice Brown    alice@example.com   321 Pine St, FL
4          NaN  unknown@example.com  654 Maple St, WA

In [73]:
df['Email'].str.find('@')

0    4
1    4
2    3
3    5
4    7
Name: Email, dtype: int64

In [76]:
df['Email'].str.split('@').str[0]

0       john
1       jane
2        bob
3      alice
4    unknown
Name: Email, dtype: object

In [77]:
# Mask part of the email for privacy
df['Email'].apply(lambda x: x[:3] + '*' * (x.find('@') - 3) + x[x.find('@'):] if isinstance(x, str) else x)

0       joh*@example.com
1       jan*@example.com
2        bob@example.com
3      ali**@example.com
4    unk****@example.com
Name: Email, dtype: object

In [78]:
# Replace state abbreviations with full names
state_mapping = {'NY': 'New York', 'CA': 'California', 'TX': 'Texas', 'FL': 'Florida', 'WA': 'Washington'}
df['Address'].replace(state_mapping, regex=True)

0       123 Main St, New York
1      456 Elm St, California
2           789 Oak St, Texas
3        321 Pine St, Florida
4    654 Maple St, Washington
Name: Address, dtype: object

## Regular Expressions in Pandas
Regular expressions (regex) are powerful tools for pattern matching and text manipulation. Pandas integrates regex functionality, allowing you to perform complex string operations efficiently on Series and DataFrame columns.

## Introduction to Regular Expressions
Regular expressions are sequences of characters that define a search pattern. They're particularly useful for:

* Validating string formats (e.g., email addresses, phone numbers)
* Extracting specific parts of strings
* Complex find-and-replace operations

In Pandas, you can use regex with many string methods by setting the regex=True parameter.

### Using re.match, re.search, and re.findall

In [ ]:
# Create a sample Series
s = pd.Series(['foo123', 'bar456', '123baz'])

# Check if strings start with letters
s.str.match(r'[a-zA-Z]+')

0    True
1    True
2    True
dtype: bool

In [84]:
# Check if strings contain digits
s.str.contains(r'\d+')

0    True
1    True
2    True
dtype: bool

In [87]:
# Find all digits in each string
s.str.findall(r'\d+')

0    [123]
1    [456]
2    [123]
dtype: object

In [88]:
# Applying to our DataFrame
df['Address'].str.findall(r'\d+')  # Extract all numbers from addresses

0    [123]
1    [456]
2    [789]
3    [321]
4    [654]
Name: Address, dtype: object

### Extracting Information with Regex
Regex is particularly powerful for extracting structured information from strings.

Extracts the first occurrence of a pattern with capture groups.

In [89]:
s

0    foo123
1    bar456
2    123baz
dtype: object

In [90]:
# Extract the first word and number from each string
s.str.extract(r'([a-zA-Z]+)(\d+)')

     0    1
0  foo  123
1  bar  456
2  NaN  NaN

In [91]:
df['Address']

0     123 Main St, NY
1      456 Elm St, CA
2      789 Oak St, TX
3     321 Pine St, FL
4    654 Maple St, WA
Name: Address, dtype: object

In [93]:
# Applying to our DataFrame
df['Address'].str.extract(r'(\d+)\s+(.+),\s+(\w{2})')  # Extract street number, street name, and state

     0         1   2
0  123   Main St  NY
1  456    Elm St  CA
2  789    Oak St  TX
3  321   Pine St  FL
4  654  Maple St  WA

In [94]:
# Extract all words and numbers
s.str.extractall(r'([a-zA-Z]+)(\d+)')

           0    1
  match
0 0      foo  123
1 0      bar  456

In [95]:
# Applying to our DataFrame
df['Email'].str.extractall(r'(\w+)@(\w+\.\w+)')  # Extract username and domain from email

               0            1
  match
0 0         john  example.com
1 0         jane  example.com
2 0          bob  example.com
3 0        alice  example.com
4 0      unknown  example.com

In [96]:
# Ensure we have our sample DataFrame
df = pd.DataFrame({
    'Name': ['John Smith', 'Jane Doe', 'Bob Johnson', 'Alice Brown', None],
    'Email': ['john@example.com', 'jane@example.com', 'bob@example.com', 'alice@example.com', 'unknown@example.com'],
    'Address': ['123 Main St, NY 10001', '456 Elm St, CA 90210', '789 Oak St, TX 75001', '321 Pine St, FL 33101', '654 Maple St, WA 98101']
})
df

          Name                Email                 Address
0   John Smith     john@example.com   123 Main St, NY 10001
1     Jane Doe     jane@example.com    456 Elm St, CA 90210
2  Bob Johnson      bob@example.com    789 Oak St, TX 75001
3  Alice Brown    alice@example.com   321 Pine St, FL 33101
4         None  unknown@example.com  654 Maple St, WA 98101

In [97]:
# Extract components from the Address
address_components = df['Address'].str.extract(r'(\d+)\s+(.+),\s+(\w{2})\s+(\d{5})')
# address_components.columns = ['Street_Number', 'Street_Name', 'State', 'Zip_Code']
address_components

     0         1   2      3
0  123   Main St  NY  10001
1  456    Elm St  CA  90210
2  789    Oak St  TX  75001
3  321   Pine St  FL  33101
4  654  Maple St  WA  98101

In [98]:
# Extract components from the Address
address_components.columns = ['Street_Number', 'Street_Name', 'State', 'Zip_Code']
address_components

  Street_Number Street_Name State Zip_Code
0           123     Main St    NY    10001
1           456      Elm St    CA    90210
2           789      Oak St    TX    75001
3           321     Pine St    FL    33101
4           654    Maple St    WA    98101

In [99]:
# Extract username and domain from Email
email_components = df['Email'].str.extract(r'(\w+)@(\w+\.\w+)')

email_components

         0            1
0     john  example.com
1     jane  example.com
2      bob  example.com
3    alice  example.com
4  unknown  example.com

In [100]:
# Extract username and domain from Email

email_components.columns = ['Username', 'Domain']
email_components

  Username       Domain
0     john  example.com
1     jane  example.com
2      bob  example.com
3    alice  example.com
4  unknown  example.com

In [101]:
# Combine the extracted information with the original DataFrame
df_expanded = pd.concat([df, address_components, email_components], axis=1)
df_expanded

,Name,Email,Address,Street_Number,Street_Name,State,Zip_Code,Username,Domain
0,John Smith,john@example.com,"123 Main St, NY 10001",123,Main St,NY,10001,john,example.com
1,Jane Doe,jane@example.com,"456 Elm St, CA 90210",456,Elm St,CA,90210,jane,example.com
2,Bob Johnson,bob@example.com,"789 Oak St, TX 75001",789,Oak St,TX,75001,bob,example.com
3,Alice Brown,alice@example.com,"321 Pine St, FL 33101",321,Pine St,FL,33101,alice,example.com
4,None,unknown@example.com,"654 Maple St, WA 98101",654,Maple St,WA,98101,unknown,example.com

In [102]:
# Validate email format
df_expanded['Valid_Email'] = df_expanded['Email'].str.match(r'^[\w\.-]+@[\w\.-]+\.\w+$')
df_expanded

,Name,Email,Address,Street_Number,Street_Name,State,Zip_Code,Username,Domain,Valid_Email
0,John Smith,john@example.com,"123 Main St, NY 10001",123,Main St,NY,10001,john,example.com,True
1,Jane Doe,jane@example.com,"456 Elm St, CA 90210",456,Elm St,CA,90210,jane,example.com,True
2,Bob Johnson,bob@example.com,"789 Oak St, TX 75001",789,Oak St,TX,75001,bob,example.com,True
3,Alice Brown,alice@example.com,"321 Pine St, FL 33101",321,Pine St,FL,33101,alice,example.com,True
4,None,unknown@example.com,"654 Maple St, WA 98101",654,Maple St,WA,98101,unknown,example.com,True

In [103]:
# Extract area code from Zip_Code
df_expanded['Area_Code'] = df_expanded['Zip_Code'].str.slice(0, 3)

# Display results
df_expanded

,Name,Email,Address,Street_Number,Street_Name,State,Zip_Code,Username,Domain,Valid_Email,Area_Code
0,John Smith,john@example.com,"123 Main St, NY 10001",123,Main St,NY,10001,john,example.com,True,100
1,Jane Doe,jane@example.com,"456 Elm St, CA 90210",456,Elm St,CA,90210,jane,example.com,True,902
2,Bob Johnson,bob@example.com,"789 Oak St, TX 75001",789,Oak St,TX,75001,bob,example.com,True,750
3,Alice Brown,alice@example.com,"321 Pine St, FL 33101",321,Pine St,FL,33101,alice,example.com,True,331
4,None,unknown@example.com,"654 Maple St, WA 98101",654,Maple St,WA,98101,unknown,example.com,True,981

## Splitting and Joining Strings
Splitting strings into multiple parts and joining strings together are common operations in data preprocessing and text analysis. Pandas provides efficient methods for these operations that can be applied to entire Series or DataFrame columns.

### Splitting Strings (split, rsplit)
Pandas offers methods to split strings based on a specified delimiter.

The str.split() method splits a string into a list of substrings.

In [104]:
# Create a sample Series
s = pd.Series(['apple pie', 'banana split', 'cherry tart', 'hot date pudding'])
s

0           apple pie
1        banana split
2         cherry tart
3    hot date pudding
dtype: object

In [105]:
# Split strings by space
s.str.split()

0            [apple, pie]
1         [banana, split]
2          [cherry, tart]
3    [hot, date, pudding]
dtype: object

In [106]:
# Split with expand=True to return a DataFrame
s.str.split(expand=True)

        0      1        2
0   apple    pie     None
1  banana  split     None
2  cherry   tart     None
3     hot   date  pudding

In [107]:
s.str.split(n=1, expand=True)

        0             1
0   apple           pie
1  banana         split
2  cherry          tart
3     hot  date pudding

In [108]:
# Applying to our DataFrame
df['Name'].str.split(expand=True)

       0        1
0   John    Smith
1   Jane      Doe
2    Bob  Johnson
3  Alice    Brown
4   None     None

The str.rsplit() method is similar to split(), but starts from the right side of the string.

In [109]:
# Right split with a limit
s.str.rsplit(n=1, expand=True)

          0        1
0     apple      pie
1    banana    split
2    cherry     tart
3  hot date  pudding

In [110]:
# Applying to our DataFrame
df['Email'].str.rsplit('@', n=1, expand=True)

         0            1
0     john  example.com
1     jane  example.com
2      bob  example.com
3    alice  example.com
4  unknown  example.com

### Joining Strings (cat)
The str.cat() method is used to concatenate strings in Pandas.

In [111]:
# Create sample Series
first_names = pd.Series(['John', 'Jane', 'Bob', 'Alice'])
last_names = pd.Series(['Smith', 'Doe', 'Johnson', 'Brown'])
# Concatenate with a space separator
full_names = first_names.str.cat(last_names, sep=' ')
full_names

0     John Smith
1       Jane Doe
2    Bob Johnson
3    Alice Brown
dtype: object

In [112]:
# Concatenate multiple Series
pd.Series(['Mr.', 'Ms.', 'Mr.', 'Ms.']).str.cat([first_names, last_names], sep=' ')

0     Mr. John Smith
1       Ms. Jane Doe
2    Mr. Bob Johnson
3    Ms. Alice Brown
dtype: object

In [113]:
# Applying to our DataFrame
df['Address'].str.cat(df['Email'], sep=' | ')

0        123 Main St, NY 10001 | john@example.com
1         456 Elm St, CA 90210 | jane@example.com
2          789 Oak St, TX 75001 | bob@example.com
3       321 Pine St, FL 33101 | alice@example.com
4    654 Maple St, WA 98101 | unknown@example.com
Name: Address, dtype: object

In [114]:
# Ensure we have our sample DataFrame
df = pd.DataFrame({
    'Name': ['John Smith', 'Jane Doe', 'Bob Johnson', 'Alice Brown', None],
    'Email': ['john@example.com', 'jane@example.com', 'bob@example.com', 'alice@example.com', 'unknown@example.com'],
    'Address': ['123 Main St, NY, 10001', '456 Elm St, CA, 90210', '789 Oak St, TX, 75001', '321 Pine St, FL, 33101', '654 Maple St, WA, 98101']
})
df

          Name                Email                  Address
0   John Smith     john@example.com   123 Main St, NY, 10001
1     Jane Doe     jane@example.com    456 Elm St, CA, 90210
2  Bob Johnson      bob@example.com    789 Oak St, TX, 75001
3  Alice Brown    alice@example.com   321 Pine St, FL, 33101
4         None  unknown@example.com  654 Maple St, WA, 98101

In [115]:
# Split Name into First Name and Last Name
name_split = df['Name'].str.split(n=1, expand=True)
df['First_Name'] = name_split[0]
df['Last_Name'] = name_split[1]
df

,Name,Email,Address,First_Name,Last_Name
0,John Smith,john@example.com,"123 Main St, NY, 10001",John,Smith
1,Jane Doe,jane@example.com,"456 Elm St, CA, 90210",Jane,Doe
2,Bob Johnson,bob@example.com,"789 Oak St, TX, 75001",Bob,Johnson
3,Alice Brown,alice@example.com,"321 Pine St, FL, 33101",Alice,Brown
4,None,unknown@example.com,"654 Maple St, WA, 98101",None,None

In [116]:
# Split Email into Username and Domain
email_split = df['Email'].str.split('@', expand=True)
df['Username'] = email_split[0]
df['Domain'] = email_split[1]
df

,Name,Email,Address,First_Name,Last_Name,Username,Domain
0,John Smith,john@example.com,"123 Main St, NY, 10001",John,Smith,john,example.com
1,Jane Doe,jane@example.com,"456 Elm St, CA, 90210",Jane,Doe,jane,example.com
2,Bob Johnson,bob@example.com,"789 Oak St, TX, 75001",Bob,Johnson,bob,example.com
3,Alice Brown,alice@example.com,"321 Pine St, FL, 33101",Alice,Brown,alice,example.com
4,None,unknown@example.com,"654 Maple St, WA, 98101",None,None,unknown,example.com

In [117]:
# Split Address into components
address_split = df['Address'].str.rsplit(',', n=2, expand=True)
df['Street'] = address_split[0]
df['State'] = address_split[1].str.strip().str[:2]
df['Zip'] = address_split[2].str.strip()
df

,Name,Email,Address,First_Name,Last_Name,Username,Domain,Street,State,Zip
0,John Smith,john@example.com,"123 Main St, NY, 10001",John,Smith,john,example.com,123 Main St,NY,10001
1,Jane Doe,jane@example.com,"456 Elm St, CA, 90210",Jane,Doe,jane,example.com,456 Elm St,CA,90210
2,Bob Johnson,bob@example.com,"789 Oak St, TX, 75001",Bob,Johnson,bob,example.com,789 Oak St,TX,75001
3,Alice Brown,alice@example.com,"321 Pine St, FL, 33101",Alice,Brown,alice,example.com,321 Pine St,FL,33101
4,None,unknown@example.com,"654 Maple St, WA, 98101",None,None,unknown,example.com,654 Maple St,WA,98101

In [118]:
# Join First Name and Last Name with a comma
df['Name_Formatted'] = df['Last_Name'].str.cat(df['First_Name'], sep=', ')
df

,Name,Email,Address,First_Name,Last_Name,Username,Domain,Street,State,Zip,Name_Formatted
0,John Smith,john@example.com,"123 Main St, NY, 10001",John,Smith,john,example.com,123 Main St,NY,10001,"Smith, John"
1,Jane Doe,jane@example.com,"456 Elm St, CA, 90210",Jane,Doe,jane,example.com,456 Elm St,CA,90210,"Doe, Jane"
2,Bob Johnson,bob@example.com,"789 Oak St, TX, 75001",Bob,Johnson,bob,example.com,789 Oak St,TX,75001,"Johnson, Bob"
3,Alice Brown,alice@example.com,"321 Pine St, FL, 33101",Alice,Brown,alice,example.com,321 Pine St,FL,33101,"Brown, Alice"
4,None,unknown@example.com,"654 Maple St, WA, 98101",None,None,unknown,example.com,654 Maple St,WA,98101,NaN

In [119]:
# Create a full contact info string
df['Contact_Info'] = df['Name'].str.cat([df['Email'], df['Address']], sep=' | ')
df

,Name,Email,Address,First_Name,Last_Name,Username,Domain,Street,State,Zip,Name_Formatted,Contact_Info
0,John Smith,john@example.com,"123 Main St, NY, 10001",John,Smith,john,example.com,123 Main St,NY,10001,"Smith, John","John Smith | john@example.com | 123 Main St, N..."
1,Jane Doe,jane@example.com,"456 Elm St, CA, 90210",Jane,Doe,jane,example.com,456 Elm St,CA,90210,"Doe, Jane","Jane Doe | jane@example.com | 456 Elm St, CA, ..."
2,Bob Johnson,bob@example.com,"789 Oak St, TX, 75001",Bob,Johnson,bob,example.com,789 Oak St,TX,75001,"Johnson, Bob","Bob Johnson | bob@example.com | 789 Oak St, TX..."
3,Alice Brown,alice@example.com,"321 Pine St, FL, 33101",Alice,Brown,alice,example.com,321 Pine St,FL,33101,"Brown, Alice","Alice Brown | alice@example.com | 321 Pine St,..."
4,None,unknown@example.com,"654 Maple St, WA, 98101",None,None,unknown,example.com,654 Maple St,WA,98101,NaN,NaN

## Practical Examples and Use Cases
Let's explore some real-world scenarios where string manipulation in Pandas is particularly useful. These examples will demonstrate how to apply the techniques we've learned to solve common data processing tasks.

### Cleaning and Standardizing Customer Data
Suppose we have a messy customer database that needs cleaning and standardization.

In [120]:
import pandas as pd
import numpy as np
# Create a sample messy customer database
df = pd.DataFrame({
    'Customer_Name': ['john doe', 'JANE SMITH', 'Bob Johnson', '  Alice Brown  ', np.nan],
    'Email': ['john.doe@email.com', 'jane.smith@email.com', 'bob.j@email', 'alice@email.com', 'unknown'],
    'Phone': ['(123) 456-7890', '987-654-3210', '1234567890', '(456)789-0123', np.nan],
    'Address': ['123 Main St., New York, NY 10001', '456 Elm St, Los Angeles CA 90001', '789 Oak Road TX 75001', '321 Pine Avenue, Miami FL 33101', '654 Maple St Seattle WA 98101']
})
df

,Customer_Name,Email,Phone,Address
0,john doe,john.doe@email.com,(123) 456-7890,"123 Main St., New York, NY 10001"
1,JANE SMITH,jane.smith@email.com,987-654-3210,"456 Elm St, Los Angeles CA 90001"
2,Bob Johnson,bob.j@email,1234567890,789 Oak Road TX 75001
3,Alice Brown,alice@email.com,(456)789-0123,"321 Pine Avenue, Miami FL 33101"
4,NaN,unknown,NaN,654 Maple St Seattle WA 98101

In [121]:
# Clean and standardize the data
df['Customer_Name'] = df['Customer_Name'].str.title().str.strip()
df['Email'] = df['Email'].str.lower().str.replace(r'@email$', '@email.com', regex=True)
df['Phone'] = df['Phone'].str.replace(r'\D', '', regex=True).str.replace(r'(\d{3})(\d{3})(\d{4})', r'(\1) \2-\3', regex=True)
df

,Customer_Name,Email,Phone,Address
0,John Doe,john.doe@email.com,(123) 456-7890,"123 Main St., New York, NY 10001"
1,Jane Smith,jane.smith@email.com,(987) 654-3210,"456 Elm St, Los Angeles CA 90001"
2,Bob Johnson,bob.j@email.com,(123) 456-7890,789 Oak Road TX 75001
3,Alice Brown,alice@email.com,(456) 789-0123,"321 Pine Avenue, Miami FL 33101"
4,NaN,unknown,NaN,654 Maple St Seattle WA 98101

In [122]:
# Extract city and state from address
df[['Street', 'City', 'State_Zip']] = df['Address'].str.split(',', expand=True)
df[['State', 'Zip']] = df['State_Zip'].str.strip().str.split(expand=True)
df['State'] = df['State'].str.upper()
df['Zip'] = df['Zip'].str.replace(r'\D', '', regex=True)
df

,Customer_Name,Email,Phone,Address,Street,City,State_Zip,State,Zip
0,John Doe,john.doe@email.com,(123) 456-7890,"123 Main St., New York, NY 10001",123 Main St.,New York,NY 10001,NY,10001
1,Jane Smith,jane.smith@email.com,(987) 654-3210,"456 Elm St, Los Angeles CA 90001",456 Elm St,Los Angeles CA 90001,None,None,None
2,Bob Johnson,bob.j@email.com,(123) 456-7890,789 Oak Road TX 75001,789 Oak Road TX 75001,None,None,None,None
3,Alice Brown,alice@email.com,(456) 789-0123,"321 Pine Avenue, Miami FL 33101",321 Pine Avenue,Miami FL 33101,None,None,None
4,NaN,unknown,NaN,654 Maple St Seattle WA 98101,654 Maple St Seattle WA 98101,None,None,None,None

In [123]:
# Drop intermediate columns and reorder
df = df.drop('State_Zip', axis=1)
df = df[['Customer_Name', 'Email', 'Phone', 'Street', 'City', 'State', 'Zip']]
df

,Customer_Name,Email,Phone,Street,City,State,Zip
0,John Doe,john.doe@email.com,(123) 456-7890,123 Main St.,New York,NY,10001
1,Jane Smith,jane.smith@email.com,(987) 654-3210,456 Elm St,Los Angeles CA 90001,None,None
2,Bob Johnson,bob.j@email.com,(123) 456-7890,789 Oak Road TX 75001,None,None,None
3,Alice Brown,alice@email.com,(456) 789-0123,321 Pine Avenue,Miami FL 33101,None,None
4,NaN,unknown,NaN,654 Maple St Seattle WA 98101,None,None,None

### Extracting Information from Product Descriptions
Imagine we have a dataset of product descriptions and we need to extract key information.

In [124]:
# Sample product data
products = pd.DataFrame({
    'Product_ID': ['A001', 'B002', 'C003', 'D004', 'E005'],
    'Description': [
        'Red leather wallet, size: 4x3 inches, price: $29.99',
        'Blue denim jeans, waist: 32, length: 34, price: $59.95',
        'Stainless steel watch, diameter: 40mm, water resistant to 50m, price: $129.00',
        'Wireless headphones, battery life: 20 hours, color: black, price: $89.99',
        'Laptop backpack, capacity: 20L, color: gray, fits up to 15" laptop, price: $49.99'
    ]
})
products

  Product_ID                                        Description
0       A001  Red leather wallet, size: 4x3 inches, price: $...
1       B002  Blue denim jeans, waist: 32, length: 34, price...
2       C003  Stainless steel watch, diameter: 40mm, water r...
3       D004  Wireless headphones, battery life: 20 hours, c...
4       E005  Laptop backpack, capacity: 20L, color: gray, f...

In [125]:
# Extract information using regex
products['Price'] = products['Description'].str.extract(r'price: \$(\d+\.\d{2})').astype(float)
products['Color'] = products['Description'].str.extract(r'color: (\w+)')
products['Size'] = products['Description'].str.extract(r'size: ([\w\s]+)')
products['Dimensions'] = products['Description'].str.extract(r'(\d+(?:x\d+)?\s*(?:inches|mm|"|\'))')
products

,Product_ID,Description,Price,Color,Size,Dimensions
0,A001,"Red leather wallet, size: 4x3 inches, price: $...",29.99,NaN,4x3 inches,4x3 inches
1,B002,"Blue denim jeans, waist: 32, length: 34, price...",59.95,NaN,NaN,NaN
2,C003,"Stainless steel watch, diameter: 40mm, water r...",129.00,NaN,NaN,40mm
3,D004,"Wireless headphones, battery life: 20 hours, c...",89.99,black,NaN,NaN
4,E005,"Laptop backpack, capacity: 20L, color: gray, f...",49.99,gray,NaN,"15"""

In [126]:
# Analyze the data
print("\nAverage price:", products['Price'].mean())
print("Most common color:", products['Color'].mode()[0])
print("Price range:", products['Price'].min(), "-", products['Price'].max())

Average price: 71.784
Most common color: black
Price range: 29.99 - 129.0

### Normalizing and Categorizing Text Data
Let's normalize and categorize a dataset of book titles and authors.

In [127]:
# Sample book data
books = pd.DataFrame({
    'Title': ['The Great Gatsby', 'To Kill a Mockingbird', '1984', 'Pride and Prejudice', 'The Catcher in the Rye'],
    'Author': ['F. Scott Fitzgerald', 'Harper Lee', 'George Orwell', 'Jane Austen', 'J.D. Salinger'],
    'Year': ['1925', '1960', '1949', '1813', '1951']
})
books

                    Title               Author  Year
0        The Great Gatsby  F. Scott Fitzgerald  1925
1   To Kill a Mockingbird           Harper Lee  1960
2                    1984        George Orwell  1949
3     Pride and Prejudice          Jane Austen  1813
4  The Catcher in the Rye        J.D. Salinger  1951

In [128]:
# Normalize titles and authors
books['Title_Normalized'] = books['Title'].str.lower().str.replace(r'[^\w\s]', '', regex=True)
books['Author_Last_Name'] = books['Author'].str.split().str[-1].str.lower()
books

,Title,Author,Year,Title_Normalized,Author_Last_Name
0,The Great Gatsby,F. Scott Fitzgerald,1925,the great gatsby,fitzgerald
1,To Kill a Mockingbird,Harper Lee,1960,to kill a mockingbird,lee
2,1984,George Orwell,1949,1984,orwell
3,Pride and Prejudice,Jane Austen,1813,pride and prejudice,austen
4,The Catcher in the Rye,J.D. Salinger,1951,the catcher in the rye,salinger

In [129]:
# Categorize by century
books['Century'] = books['Year'].astype(int).apply(lambda x: f"{(x-1)//100 + 1}th century")
books

,Title,Author,Year,Title_Normalized,Author_Last_Name,Century
0,The Great Gatsby,F. Scott Fitzgerald,1925,the great gatsby,fitzgerald,20th century
1,To Kill a Mockingbird,Harper Lee,1960,to kill a mockingbird,lee,20th century
2,1984,George Orwell,1949,1984,orwell,20th century
3,Pride and Prejudice,Jane Austen,1813,pride and prejudice,austen,19th century
4,The Catcher in the Rye,J.D. Salinger,1951,the catcher in the rye,salinger,20th century

In [130]:
# Create a searchable field
books['Searchable'] = books['Title_Normalized'] + ' ' + books['Author'].str.lower().str.replace(r'[^\w\s]', '', regex=True)
books

,Title,Author,Year,Title_Normalized,Author_Last_Name,Century,Searchable
0,The Great Gatsby,F. Scott Fitzgerald,1925,the great gatsby,fitzgerald,20th century,the great gatsby f scott fitzgerald
1,To Kill a Mockingbird,Harper Lee,1960,to kill a mockingbird,lee,20th century,to kill a mockingbird harper lee
2,1984,George Orwell,1949,1984,orwell,20th century,1984 george orwell
3,Pride and Prejudice,Jane Austen,1813,pride and prejudice,austen,19th century,pride and prejudice jane austen
4,The Catcher in the Rye,J.D. Salinger,1951,the catcher in the rye,salinger,20th century,the catcher in the rye jd salinger

In [131]:
# Demonstrate search functionality
search_term = 'gatsby'
results = books[books['Searchable'].str.contains(search_term)]
print("\nSearch results for '{}':".format(search_term))
results[['Title', 'Author']]

Search results for 'gatsby':

              Title               Author
0  The Great Gatsby  F. Scott Fitzgerald

## Introduction to Date and Time in Pandas
Time series data is a sequence of data points indexed in time order. Pandas provides powerful tools for working with time-based data, making it an essential library for tasks such as financial analysis, scientific research, and business intelligence.

Working with dates and times is crucial in many data analysis tasks. Here's why datetime functionality is so important:

- Data Organization: Time-based indexing allows for intuitive data slicing and selection.
- Trend Analysis: Enables the identification of patterns and trends over time.
- Forecasting: Facilitates predictive modeling based on historical time series data.
- Event Analysis: Helps in studying the impact of specific events on time-dependent variables.
- Data Aggregation: Allows for easy grouping and summarizing of data by various time periods (e.g., daily, monthly, yearly).
- Cross-Dataset Comparison: Enables alignment and comparison of multiple datasets based on timestamps.

### Timestamp
A Timestamp object represents a single point in time. It's similar to Python's datetime, but with additional features tailored for use in Pandas.

In [1]:
import pandas as pd
import numpy as np
# Creating a DatetimeIndex
dates = pd.date_range(start='2023-01-01', end='2023-01-10', freq='D')
s = pd.Series(np.random.randn(len(dates)), index=dates)
s

2023-01-01   -0.033687
2023-01-02    2.058856
2023-01-03    0.497618
2023-01-04    0.275689
2023-01-05   -2.087098
2023-01-06    0.104571
2023-01-07    0.167499
2023-01-08    0.451981
2023-01-09   -0.907400
2023-01-10    0.301545
Freq: D, dtype: float64

In [2]:
# Creating a Timestamp
ts = pd.Timestamp('2023-06-15 14:30:00')
ts

Timestamp('2023-06-15 14:30:00')

In [3]:
# Accessing attributes
ts.year

2023

In [4]:
ts.month

6

In [5]:
ts.day

15

In [6]:
ts.hour

14

In [7]:
ts.minute

30

In [ ]:
ts.second

These attributes allow you to easily extract specific components of the date and time.

Timestamps can also include timezone information. This is particularly useful when working with data from different regions or when performing calculations across time zones:

In [8]:
# Creating Timestamp with timezone
ts_tz = pd.Timestamp('2023-06-15 14:30:00', tz='UTC')
ts_tz

Timestamp('2023-06-15 14:30:00+0000', tz='UTC')

### DatetimeIndex

A DatetimeIndex is an Index object that contains Timestamp objects. It's commonly used as the index for time series data in Pandas, allowing for powerful time-based operations.

In [11]:
# Creating a DatetimeIndex
dates = pd.date_range(start='2023-01-01', periods=10, freq='ME')
dates

DatetimeIndex(['2023-01-31', '2023-02-28', '2023-03-31', '2023-04-30',
               '2023-05-31', '2023-06-30', '2023-07-31', '2023-08-31',
               '2023-09-30', '2023-10-31'],
              dtype='datetime64[ns]', freq='ME')

In [13]:
# Creating a Series with DatetimeIndex as an Index
s = pd.Series(range(10), index=dates)
s

2023-01-31    0
2023-02-28    1
2023-03-31    2
2023-04-30    3
2023-05-31    4
2023-06-30    5
2023-07-31    6
2023-08-31    7
2023-09-30    8
2023-10-31    9
Freq: ME, dtype: int64

In [16]:
# Selecting data using DatetimeIndex
s['2023-06-30']  # Select a single date

np.int64(5)

In [17]:
s['2023-02-28':'2023-08-31']  # Select a range of dates

2023-02-28    1
2023-03-31    2
2023-04-30    3
2023-05-31    4
2023-06-30    5
2023-07-31    6
2023-08-31    7
Freq: ME, dtype: int64

DatetimeIndex also enables powerful resampling operations. For example, we can easily aggregate our daily data into 4-Month End periods: (or (MS))

In [ ]:
# Resampling with DatetimeIndex  ????
s.resample('4ME').sum()

2023-01-31     0
2023-05-31    10
2023-09-30    26
2024-01-31     9
Freq: 4ME, dtype: int64

### Timedelta and TimedeltaIndex
Timedelta represents a duration or difference between two dates or times. It's useful for performing date arithmetic and representing time spans.

In [21]:
# Creating a Timedelta
td = pd.Timedelta(days=2, hours=3, minutes=30)
td

Timedelta('2 days 03:30:00')

In [23]:
# Arithmetic with Timestamps
ts = pd.Timestamp('2023-06-15 14:30:00')
ts
#ts + td

Timestamp('2023-06-15 14:30:00')

In [24]:
ts + td

Timestamp('2023-06-17 18:00:00')

Above calculation adds our Timedelta to the Timestamp, giving us a new Timestamp 2 days, 3 hours, and 30 minutes later.

A `TimedeltaIndex` is an Index of Timedelta objects, useful for representing sequences of durations:

In [25]:
# Creating a TimedeltaIndex
tdi = pd.timedelta_range(start='1 day', end='5 days', freq='D')
tdi

TimedeltaIndex(['1 days', '2 days', '3 days', '4 days', '5 days'], dtype='timedelta64[ns]', freq='D')

In [26]:
# Creating a Series with TimedeltaIndex
s_td = pd.Series(range(5), index=tdi)
s_td

1 days    0
2 days    1
3 days    2
4 days    3
5 days    4
Freq: D, dtype: int64

In [27]:
# Selecting data using TimedeltaIndex
s_td['2 days':'4 days']

2 days    1
3 days    2
4 days    3
Freq: D, dtype: int64

This selects all data points with durations between 2 and 4 days.

Timedelta and TimedeltaIndex are particularly useful in scenarios where you're interested in time differences rather than absolute dates. For example, in financial applications for calculating time to maturity, or in project management for tracking task durations.

Here's a practical example combining these concepts:

In [28]:
# Example: Calculating time differences
dates = pd.date_range(start='2023-01-01', periods=5, freq='D')
df = pd.DataFrame({'Date': dates, 'Value': range(5)})
df['TimeSinceStart'] = df['Date'] - df['Date'].min()
df

        Date  Value TimeSinceStart
0 2023-01-01      0         0 days
1 2023-01-02      1         1 days
2 2023-01-03      2         2 days
3 2023-01-04      3         3 days
4 2023-01-05      4         4 days

In this example, we create a DataFrame with a date column and a value column. We then calculate a new column 'TimeSinceStart' which shows the duration since the start date for each row. This demonstrates how Timedelta can be used to compute time differences within a dataset.

These datetime data types form the foundation for working with time series data in Pandas. They allow for intuitive representation of dates, times, and time periods, and enable powerful time-based operations and analyses. As you work more with time series data, you'll find these types invaluable for various data manipulation and analysis tasks.

### Creating Datetime Objects
Pandas provides several methods for creating datetime objects, which are essential for working with time series data. Let's explore the main approaches: using to_datetime(), date_range(), and specifying frequencies.

#### Using to_datetime()
The to_datetime() function is a versatile tool for converting various input formats into Pandas datetime objects. It can handle strings, numbers, and even mixed-type data.

In [29]:
# Converting a string to datetime
date_str = '2023-06-15'
pd.to_datetime(date_str)

Timestamp('2023-06-15 00:00:00')

In [30]:
# Converting multiple strings with different formats
date_strings = ['2023-06-15', '20230616', '06/17/2023']
pd.to_datetime(date_strings, format="mixed")

DatetimeIndex(['2023-06-15', '2023-06-16', '2023-06-17'], dtype='datetime64[ns]', freq=None)

Here, `to_datetime()` automatically detects and parses different date formats. This is particularly useful when dealing with inconsistent date representations in your data.

In [ ]:
# Specifying a custom format - The format parameter uses strftime-style formatting codes to specify the input format.
custom_date = '15-Jun-2023'
pd.to_datetime(custom_date, format='%d-%b-%Y')

Timestamp('2023-06-15 00:00:00')

`to_datetime()` can also handle timestamps and epoch times: Below code converts a Unix timestamp (seconds since January 1, 1970) to a Pandas Timestamp.

In [32]:
# Converting Unix timestamp
pd.to_datetime(1623766800, unit='s')

Timestamp('2021-06-15 14:20:00')

#### Using `date_range()`
While `to_datetime()` is great for converting existing data, `date_range()` is used to generate sequences of dates or timestamps. This is particularly useful for creating DatetimeIndex objects or generating date-based data. By default, date_range() uses a daily frequency.

Let's start with a basic example:

In [33]:
# Creating a date range for a month
pd.date_range(start='2023-01-01', end='2023-01-31')

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

#### Specifying frequency
Both `date_range()` and `to_datetime()` allow you to specify the frequency of the timestamps. Pandas uses frequency aliases to represent different time intervals.

Let's look at some examples with `date_range()`:

In [ ]:
# Creating a range of business  - Skipping Weekends
pd.date_range(start='2023-01-01', periods=5, freq='B')

DatetimeIndex(['2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05',
               '2023-01-06'],
              dtype='datetime64[ns]', freq='B')

In [35]:
# Creating a range of hourly timestamps
pd.date_range(start='2023-01-01', periods=24, freq='h')

DatetimeIndex(['2023-01-01 00:00:00', '2023-01-01 01:00:00',
               '2023-01-01 02:00:00', '2023-01-01 03:00:00',
               '2023-01-01 04:00:00', '2023-01-01 05:00:00',
               '2023-01-01 06:00:00', '2023-01-01 07:00:00',
               '2023-01-01 08:00:00', '2023-01-01 09:00:00',
               '2023-01-01 10:00:00', '2023-01-01 11:00:00',
               '2023-01-01 12:00:00', '2023-01-01 13:00:00',
               '2023-01-01 14:00:00', '2023-01-01 15:00:00',
               '2023-01-01 16:00:00', '2023-01-01 17:00:00',
               '2023-01-01 18:00:00', '2023-01-01 19:00:00',
               '2023-01-01 20:00:00', '2023-01-01 21:00:00',
               '2023-01-01 22:00:00', '2023-01-01 23:00:00'],
              dtype='datetime64[ns]', freq='h')

In [36]:
# Every 2 weeks on Monday
pd.date_range(start='2023-01-01', periods=5, freq='2W-MON') # Each date two weeks apart but landing on a Monday

DatetimeIndex(['2023-01-02', '2023-01-16', '2023-01-30', '2023-02-13',
               '2023-02-27'],
              dtype='datetime64[ns]', freq='2W-MON')

Here are some common frequency aliases:

* 'D': Calendar day
* 'B': Business day
* 'W': Weekly
* 'ME': Month end
* 'QE': Quarter end
* 'YE': Year end
* 'h': Hourly
* 't': Minutely
* 's': Secondly

### Date and Time Components
When working with datetime data in Pandas, it's often necessary to access or extract specific components of dates and times. Pandas provides convenient methods to access these components and create new columns based on them.

#### Accessing Components (year, month, day, etc.)
Pandas datetime objects (whether in a Series or DatetimeIndex) have attributes for accessing various date and time components. Let's explore these using a sample DataFrame:

In [38]:
# Create a sample DataFrame with a date range
dates = pd.date_range(start='2023-01-01', periods=10, freq='D')
df = pd.DataFrame({'date': dates, 'value': np.random.rand(10)})
df

        date     value
0 2023-01-01  0.511342
1 2023-01-02  0.434722
2 2023-01-03  0.424444
3 2023-01-04  0.482944
4 2023-01-05  0.412434
5 2023-01-06  0.760705
6 2023-01-07  0.226020
7 2023-01-08  0.351055
8 2023-01-09  0.750183
9 2023-01-10  0.638831

Now, let's access various components of the 'date' column:

In [39]:
# Accessing year
df['date'].dt.year

0    2023
1    2023
2    2023
3    2023
4    2023
5    2023
6    2023
7    2023
8    2023
9    2023
Name: date, dtype: int32

In [40]:
# Accessing month
df['date'].dt.month

0    1
1    1
2    1
3    1
4    1
5    1
6    1
7    1
8    1
9    1
Name: date, dtype: int32

In [41]:
# Accessing day
df['date'].dt.day

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: date, dtype: int32

In [42]:
# Accessing day name
df['date'].dt.day_name()

0       Sunday
1       Monday
2      Tuesday
3    Wednesday
4     Thursday
5       Friday
6     Saturday
7       Sunday
8       Monday
9      Tuesday
Name: date, dtype: object

In [43]:
# Accessing day of week (0 is Monday, 6 is Sunday)
df['date'].dt.dayofweek

0    6
1    0
2    1
3    2
4    3
5    4
6    5
7    6
8    0
9    1
Name: date, dtype: int32

In [44]:
# Accessing quarter
df['date'].dt.quarter

0    1
1    1
2    1
3    1
4    1
5    1
6    1
7    1
8    1
9    1
Name: date, dtype: int32

In [45]:
# Create a DataFrame with datetime including time
datetimes = pd.date_range(start='2023-01-01 00:00:00', periods=10, freq='h')
df_time = pd.DataFrame({'datetime': datetimes, 'value': np.random.rand(10)})
df_time

             datetime     value
0 2023-01-01 00:00:00  0.873858
1 2023-01-01 01:00:00  0.740337
2 2023-01-01 02:00:00  0.881175
3 2023-01-01 03:00:00  0.042230
4 2023-01-01 04:00:00  0.448638
5 2023-01-01 05:00:00  0.613023
6 2023-01-01 06:00:00  0.001353
7 2023-01-01 07:00:00  0.919890
8 2023-01-01 08:00:00  0.205446
9 2023-01-01 09:00:00  0.253351

In [46]:

# Accessing hour
df_time['datetime'].dt.hour

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
Name: datetime, dtype: int32

In [47]:
# Accessing minute
df_time['datetime'].dt.minute

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
9    0
Name: datetime, dtype: int32

In [48]:
# Accessing second
df_time['datetime'].dt.second

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
9    0
Name: datetime, dtype: int32

### Extracting Components to New Columns
Often, you'll want to create new columns in your DataFrame based on these datetime components. This is useful for grouping, filtering, or analyzing data based on specific time periods.

Let's extend our original DataFrame with new columns for various date components:

In [49]:
# Adding year, month, and day columns
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day
df['day_name'] = df['date'].dt.day_name()
df['day_of_week'] = df['date'].dt.dayofweek
df['quarter'] = df['date'].dt.quarter

df

        date     value  year  month  day   day_name  day_of_week  quarter
0 2023-01-01  0.511342  2023      1    1     Sunday            6        1
1 2023-01-02  0.434722  2023      1    2     Monday            0        1
2 2023-01-03  0.424444  2023      1    3    Tuesday            1        1
3 2023-01-04  0.482944  2023      1    4  Wednesday            2        1
4 2023-01-05  0.412434  2023      1    5   Thursday            3        1
5 2023-01-06  0.760705  2023      1    6     Friday            4        1
6 2023-01-07  0.226020  2023      1    7   Saturday            5        1
7 2023-01-08  0.351055  2023      1    8     Sunday            6        1
8 2023-01-09  0.750183  2023      1    9     Monday            0        1
9 2023-01-10  0.638831  2023      1   10    Tuesday            1        1

In [51]:

# Filter for January data
january_data = df[df['day_name'] != 'Thursday']
january_data

        date     value  year  month  day   day_name  day_of_week  quarter
0 2023-01-01  0.511342  2023      1    1     Sunday            6        1
1 2023-01-02  0.434722  2023      1    2     Monday            0        1
2 2023-01-03  0.424444  2023      1    3    Tuesday            1        1
3 2023-01-04  0.482944  2023      1    4  Wednesday            2        1
5 2023-01-06  0.760705  2023      1    6     Friday            4        1
6 2023-01-07  0.226020  2023      1    7   Saturday            5        1
7 2023-01-08  0.351055  2023      1    8     Sunday            6        1
8 2023-01-09  0.750183  2023      1    9     Monday            0        1
9 2023-01-10  0.638831  2023      1   10    Tuesday            1        1

In [52]:
# Calculate mean value by day of week
df.groupby('day_name')['value'].mean().sort_values(ascending=False)

day_name
Friday       0.760705
Monday       0.592453
Tuesday      0.531637
Wednesday    0.482944
Sunday       0.431198
Thursday     0.412434
Saturday     0.226020
Name: value, dtype: float64

In [53]:
# Adding hour and minute columns
df_time['hour'] = df_time['datetime'].dt.hour
df_time['minute'] = df_time['datetime'].dt.minute

df_time

             datetime     value  hour  minute
0 2023-01-01 00:00:00  0.873858     0       0
1 2023-01-01 01:00:00  0.740337     1       0
2 2023-01-01 02:00:00  0.881175     2       0
3 2023-01-01 03:00:00  0.042230     3       0
4 2023-01-01 04:00:00  0.448638     4       0
5 2023-01-01 05:00:00  0.613023     5       0
6 2023-01-01 06:00:00  0.001353     6       0
7 2023-01-01 07:00:00  0.919890     7       0
8 2023-01-01 08:00:00  0.205446     8       0
9 2023-01-01 09:00:00  0.253351     9       0

In [54]:
# Calculate mean value by hour
df_time.groupby('hour')['value']

In [55]:
# Calculate mean value by hour
df_time.groupby('hour')['value'].mean()

hour
0    0.873858
1    0.740337
2    0.881175
3    0.042230
4    0.448638
5    0.613023
6    0.001353
7    0.919890
8    0.205446
9    0.253351
Name: value, dtype: float64

Extracting date and time components to separate columns can significantly simplify many common data analysis tasks. It allows you to easily group, filter, and aggregate your data based on various time periods, which is crucial in many time series analysis scenarios.

Remember that creating these additional columns increases memory usage, so it's a trade-off between convenience and efficiency. In some cases, it might be more efficient to use the dt accessor directly in your operations rather than creating new columns, especially for large datasets.

By mastering these techniques for accessing and extracting date and time components, you'll be well-equipped to handle a wide range of time series analysis tasks in Pandas.

### Datetime Indexing and Slicing
When working with time series data in Pandas, efficient indexing and slicing are crucial for data analysis and manipulation. Pandas provides powerful tools for selecting data based on dates and times, including partial string indexing and accessing specific date and time components.

In [57]:
# Create a DataFrame with a DatetimeIndex
dates = pd.date_range(start='2023-01-01', end='2023-12-31', freq='D')
len(dates)

365

In [56]:
# Create a DataFrame with a DatetimeIndex
dates = pd.date_range(start='2023-01-01', end='2023-12-31', freq='D')
df = pd.DataFrame({'value': np.random.randn(len(dates))}, index=dates)
df

               value
2023-01-01 -2.406152
2023-01-02  1.777739
2023-01-03  0.355194
2023-01-04 -0.280677
2023-01-05  0.057345
...              ...
2023-12-27  0.471638
2023-12-28  0.263644
2023-12-29 -1.249552
2023-12-30 -1.250628
2023-12-31 -1.313732

[365 rows x 1 columns]

### Partial string indexing
Partial string indexing is a powerful feature in Pandas that allows you to select data using incomplete date string labels. This is particularly useful when you want to select data for specific time periods without specifying the full date.

In [58]:
# Select all data for January 2023
df.loc['2023-01']

               value
2023-01-01 -2.406152
2023-01-02  1.777739
2023-01-03  0.355194
2023-01-04 -0.280677
2023-01-05  0.057345
2023-01-06 -0.651562
2023-01-07 -0.047594
2023-01-08  1.566391
2023-01-09 -1.355957
2023-01-10 -0.721013
2023-01-11  0.958765
2023-01-12 -0.786804
2023-01-13 -1.427732
2023-01-14 -1.614637
2023-01-15  0.866399
2023-01-16  0.051742
2023-01-17 -0.159695
2023-01-18  1.195631
2023-01-19  1.575803
2023-01-20 -0.472837
2023-01-21 -1.194193
2023-01-22 -1.657746
2023-01-23  0.235385
2023-01-24 -0.840445
2023-01-25 -0.306508
2023-01-26 -2.504504
2023-01-27 -0.029817
2023-01-28  0.864095
2023-01-29  1.600351
2023-01-30 -1.159827
2023-01-31 -1.264451

In [59]:
# Select data for the first quarter of 2023
df.loc['2023-01':'2023-03']

               value
2023-01-01 -2.406152
2023-01-02  1.777739
2023-01-03  0.355194
2023-01-04 -0.280677
2023-01-05  0.057345
...              ...
2023-03-27 -0.040314
2023-03-28  0.125690
2023-03-29 -0.182569
2023-03-30 -0.000014
2023-03-31 -0.277101

[90 rows x 1 columns]

In [60]:
# Select data for a specific day
df.loc['2023-01-04']

value   -0.280677
Name: 2023-01-04 00:00:00, dtype: float64

In [61]:
# Select data from a specific date to the end of the dataset
df.loc['2023-07-01':]

               value
2023-07-01 -1.476844
2023-07-02  0.650633
2023-07-03  1.180773
2023-07-04 -0.614881
2023-07-05  0.474239
...              ...
2023-12-27  0.471638
2023-12-28  0.263644
2023-12-29 -1.249552
2023-12-30 -1.250628
2023-12-31 -1.313732

[184 rows x 1 columns]

In [62]:

# Select data up to a specific date
df.loc[:'2023-03-31']

               value
2023-01-01 -2.406152
2023-01-02  1.777739
2023-01-03  0.355194
2023-01-04 -0.280677
2023-01-05  0.057345
...              ...
2023-03-27 -0.040314
2023-03-28  0.125690
2023-03-29 -0.182569
2023-03-30 -0.000014
2023-03-31 -0.277101

[90 rows x 1 columns]

In [63]:
# Select all data for June
df.loc['2023-06']

               value
2023-06-01 -1.272092
2023-06-02 -1.556038
2023-06-03  0.969443
2023-06-04  2.395686
2023-06-05  1.548075
2023-06-06 -0.596820
2023-06-07 -0.333172
2023-06-08  0.396779
2023-06-09 -0.930810
2023-06-10 -0.435937
2023-06-11  0.666268
2023-06-12 -0.403850
2023-06-13  1.167621
2023-06-14  0.201323
2023-06-15 -1.664206
2023-06-16  1.224521
2023-06-17  0.541946
2023-06-18 -0.133194
2023-06-19 -0.159398
2023-06-20  1.666140
2023-06-21 -0.458293
2023-06-22  0.496115
2023-06-23 -1.740334
2023-06-24 -0.221602
2023-06-25 -0.359313
2023-06-26  0.097126
2023-06-27  0.685993
2023-06-28  0.324474
2023-06-29  0.115239
2023-06-30  1.039558

In [64]:
# Select data for the first half of the year
df.loc['2023-01':'2023-06']

               value
2023-01-01 -2.406152
2023-01-02  1.777739
2023-01-03  0.355194
2023-01-04 -0.280677
2023-01-05  0.057345
...              ...
2023-06-26  0.097126
2023-06-27  0.685993
2023-06-28  0.324474
2023-06-29  0.115239
2023-06-30  1.039558

[181 rows x 1 columns]

In [65]:
# Create a DataFrame with hourly data for a day
hourly_dates = pd.date_range(start='2023-06-15 00:00:00', end='2023-06-15 23:59:59', freq='h')
df_hourly = pd.DataFrame({'value': np.random.randn(len(hourly_dates))}, index=hourly_dates)
df_hourly

                        value
2023-06-15 00:00:00 -0.451547
2023-06-15 01:00:00 -1.675765
2023-06-15 02:00:00 -2.436040
2023-06-15 03:00:00 -0.952073
2023-06-15 04:00:00  1.021116
2023-06-15 05:00:00 -1.110048
2023-06-15 06:00:00  1.038864
2023-06-15 07:00:00 -0.607134
2023-06-15 08:00:00  0.672482
2023-06-15 09:00:00  1.723245
2023-06-15 10:00:00 -0.096096
2023-06-15 11:00:00 -0.812101
2023-06-15 12:00:00 -1.315183
2023-06-15 13:00:00 -0.039654
2023-06-15 14:00:00 -0.071643
2023-06-15 15:00:00 -0.612594
2023-06-15 16:00:00  0.734482
2023-06-15 17:00:00 -0.568022
2023-06-15 18:00:00  0.639625
2023-06-15 19:00:00 -0.488253
2023-06-15 20:00:00 -0.765772
2023-06-15 21:00:00  1.420160
2023-06-15 22:00:00  0.574813
2023-06-15 23:00:00  0.637852

In [66]:

# Select data for a specific hour
df_hourly.loc['2023-06-15 14:00:00']

value   -0.071643
Name: 2023-06-15 14:00:00, dtype: float64

In [67]:
# Select data for a range of hours
df_hourly.loc['2023-06-15 08:00:00':'2023-06-15 16:00:00']

                        value
2023-06-15 08:00:00  0.672482
2023-06-15 09:00:00  1.723245
2023-06-15 10:00:00 -0.096096
2023-06-15 11:00:00 -0.812101
2023-06-15 12:00:00 -1.315183
2023-06-15 13:00:00 -0.039654
2023-06-15 14:00:00 -0.071643
2023-06-15 15:00:00 -0.612594
2023-06-15 16:00:00  0.734482

### Date and time components access
In addition to partial string indexing, Pandas allows you to select data based on specific components of dates and times. This is done using the `dt` accessor along with various date and time attributes.

In [68]:
# Select all Mondays
df[df.index.day_name() == 'Monday']

               value
2023-01-02  1.777739
2023-01-09 -1.355957
2023-01-16  0.051742
2023-01-23  0.235385
2023-01-30 -1.159827
2023-02-06 -1.683358
2023-02-13  1.286919
2023-02-20  1.170473
2023-02-27 -0.576221
2023-03-06 -0.377474
2023-03-13  0.572674
2023-03-20  0.532171
2023-03-27 -0.040314
2023-04-03  0.454502
2023-04-10 -2.421093
2023-04-17  0.377425
2023-04-24  0.791389
2023-05-01 -0.288007
2023-05-08 -0.206352
2023-05-15  1.202957
2023-05-22  0.659287
2023-05-29 -0.852625
2023-06-05  1.548075
2023-06-12 -0.403850
2023-06-19 -0.159398
2023-06-26  0.097126
2023-07-03  1.180773
2023-07-10 -0.618041
2023-07-17 -0.454763
2023-07-24  0.679571
2023-07-31  0.686518
2023-08-07 -0.653535
2023-08-14  1.436603
2023-08-21 -1.970381
2023-08-28  2.611135
2023-09-04  0.441859
2023-09-11 -0.170352
2023-09-18  0.993394
2023-09-25 -0.398400
2023-10-02 -0.038672
2023-10-09  0.728459
2023-10-16 -0.866168
2023-10-23  0.913171
2023-10-30 -0.824375
2023-11-06 -2.286610
2023-11-13  2.217763
2023-11-20 -1.523891
2023-11-27 -0.367613
2023-12-04  2.241343
2023-12-11  0.291150
2023-12-18 -0.982937
2023-12-25 -1.215730

In [69]:
# Select all days in March
df[df.index.month == 3]

               value
2023-03-01  0.691002
2023-03-02 -0.246287
2023-03-03 -0.548883
2023-03-04 -0.447274
2023-03-05  0.524180
2023-03-06 -0.377474
2023-03-07  0.047177
2023-03-08 -1.082450
2023-03-09 -0.829588
2023-03-10  0.742621
2023-03-11  0.092449
2023-03-12  1.199522
2023-03-13  0.572674
2023-03-14 -1.504628
2023-03-15 -0.173681
2023-03-16 -0.798927
2023-03-17  0.338481
2023-03-18  1.171046
2023-03-19 -0.228166
2023-03-20  0.532171
2023-03-21 -1.138930
2023-03-22 -1.575182
2023-03-23  0.664167
2023-03-24 -1.468683
2023-03-25 -0.032823
2023-03-26 -2.107695
2023-03-27 -0.040314
2023-03-28  0.125690
2023-03-29 -0.182569
2023-03-30 -0.000014
2023-03-31 -0.277101

In [70]:
# Select all Fridays in the second quarter
df[(df.index.day_name() == 'Friday') & (df.index.quarter == 2)]

               value
2023-04-07  1.010547
2023-04-14 -0.253118
2023-04-21  1.022498
2023-04-28  1.176360
2023-05-05 -0.235914
2023-05-12  1.236865
2023-05-19  0.280686
2023-05-26  1.372602
2023-06-02 -1.556038
2023-06-09 -0.930810
2023-06-16  1.224521
2023-06-23 -1.740334
2023-06-30  1.039558

In [71]:

# Select all data points where the day of the month is greater than 15
df[df.index.day > 15]

               value
2023-01-16  0.051742
2023-01-17 -0.159695
2023-01-18  1.195631
2023-01-19  1.575803
2023-01-20 -0.472837
...              ...
2023-12-27  0.471638
2023-12-28  0.263644
2023-12-29 -1.249552
2023-12-30 -1.250628
2023-12-31 -1.313732

[185 rows x 1 columns]

In [72]:
# Select all data points between 9 AM and 5 PM
df_hourly[(df_hourly.index.hour >= 9) & (df_hourly.index.hour <= 17)]

                        value
2023-06-15 09:00:00  1.723245
2023-06-15 10:00:00 -0.096096
2023-06-15 11:00:00 -0.812101
2023-06-15 12:00:00 -1.315183
2023-06-15 13:00:00 -0.039654
2023-06-15 14:00:00 -0.071643
2023-06-15 15:00:00 -0.612594
2023-06-15 16:00:00  0.734482
2023-06-15 17:00:00 -0.568022

In [73]:
# Select all data points in the morning (before noon)
df_hourly[df_hourly.index.hour < 12]

                        value
2023-06-15 00:00:00 -0.451547
2023-06-15 01:00:00 -1.675765
2023-06-15 02:00:00 -2.436040
2023-06-15 03:00:00 -0.952073
2023-06-15 04:00:00  1.021116
2023-06-15 05:00:00 -1.110048
2023-06-15 06:00:00  1.038864
2023-06-15 07:00:00 -0.607134
2023-06-15 08:00:00  0.672482
2023-06-15 09:00:00  1.723245
2023-06-15 10:00:00 -0.096096
2023-06-15 11:00:00 -0.812101

In [74]:
# Select all Mondays in June where the value is positive
june_mondays_positive = df[(df.index.month == 6) & (df.index.day_name() == 'Monday') & (df['value'] > 0)]
june_mondays_positive

               value
2023-06-05  1.548075
2023-06-26  0.097126

Here's a more complex example that combines several concepts:

In [ ]:
# Select the highest value for each month
monthly_max = df.resample('ME')

monthly_max.max()

               value
2023-01-31  1.777739
2023-02-28  1.709732
2023-03-31  1.199522
2023-04-30  2.016830
2023-05-31  1.407905
2023-06-30  2.395686
2023-07-31  1.458392
2023-08-31  2.611135
2023-09-30  3.131747
2023-10-31  1.888953
2023-11-30  2.442554
2023-12-31  2.241343

In [75]:
# Select the highest value for each month
monthly_max = df.resample('ME').max()
# Find the day of the week with the highest average value
day_of_week_avg = df.groupby(df.index.day_name())['value'].mean().sort_values(ascending=False)
print("Monthly maximum values:")
monthly_max

Monthly maximum values:

               value
2023-01-31  1.777739
2023-02-28  1.709732
2023-03-31  1.199522
2023-04-30  2.016830
2023-05-31  1.407905
2023-06-30  2.395686
2023-07-31  1.458392
2023-08-31  2.611135
2023-09-30  3.131747
2023-10-31  1.888953
2023-11-30  2.442554
2023-12-31  2.241343

In [78]:
print("\nAverage value by day of week:")
day_of_week_avg

Average value by day of week:

Wednesday    0.210602
Monday       0.063147
Sunday       0.052935
Saturday    -0.020529
Tuesday     -0.037604
Friday      -0.063308
Thursday    -0.321509
Name: value, dtype: float64

### Parsing and Formatting Dates
Working with dates in Pandas often involves converting between string representations and datetime objects. This process includes parsing strings into dates and formatting dates back into strings. Mastering these techniques is crucial for data cleaning, integration, and presentation.

#### Parsing Strings to Dates
Pandas provides powerful tools for converting string representations of dates into datetime objects. The primary function for this task is `pd.to_datetime()`.

In [79]:
# Basic date parsing
date_str = '2023-06-15'
pd.to_datetime(date_str)

Timestamp('2023-06-15 00:00:00')

In [80]:
# Parsing different date formats
dates = ['2023-06-15', '15/06/2023', 'June 15, 2023', '20230615']
pd.to_datetime(dates, format="mixed")

DatetimeIndex(['2023-06-15', '2023-06-15', '2023-06-15', '2023-06-15'], dtype='datetime64[ns]', freq=None)

In [81]:
# Specifying format explicitly
custom_date = '15-Jun-2023'
pd.to_datetime(custom_date, format='%d-%b-%Y')

Timestamp('2023-06-15 00:00:00')

The format parameter uses strftime-style codes to specify the input format. Here are some common format codes:

* %Y: Year with century (e.g., 2023)
* %m: Month as a zero-padded decimal number (01-12)
* %d: Day of the month as a zero-padded decimal number (01-31)
* %H: Hour (00-23)
* %M: Minute (00-59)
* %S: Second (00-59)
* %b: Month as locale's abbreviated name (e.g., Jan, Feb)

In [82]:
# Parsing dates with time
datetime_strings = ['2023-06-15 14:30:00', '2023-06-16 09:45:30']
pd.to_datetime(datetime_strings)

DatetimeIndex(['2023-06-15 14:30:00', '2023-06-16 09:45:30'], dtype='datetime64[ns]', freq=None)

When working with a DataFrame, you can parse an entire column of date strings:

In [83]:
# Create a DataFrame with date strings
df = pd.DataFrame({
    'date_string': ['2023-06-15', '2023-06-16', '2023-06-17'],
    'value': [10, 20, 30]
})

# Parse the date_string column
df['date'] = pd.to_datetime(df['date_string'])
df

  date_string  value       date
0  2023-06-15     10 2023-06-15
1  2023-06-16     20 2023-06-16
2  2023-06-17     30 2023-06-17

In [84]:
df['date']

0   2023-06-15
1   2023-06-16
2   2023-06-17
Name: date, dtype: datetime64[ns]

### Formatting Dates as Strings
Once you have datetime objects, you might need to convert them back to strings in a specific format. This is often necessary for data presentation or when integrating with other systems that expect dates in a particular string format.

The primary method for this is the `dt.strftime()` method, which is available on Series containing datetime data.

In [86]:
dates = pd.date_range(start='2023-06-15', periods=3)
s = pd.Series(dates)
s

0   2023-06-15
1   2023-06-16
2   2023-06-17
dtype: datetime64[ns]

In [85]:
# Create a Series of dates
dates = pd.date_range(start='2023-06-15', periods=3)
s = pd.Series(dates)

# Format dates as strings
s.dt.strftime('%Y-%m-%d')

0    2023-06-15
1    2023-06-16
2    2023-06-17
dtype: object

In [87]:
# More complex formatting
s.dt.strftime('%A, %B %d, %Y')

0    Thursday, June 15, 2023
1      Friday, June 16, 2023
2    Saturday, June 17, 2023
dtype: object

Here are some additional format codes:

* %A: Full weekday name
* %B: Full month name
* %I: Hour (12-hour clock)
* %p: Locale's equivalent of AM or PM

In [88]:
# Create a DataFrame with a datetime column
df = pd.DataFrame({
    'date': pd.date_range(start='2023-06-15', periods=3),
    'value': [10, 20, 30]
})

# Format the date column
df['formatted_date'] = df['date'].dt.strftime('%Y-%m-%d %H:%M:%S')
df

        date  value       formatted_date
0 2023-06-15     10  2023-06-15 00:00:00
1 2023-06-16     20  2023-06-16 00:00:00
2 2023-06-17     30  2023-06-17 00:00:00

In [89]:
# Formatting dates in French
df['date_fr'] = df['date'].dt.strftime('%A %d %B %Y')
df['date_fr']

0    Thursday 15 June 2023
1      Friday 16 June 2023
2    Saturday 17 June 2023
Name: date_fr, dtype: object

In [ ]:
import locale
# Set locale to French
#locale.setlocale(locale.LC_TIME, 'fr_FR.UTF-8')

Error: unsupported locale setting

## Categorical Data
Pandas provides a special data type called Categorical to efficiently store and manipulate categorical data. Using the Categorical data type offers several advantages:

* Memory efficiency: For datasets with many repeated values, categorical data can significantly reduce memory usage.
* Performance: Many operations on categorical data are faster than on object dtype or strings.
* Convenience: Categorical data provides built-in methods for common operations like reordering or grouping.
  
In this lecture, we'll explore how to create, manipulate, and analyze categorical data in Pandas. We'll cover various techniques for working with categories, including:

- Creating and converting categorical data
- Accessing and modifying categories
- Sorting and comparing categorical data
- Encoding categorical variables for machine learning
- Grouping, aggregating, and visualizing categorical data

In [91]:
import pandas as pd
import numpy as np
# Create a sample DataFrame with categorical data
df = pd.DataFrame({
    'ID': range(1, 11),
    'Color': ['Red', 'Blue', 'Green', 'Red', 'Green', 'Blue', 'Red', 'Green', 'Blue', 'Red'],
    'Size': ['Small', 'Medium', 'Large', 'Medium', 'Small', 'Large', 'Medium', 'Small', 'Large', 'Medium'],
    'Rating': ['Good', 'Excellent', 'Fair', 'Good', 'Excellent', 'Fair', 'Good', 'Fair', 'Excellent', 'Good']
})

df

   ID  Color    Size     Rating
0   1    Red   Small       Good
1   2   Blue  Medium  Excellent
2   3  Green   Large       Fair
3   4    Red  Medium       Good
4   5  Green   Small  Excellent
5   6   Blue   Large       Fair
6   7    Red  Medium       Good
7   8  Green   Small       Fair
8   9   Blue   Large  Excellent
9  10    Red  Medium       Good

In [92]:
df.dtypes

ID         int64
Color     object
Size      object
Rating    object
dtype: object

In this example, 'Color', 'Size', and 'Rating' are categorical variables. By default, Pandas stores these as object dtype, but we can convert them to Categorical for more efficient processing and additional functionality.

In [93]:
# Convert columns to categorical
df['Color'] = pd.Categorical(df['Color'])
df['Size'] = pd.Categorical(df['Size'], categories=['Small', 'Medium', 'Large'], ordered=True)
df['Rating'] = pd.Categorical(df['Rating'], categories=['Fair', 'Good', 'Excellent'], ordered=True)

df

   ID  Color    Size     Rating
0   1    Red   Small       Good
1   2   Blue  Medium  Excellent
2   3  Green   Large       Fair
3   4    Red  Medium       Good
4   5  Green   Small  Excellent
5   6   Blue   Large       Fair
6   7    Red  Medium       Good
7   8  Green   Small       Fair
8   9   Blue   Large  Excellent
9  10    Red  Medium       Good

In [94]:
# Display DataFrame info
df.dtypes

ID           int64
Color     category
Size      category
Rating    category
dtype: object

### Creating and Converting Categorical Data
Pandas offers multiple ways to create and convert categorical data. Let's explore these methods in detail.

#### Creating Categorical Data from Scratch
You can create categorical data directly using the `pd.Categorical()` function:

In [95]:
# Create a categorical Series from scratch
colors = pd.Categorical(['Red', 'Blue', 'Green', 'Red', 'Green'])
colors

['Red', 'Blue', 'Green', 'Red', 'Green']
Categories (3, object): ['Blue', 'Green', 'Red']

In [ ]:
# Create a categorical Series with specified categories
sizes = pd.Categorical(['Medium', 'Large', 'Small', 'Medium', 'Small'], categories=['Small', 'Medium', 'Large'])
sizes

['Medium', 'Large', 'Small', 'Medium', 'Small']
Categories (3, object): ['Small', 'Medium', 'Large']

In [97]:
# Create an ordered categorical Series
ratings = pd.Categorical(['Fair', 'Good', 'Excellent', 'Good', 'Fair'],  categories=['Poor', 'Fair', 'Good', 'Excellent'], ordered=True)
ratings

['Fair', 'Good', 'Excellent', 'Good', 'Fair']
Categories (4, object): ['Poor' < 'Fair' < 'Good' < 'Excellent']

### Converting Existing Columns to Categorical

In [98]:
# Create a sample DataFrame
df = pd.DataFrame({
    'Color': ['Red', 'Blue', 'Green', 'Red', 'Green'],
    'Size': ['Small', 'Medium', 'Large', 'Medium', 'Small'],
    'Rating': ['Good', 'Excellent', 'Fair', 'Good', 'Excellent']
})
df

   Color    Size     Rating
0    Red   Small       Good
1   Blue  Medium  Excellent
2  Green   Large       Fair
3    Red  Medium       Good
4  Green   Small  Excellent

In [102]:
# Convert a single column to categorical
df['Color'] = df['Color'].astype('category')
df['Color']

0      Red
1     Blue
2    Green
3      Red
4    Green
Name: Color, dtype: category
Categories (3, object): ['Blue', 'Green', 'Red']

In [104]:
# Convert multiple columns to categorical
df[['Size', 'Rating']] = df[['Size', 'Rating']].astype('category')

df[['Size', 'Rating']]

     Size     Rating
0   Small       Good
1  Medium  Excellent
2   Large       Fair
3  Medium       Good
4   Small  Excellent

In [105]:
df.dtypes

Color     category
Size      category
Rating    category
dtype: object

You can also use the `pd.Categorical()` function to convert columns

In [106]:
df['Color'] = pd.Categorical(df['Color'])
df['Color']

0      Red
1     Blue
2    Green
3      Red
4    Green
Name: Color, dtype: category
Categories (3, object): ['Blue', 'Green', 'Red']

### Specifying Category Order
For ordinal categorical data, you can specify the order of categories:

In [109]:
# Create ordered categorical data
df['Size'] = pd.Categorical(
    df['Size'],
    categories=['Small', 'Medium', 'Large'],
    ordered=True
)
df['Size']

0     Small
1    Medium
2     Large
3    Medium
4     Small
Name: Size, dtype: category
Categories (3, object): ['Small' < 'Medium' < 'Large']

In [110]:
df['Rating'] = pd.Categorical(
    df['Rating'],
    categories=['Poor', 'Fair', 'Good', 'Excellent'],
    ordered=True
)
df['Rating']

0         Good
1    Excellent
2         Fair
3         Good
4    Excellent
Name: Rating, dtype: category
Categories (4, object): ['Poor' < 'Fair' < 'Good' < 'Excellent']

In [111]:
# Demonstrate the order
df['Size'].cat.ordered
df['Size'].cat.categories

Index(['Small', 'Medium', 'Large'], dtype='object')

In [112]:
# Compare values
df['Size'][0] < df['Size'][1]

False

In [113]:
# Change category order
df['Color'] = df['Color'].cat.reorder_categories(['Blue', 'Green', 'Red'], ordered=True)
df['Color'].cat.categories

Index(['Blue', 'Green', 'Red'], dtype='object')

In [114]:
# Sort the DataFrame by the ordered categorical columns
df.sort_values(['Rating', 'Size'])

   Color    Size     Rating
2  Green   Large       Fair
0    Red   Small       Good
3    Red  Medium       Good
4  Green   Small  Excellent
1   Blue  Medium  Excellent

### Working with Categorical Data
Once you have created categorical data, Pandas provides various methods to manipulate and analyze it. Let's explore some common operations.

#### Accessing Categories
You can access the categories of a categorical column using the `.cat.categories` attribute:

In [115]:
# Create a sample DataFrame with categorical data
df = pd.DataFrame({
    'Color': pd.Categorical(['Red', 'Blue', 'Green', 'Red', 'Blue']),
    'Size': pd.Categorical(
        ['Small', 'Medium', 'Large', 'Medium', 'Small'],
        categories=['Small', 'Medium', 'Large'],
        ordered=True
    )
})
df

   Color    Size
0    Red   Small
1   Blue  Medium
2  Green   Large
3    Red  Medium
4   Blue   Small

In [117]:
# Access categories
df['Color'].cat.categories
#df['Size'].cat.categories

Index(['Blue', 'Green', 'Red'], dtype='object')

In [118]:
# Check if the categorical data is ordered
df['Color'].cat.ordered
df['Size'].cat.ordered

True

In [119]:
# Get category codes (underlying integer representation)
df['Color'].cat.codes

0    2
1    0
2    1
3    2
4    0
dtype: int8

### Adding and Removing Categories
You can add new categories or remove existing ones:

In [120]:
# Add a new category
df['Color'] = df['Color'].cat.add_categories(['Yellow'])
df['Color'].cat.categories

Index(['Blue', 'Green', 'Red', 'Yellow'], dtype='object')

In [121]:
# Remove a category
df['Color'] = df['Color'].cat.remove_categories(['Green'])
df['Color'].cat.categories

Index(['Blue', 'Red', 'Yellow'], dtype='object')

In [122]:
# Remove unused categories
df['Color'] = df['Color'].cat.remove_unused_categories()
df['Color'].cat.categories

Index(['Blue', 'Red'], dtype='object')

In [123]:
# Set new categories (this will remove any categories not specified)
df['Size'] = df['Size'].cat.set_categories(['Tiny', 'Small', 'Medium', 'Large', 'Huge'])
df['Size'].cat.categories

Index(['Tiny', 'Small', 'Medium', 'Large', 'Huge'], dtype='object')

In [124]:
# Add multiple categories at once
df['Color'] = df['Color'].cat.add_categories(['Green', 'Purple', 'Orange'])
df['Color'].cat.categories

Index(['Blue', 'Red', 'Green', 'Purple', 'Orange'], dtype='object')

### Renaming Categories
You can rename categories using the rename_categories() method:

In [126]:
# Rename individual categories
df['Color'] = df['Color'].cat.rename_categories({'Red': 'Crimson', 'Blue': 'Navy'})
df['Color'].cat.categories

Index(['Navy', 'Crimson', 'Green', 'Purple', 'Orange'], dtype='object')

In [127]:
# Rename all categories at once with a list (must match the number of existing categories)
df['Size'] = df['Size'].cat.rename_categories(['XS', 'S', 'M', 'L', 'XL'])
df['Size'].cat.categories

Index(['XS', 'S', 'M', 'L', 'XL'], dtype='object')

In [128]:
# Rename categories using a function
df['Color'] = df['Color'].cat.rename_categories(lambda x: x.upper())
df['Color'].cat.categories

Index(['NAVY', 'CRIMSON', 'GREEN', 'PURPLE', 'ORANGE'], dtype='object')

In [130]:
# Create a new categorical column
df['Rating'] = pd.Categorical(['Good', 'Fair', 'Excellent', 'Good', 'Fair'])
df

     Color Size     Rating
0  CRIMSON    S       Good
1     NAVY    M       Fair
2      NaN    L  Excellent
3  CRIMSON    M       Good
4     NAVY    S       Fair

In [131]:
# Rename specific categories
df['Rating'] = df['Rating'].cat.rename_categories({'Good': 'Average', 'Excellent': 'Outstanding'})
df['Rating'].cat.categories

Index(['Outstanding', 'Fair', 'Average'], dtype='object')

In [132]:
# Display the updated DataFrame
df

     Color Size       Rating
0  CRIMSON    S      Average
1     NAVY    M         Fair
2      NaN    L  Outstanding
3  CRIMSON    M      Average
4     NAVY    S         Fair

### Sorting and Ordering Categorical Data
Sorting and ordering categorical data is a common task in data analysis. Pandas provides several methods to sort categorical data, both for ordered and unordered categories.

#### Sorting with Ordered Categories
When your categorical data has a specified order, sorting becomes straightforward

In [133]:
# Create a DataFrame with ordered categorical data
df = pd.DataFrame({
    'Size': pd.Categorical(['Medium', 'Small', 'Large', 'Small', 'Medium'],
                           categories=['Small', 'Medium', 'Large'],
                           ordered=True),
    'Count': [5, 2, 8, 3, 4]
})
df

     Size  Count
0  Medium      5
1   Small      2
2   Large      8
3   Small      3
4  Medium      4

In [134]:
# Sort the DataFrame by the 'Size' column
df.sort_values('Size')

     Size  Count
1   Small      2
3   Small      3
0  Medium      5
4  Medium      4
2   Large      8

In [135]:
# Sort in descending order
df.sort_values('Size', ascending=False)

     Size  Count
2   Large      8
0  Medium      5
4  Medium      4
1   Small      2
3   Small      3

#### Sorting with Unordered Categories
For unordered categories, the default sorting is alphabetical:

In [136]:
# Create a DataFrame with unordered categorical data
df = pd.DataFrame({
    'Color': pd.Categorical(['Red', 'Blue', 'Green', 'Blue', 'Red']),
    'Value': [10, 20, 15, 25, 5]
})

# Sort by the 'Color' column
df.sort_values('Color')

   Color  Value
1   Blue     20
3   Blue     25
2  Green     15
0    Red     10
4    Red      5

In [137]:
# Specify a custom order for sorting
custom_order = ['Green', 'Blue', 'Red']
df['Color'] = df['Color'].cat.reorder_categories(custom_order, ordered=True)

# Now sort using the custom order
df.sort_values('Color')

   Color  Value
2  Green     15
1   Blue     20
3   Blue     25
0    Red     10
4    Red      5

#### Sorting with Multiple Columns
You can sort by multiple columns, including a mix of categorical and non-categorical data:

In [138]:
# Sort by 'Color' (categorical) and then by 'Value' (numeric)
df.sort_values(['Color', 'Value'])

   Color  Value
2  Green     15
1   Blue     20
3   Blue     25
4    Red      5
0    Red     10

#### Sorting Index
You can also sort the index if it's categorical:

In [139]:
# Create a DataFrame with a categorical index
df = pd.DataFrame({
    'Value': [10, 20, 30, 40, 50]
}, index=pd.CategoricalIndex(
        ['Medium', 'Small', 'Large', 'Tiny', 'Huge'],
        categories=['Tiny', 'Small', 'Medium', 'Large', 'Huge'],
        ordered=True
    )
)

# Sort by index
df.sort_index()

        Value
Tiny       40
Small      20
Medium     10
Large      30
Huge       50

### NaN Handling
By default, NaN values are placed at the end when sorting:

In [140]:
# Create a DataFrame with NaN values
df = pd.DataFrame({
    'Category': pd.Categorical(['A', 'B', np.nan, 'C', 'B', np.nan],
                               categories=['C', 'B', 'A'],
                               ordered=True)
})
df

  Category
0        A
1        B
2      NaN
3        C
4        B
5      NaN

In [141]:
# Sort the DataFrame
df.sort_values('Category')

  Category
3        C
1        B
4        B
0        A
2      NaN
5      NaN

In [142]:
# Place NaN values at the beginning
df.sort_values('Category', na_position='first')

  Category
2      NaN
5      NaN
3        C
1        B
4        B
0        A

### Memory Efficiency of Categorical Data
One of the key advantages of using categorical data in Pandas is its memory efficiency, especially when dealing with datasets that contain repeated values. Let's explore this concept in detail.

#### Understanding Memory Usage
To demonstrate the memory efficiency of categorical data, we'll compare it with other data types:

In [143]:
# Create a large DataFrame with repeated string values
n = 1_000_000
df = pd.DataFrame({
    'ID': range(n),
    'Category': np.random.choice(['A', 'B', 'C', 'D', 'E'], n)
})
df

            ID Category
0            0        E
1            1        B
2            2        D
3            3        D
4            4        A
...        ...      ...
999995  999995        B
999996  999996        C
999997  999997        B
999998  999998        C
999999  999999        A

[1000000 rows x 2 columns]

In [144]:
# Check memory usage
df.memory_usage(deep=True)

Index            132
ID           8000000
Category    50000000
dtype: int64

In [146]:
# Convert 'Category' to categorical
df['Category_Cat'] = df['Category'].astype('category')

In [147]:
# Compare memory usage
df.memory_usage(deep=True)

Index                132
ID               8000000
Category        50000000
Category_Cat     1000422
dtype: int64

### Factors Affecting Memory Efficiency
1. Number of unique categories: The fewer unique categories you have relative to the total number of rows, the more memory you save.
 
2. Length of category names: Longer category names lead to greater memory savings when converted to categorical.
   
3. Number of rows: The memory savings become more pronounced as the number of rows increases.

In [153]:
# Function to create DataFrame and measure memory
def measure_memory(n_rows, n_categories, cat_length):
    categories = [''.join(np.random.choice(list('ABCDEFGHIJKLMNOPQRSTUVWXYZ'), cat_length)) for _ in range(n_categories)]
    df = pd.DataFrame({
        'String': np.random.choice(categories, n_rows),
        'Categorical': pd.Categorical(np.random.choice(categories, n_rows))
    })
    mem_usage = df.memory_usage(deep=True)
    print(f"String column: {mem_usage['String'] / 1e6:.2f} MB")
    print(f"Categorical column: {mem_usage['Categorical'] / 1e6:.2f} MB")
    print(f"Memory saved: {(1 - mem_usage['Categorical'] / mem_usage['String']) * 100:.2f}%")

In [152]:
[''.join(np.random.choice(list('ABCDEFGHIJKLMNOPQRSTUVWXYZ'),19)) for _ in range(5)]

['KEXEGNGQPIDLXCJTBBO',
 'EDVKBYKBWLBXDAXVGJQ',
 'UFDBDGCORSCSPFFKOAG',
 'BJHWXIRPQUMJIMGLYEJ',
 'HRTBZUJBDFXIUIEXIHP']

In [154]:
# Test with different scenarios
print("Scenario 1: Many rows, few categories")
measure_memory(n_rows=1_000_000, n_categories=5, cat_length=3)

Scenario 1: Many rows, few categories
String column: 52.00 MB
Categorical column: 1.00 MB
Memory saved: 98.08%

In [155]:
print("\nScenario 2: Many rows, many categories")
measure_memory(n_rows=1_000_000, n_categories=1000, cat_length=3)

Scenario 2: Many rows, many categories
String column: 52.00 MB
Categorical column: 2.08 MB
Memory saved: 95.99%

In [157]:
print("\nScenario 3: Many rows, few categories, long category names")
measure_memory(n_rows=1_000_000, n_categories=5, cat_length=20)

Scenario 3: Many rows, few categories, long category names
String column: 69.00 MB
Categorical column: 1.00 MB
Memory saved: 98.55%

## When to Use Categorical Data
Categorical data is most beneficial when:

1. Your data has a limited number of unique values that are repeated many times.
2. You're working with large datasets where memory usage is a concern.
3. You need to perform operations that can benefit from the ordered nature of categories.

However, for columns with mostly unique values or very few rows, the memory savings might be negligible or even negative due to the overhead of the categorical data structure.

#### Impact on Performance
Besides memory efficiency, categorical data can also improve performance for certain operations:

In [158]:
# Create a large DataFrame
n = 5_000_000
df = pd.DataFrame({
    'String': np.random.choice(['A', 'B', 'C', 'D', 'E'], n),
    'Categorical': pd.Categorical(np.random.choice(['A', 'B', 'C', 'D', 'E'], n))
})
df

        String Categorical
0            D           E
1            A           B
2            D           A
3            E           D
4            A           B
...        ...         ...
4999995      B           C
4999996      A           B
4999997      A           D
4999998      C           D
4999999      C           A

[5000000 rows x 2 columns]

In [159]:

%timeit df['String'].value_counts()

143 ms  7.52 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

In [160]:
%timeit df['Categorical'].value_counts()

18.8 ms  1.67 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

### Encoding Categorical Data
Encoding categorical data is a crucial step in preparing data for many machine learning algorithms that require numerical input. Pandas provides several methods to encode categorical data. We'll focus on two common encoding techniques: One-Hot Encoding and Ordinal Encoding.

### One-Hot Encoding
One-hot encoding creates binary columns for each category in a categorical variable. This is useful for nominal categorical data where there's no inherent order among categories.

In [161]:
# Create a sample DataFrame
df = pd.DataFrame({
    'Color': ['Red', 'Blue', 'Green', 'Red', 'Green'],
    'Size': ['Small', 'Medium', 'Large', 'Medium', 'Small']
})

# Perform one-hot encoding
df_encoded = pd.get_dummies(df, columns=['Color', 'Size'])
df_encoded

   Color_Blue  Color_Green  Color_Red  Size_Large  Size_Medium  Size_Small
0       False        False       True       False        False        True
1        True        False      False       False         True       False
2       False         True      False        True        False       False
3       False        False       True       False         True       False
4       False         True      False       False        False        True

In [162]:
# Custom prefix
df_encoded = pd.get_dummies(df, columns=['Color', 'Size'], prefix=['C', 'S'])
df_encoded

   C_Blue  C_Green  C_Red  S_Large  S_Medium  S_Small
0   False    False   True    False     False     True
1    True    False  False    False      True    False
2   False     True  False     True     False    False
3   False    False   True    False      True    False
4   False     True  False    False     False     True

In [163]:
# Create training and test data
df_train = pd.DataFrame({
    'Color': ['Red', 'Blue', 'Green', 'Red', 'Green']
})

df_test = pd.DataFrame({
    'Color': ['Red', 'Blue', 'Yellow', 'Green', 'Orange']
})

In [164]:
df_train

   Color
0    Red
1   Blue
2  Green
3    Red
4  Green

In [165]:
df_test

    Color
0     Red
1    Blue
2  Yellow
3   Green
4  Orange

In [166]:
# One-hot encode with all categories from both datasets
all_categories = pd.concat([df_train['Color'], df_test['Color']]).unique()
# df_train_encoded = pd.get_dummies(df_train, columns=['Color'], prefix=['Color'])
# df_test_encoded = pd.get_dummies(df_test, columns=['Color'], prefix=['Color'])
all_categories

array(['Red', 'Blue', 'Green', 'Yellow', 'Orange'], dtype=object)

In [167]:
# One-hot encode with all categories from both datasets

df_train_encoded = pd.get_dummies(df_train, columns=['Color'], prefix=['Color'])
# df_test_encoded = pd.get_dummies(df_test, columns=['Color'], prefix=['Color'])
df_train_encoded

   Color_Blue  Color_Green  Color_Red
0       False        False       True
1        True        False      False
2       False         True      False
3       False        False       True
4       False         True      False

In [168]:
# One-hot encode with all categories from both datasets
all_categories = pd.concat([df_train['Color'], df_test['Color']]).unique()
df_train_encoded = pd.get_dummies(df_train, columns=['Color'], prefix=['Color'])
df_test_encoded = pd.get_dummies(df_test, columns=['Color'], prefix=['Color'])

In [169]:
# Ensure both have the same columns
for category in all_categories:
    if f'Color_{category}' not in df_train_encoded.columns:
        df_train_encoded[f'Color_{category}'] = False
    if f'Color_{category}' not in df_test_encoded.columns:
        df_test_encoded[f'Color_{category}'] = False

print("Train data:")
df_train_encoded

Train data:

   Color_Blue  Color_Green  Color_Red  Color_Yellow  Color_Orange
0       False        False       True         False         False
1        True        False      False         False         False
2       False         True      False         False         False
3       False        False       True         False         False
4       False         True      False         False         False

In [170]:
print("\nTest data:")
df_test_encoded

Test data:

   Color_Blue  Color_Green  Color_Orange  Color_Red  Color_Yellow
0       False        False         False       True         False
1        True        False         False      False         False
2       False        False         False      False          True
3       False         True         False      False         False
4       False        False          True      False         False

### Ordinal Encoding
Ordinal encoding assigns an integer to each category. This is useful for ordinal categorical data where there's a clear ordering of categories.

In [171]:
# Create a DataFrame with ordinal data
df = pd.DataFrame({
    'Size': ['Small', 'Medium', 'Large', 'Medium', 'Small'],
    'Quality': ['Low', 'Medium', 'High', 'Medium', 'Low']
})
df

     Size Quality
0   Small     Low
1  Medium  Medium
2   Large    High
3  Medium  Medium
4   Small     Low

In [172]:
# Define the order of categories
size_order = ['Small', 'Medium', 'Large']
quality_order = ['Low', 'Medium', 'High']
# Perform ordinal encoding
df['Size_Encoded'] = pd.Categorical(df['Size'], categories=size_order, ordered=True).codes
df['Quality_Encoded'] = pd.Categorical(df['Quality'], categories=quality_order, ordered=True).codes
df

     Size Quality  Size_Encoded  Quality_Encoded
0   Small     Low             0                0
1  Medium  Medium             1                1
2   Large    High             2                2
3  Medium  Medium             1                1
4   Small     Low             0                0

In [ ]:
from sklearn.preprocessing import OrdinalEncoder

# Create an OrdinalEncoder
encoder = OrdinalEncoder(categories=[size_order, quality_order])
# Fit and transform the data
encoded_data = encoder.fit_transform(df[['Size', 'Quality']])

In [ ]:
# Create a new DataFrame with encoded values
df_encoded = pd.DataFrame(encoded_data, columns=['Size_Encoded', 'Quality_Encoded'])
df_encoded

In [ ]:
# Combine with original data
df_final = pd.concat([df, df_encoded], axis=1)
df_final